RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*!
 * @name Register DMA_HRS, field HRS30[30] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 30 is not present
 * - 0b1 - A hardware service request for for channel 30 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS30 field. */
#define DMA_RD_HRS_HRS30(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS30_MASK) >> DMA_HRS_HRS30_SHIFT)
#define DMA_BRD_HRS_HRS30(base) (BME_UBFX32(&DMA_HRS_REG(base), DMA_HRS_HRS30_SHIFT, DMA_HRS_HRS30_WIDTH))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS31[31] (RO)
 *
 * The HRS bit for its respective channel remains asserted for the period when a
 * Hardware Request is Present on the Channel. After the Request is completed
 * and Channel is free, the HRS bit is automatically cleared by hardware.
 *
 * Values:
 * - 0b0 - A hardware service request for channel 31 is not present
 * - 0b1 - A hardware service request for channel 31 is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS31 field. */
#define DMA_RD_HRS_HRS31(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS31_MASK) >> DMA_HRS_HRS31_SHIFT)
#define DMA_BRD_HRS_HRS31(base) (BME_UBFX32(&DMA_HRS_REG(base), DMA_HRS_HRS31_SHIFT, DMA_HRS_HRS31_WIDTH))
/*@}*/

/*******************************************************************************
 * DMA_EARS - Enable Asynchronous Request in Stop Register
 ******************************************************************************/

/*!
 * @brief DMA_EARS - Enable Asynchronous Request in Stop Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DMA_EARS register
 */
/*@{*/
#define DMA_RD_EARS(base)        (DMA_EARS_REG(base))
#define DMA_WR_EARS(base, value) (DMA_EARS_REG(base) = (value))
#define DMA_RMW_EARS(base, mask, value) (DMA_WR_EARS(base, (DMA_RD_EARS(base) & ~(mask)) | (value)))
#define DMA_SET_EARS(base, value) (BME_OR32(&DMA_EARS_REG(base), (uint32_t)(value)))
#define DMA_CLR_EARS(base, value) (BME_AND32(&DMA_EARS_REG(base), (uint32_t)(~(value))))
#define DMA_TOG_EARS(base, value) (BME_XOR32(&DMA_EARS_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual DMA_EARS bitfields
 */

/*!
 * @name Register DMA_EARS, field EDREQ_0[0] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 0.
 * - 0b1 - Enable asynchronous DMA request for channel 0.
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_0 field. */
#define DMA_RD_EARS_EDREQ_0(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_0_MASK) >> DMA_EARS_EDREQ_0_SHIFT)
#define DMA_BRD_EARS_EDREQ_0(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_0_SHIFT, DMA_EARS_EDREQ_0_WIDTH))

/*! @brief Set the EDREQ_0 field to a new value. */
#define DMA_WR_EARS_EDREQ_0(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_0_MASK, DMA_EARS_EDREQ_0(value)))
#define DMA_BWR_EARS_EDREQ_0(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_0_SHIFT), DMA_EARS_EDREQ_0_SHIFT, DMA_EARS_EDREQ_0_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_1[1] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 1
 * - 0b1 - Enable asynchronous DMA request for channel 1.
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_1 field. */
#define DMA_RD_EARS_EDREQ_1(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_1_MASK) >> DMA_EARS_EDREQ_1_SHIFT)
#define DMA_BRD_EARS_EDREQ_1(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_1_SHIFT, DMA_EARS_EDREQ_1_WIDTH))

/*! @brief Set the EDREQ_1 field to a new value. */
#define DMA_WR_EARS_EDREQ_1(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_1_MASK, DMA_EARS_EDREQ_1(value)))
#define DMA_BWR_EARS_EDREQ_1(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_1_SHIFT), DMA_EARS_EDREQ_1_SHIFT, DMA_EARS_EDREQ_1_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_2[2] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 2.
 * - 0b1 - Enable asynchronous DMA request for channel 2.
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_2 field. */
#define DMA_RD_EARS_EDREQ_2(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_2_MASK) >> DMA_EARS_EDREQ_2_SHIFT)
#define DMA_BRD_EARS_EDREQ_2(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_2_SHIFT, DMA_EARS_EDREQ_2_WIDTH))

/*! @brief Set the EDREQ_2 field to a new value. */
#define DMA_WR_EARS_EDREQ_2(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_2_MASK, DMA_EARS_EDREQ_2(value)))
#define DMA_BWR_EARS_EDREQ_2(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_2_SHIFT), DMA_EARS_EDREQ_2_SHIFT, DMA_EARS_EDREQ_2_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_3[3] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 3.
 * - 0b1 - Enable asynchronous DMA request for channel 3.
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_3 field. */
#define DMA_RD_EARS_EDREQ_3(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_3_MASK) >> DMA_EARS_EDREQ_3_SHIFT)
#define DMA_BRD_EARS_EDREQ_3(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_3_SHIFT, DMA_EARS_EDREQ_3_WIDTH))

/*! @brief Set the EDREQ_3 field to a new value. */
#define DMA_WR_EARS_EDREQ_3(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_3_MASK, DMA_EARS_EDREQ_3(value)))
#define DMA_BWR_EARS_EDREQ_3(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_3_SHIFT), DMA_EARS_EDREQ_3_SHIFT, DMA_EARS_EDREQ_3_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_4[4] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 4.
 * - 0b1 - Enable asynchronous DMA request for channel 4.
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_4 field. */
#define DMA_RD_EARS_EDREQ_4(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_4_MASK) >> DMA_EARS_EDREQ_4_SHIFT)
#define DMA_BRD_EARS_EDREQ_4(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_4_SHIFT, DMA_EARS_EDREQ_4_WIDTH))

/*! @brief Set the EDREQ_4 field to a new value. */
#define DMA_WR_EARS_EDREQ_4(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_4_MASK, DMA_EARS_EDREQ_4(value)))
#define DMA_BWR_EARS_EDREQ_4(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_4_SHIFT), DMA_EARS_EDREQ_4_SHIFT, DMA_EARS_EDREQ_4_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_5[5] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 5.
 * - 0b1 - Enable asynchronous DMA request for channel 5.
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_5 field. */
#define DMA_RD_EARS_EDREQ_5(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_5_MASK) >> DMA_EARS_EDREQ_5_SHIFT)
#define DMA_BRD_EARS_EDREQ_5(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_5_SHIFT, DMA_EARS_EDREQ_5_WIDTH))

/*! @brief Set the EDREQ_5 field to a new value. */
#define DMA_WR_EARS_EDREQ_5(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_5_MASK, DMA_EARS_EDREQ_5(value)))
#define DMA_BWR_EARS_EDREQ_5(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_5_SHIFT), DMA_EARS_EDREQ_5_SHIFT, DMA_EARS_EDREQ_5_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_6[6] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 6.
 * - 0b1 - Enable asynchronous DMA request for channel 6.
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_6 field. */
#define DMA_RD_EARS_EDREQ_6(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_6_MASK) >> DMA_EARS_EDREQ_6_SHIFT)
#define DMA_BRD_EARS_EDREQ_6(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_6_SHIFT, DMA_EARS_EDREQ_6_WIDTH))

/*! @brief Set the EDREQ_6 field to a new value. */
#define DMA_WR_EARS_EDREQ_6(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_6_MASK, DMA_EARS_EDREQ_6(value)))
#define DMA_BWR_EARS_EDREQ_6(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_6_SHIFT), DMA_EARS_EDREQ_6_SHIFT, DMA_EARS_EDREQ_6_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_7[7] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 7.
 * - 0b1 - Enable asynchronous DMA request for channel 7.
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_7 field. */
#define DMA_RD_EARS_EDREQ_7(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_7_MASK) >> DMA_EARS_EDREQ_7_SHIFT)
#define DMA_BRD_EARS_EDREQ_7(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_7_SHIFT, DMA_EARS_EDREQ_7_WIDTH))

/*! @brief Set the EDREQ_7 field to a new value. */
#define DMA_WR_EARS_EDREQ_7(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_7_MASK, DMA_EARS_EDREQ_7(value)))
#define DMA_BWR_EARS_EDREQ_7(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_7_SHIFT), DMA_EARS_EDREQ_7_SHIFT, DMA_EARS_EDREQ_7_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_8[8] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 8.
 * - 0b1 - Enable asynchronous DMA request for channel 8.
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_8 field. */
#define DMA_RD_EARS_EDREQ_8(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_8_MASK) >> DMA_EARS_EDREQ_8_SHIFT)
#define DMA_BRD_EARS_EDREQ_8(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_8_SHIFT, DMA_EARS_EDREQ_8_WIDTH))

/*! @brief Set the EDREQ_8 field to a new value. */
#define DMA_WR_EARS_EDREQ_8(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_8_MASK, DMA_EARS_EDREQ_8(value)))
#define DMA_BWR_EARS_EDREQ_8(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_8_SHIFT), DMA_EARS_EDREQ_8_SHIFT, DMA_EARS_EDREQ_8_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_9[9] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 9.
 * - 0b1 - Enable asynchronous DMA request for channel 9.
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_9 field. */
#define DMA_RD_EARS_EDREQ_9(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_9_MASK) >> DMA_EARS_EDREQ_9_SHIFT)
#define DMA_BRD_EARS_EDREQ_9(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_9_SHIFT, DMA_EARS_EDREQ_9_WIDTH))

