RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*
 * Constants & macros for individual DMA_DCHPRI21 bitfields
 */

/*!
 * @name Register DMA_DCHPRI21, field CHPRI[3:0] (RW)
 *
 * Channel priority when fixed-priority arbitration is enabled Reset value for
 * the group and channel priority fields, GRPPRI and CHPRI, is equal to the
 * corresponding channel number for each priority register, that is, DCHPRI31[GRPPRI] =
 * 0b01 and DCHPRI31[CHPRI] = 0b01111.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI21_CHPRI field. */
#define DMA_RD_DCHPRI21_CHPRI(base) ((DMA_DCHPRI21_REG(base) & DMA_DCHPRI21_CHPRI_MASK) >> DMA_DCHPRI21_CHPRI_SHIFT)
#define DMA_BRD_DCHPRI21_CHPRI(base) (BME_UBFX8(&DMA_DCHPRI21_REG(base), DMA_DCHPRI21_CHPRI_SHIFT, DMA_DCHPRI21_CHPRI_WIDTH))

/*! @brief Set the CHPRI field to a new value. */
#define DMA_WR_DCHPRI21_CHPRI(base, value) (DMA_RMW_DCHPRI21(base, DMA_DCHPRI21_CHPRI_MASK, DMA_DCHPRI21_CHPRI(value)))
#define DMA_BWR_DCHPRI21_CHPRI(base, value) (BME_BFI8(&DMA_DCHPRI21_REG(base), ((uint8_t)(value) << DMA_DCHPRI21_CHPRI_SHIFT), DMA_DCHPRI21_CHPRI_SHIFT, DMA_DCHPRI21_CHPRI_WIDTH))
/*@}*/

/*!
 * @name Register DMA_DCHPRI21, field GRPPRI[5:4] (RO)
 *
 * Group priority assigned to this channel group when fixed-priority arbitration
 * is enabled. This field is read-only; writes are ignored. Reset value for the
 * group and channel priority fields, GRPPRI and CHPRI, is equal to the
 * corresponding channel number for each priority register, that is, DCHPRI31[GRPPRI] =
 * 0b01 and DCHPRI31[CHPRI] equals 0b1111.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI21_GRPPRI field. */
#define DMA_RD_DCHPRI21_GRPPRI(base) ((DMA_DCHPRI21_REG(base) & DMA_DCHPRI21_GRPPRI_MASK) >> DMA_DCHPRI21_GRPPRI_SHIFT)
#define DMA_BRD_DCHPRI21_GRPPRI(base) (BME_UBFX8(&DMA_DCHPRI21_REG(base), DMA_DCHPRI21_GRPPRI_SHIFT, DMA_DCHPRI21_GRPPRI_WIDTH))
/*@}*/

/*!
 * @name Register DMA_DCHPRI21, field DPA[6] (RW)
 *
 * Values:
 * - 0b0 - Channel n can suspend a lower priority channel.
 * - 0b1 - Channel n cannot suspend any channel, regardless of channel priority.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI21_DPA field. */
#define DMA_RD_DCHPRI21_DPA(base) ((DMA_DCHPRI21_REG(base) & DMA_DCHPRI21_DPA_MASK) >> DMA_DCHPRI21_DPA_SHIFT)
#define DMA_BRD_DCHPRI21_DPA(base) (BME_UBFX8(&DMA_DCHPRI21_REG(base), DMA_DCHPRI21_DPA_SHIFT, DMA_DCHPRI21_DPA_WIDTH))

/*! @brief Set the DPA field to a new value. */
#define DMA_WR_DCHPRI21_DPA(base, value) (DMA_RMW_DCHPRI21(base, DMA_DCHPRI21_DPA_MASK, DMA_DCHPRI21_DPA(value)))
#define DMA_BWR_DCHPRI21_DPA(base, value) (BME_BFI8(&DMA_DCHPRI21_REG(base), ((uint8_t)(value) << DMA_DCHPRI21_DPA_SHIFT), DMA_DCHPRI21_DPA_SHIFT, DMA_DCHPRI21_DPA_WIDTH))
/*@}*/

/*!
 * @name Register DMA_DCHPRI21, field ECP[7] (RW)
 *
 * Values:
 * - 0b0 - Channel n cannot be suspended by a higher priority channel's service
 *     request.
 * - 0b1 - Channel n can be temporarily suspended by the service request of a
 *     higher priority channel.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI21_ECP field. */
#define DMA_RD_DCHPRI21_ECP(base) ((DMA_DCHPRI21_REG(base) & DMA_DCHPRI21_ECP_MASK) >> DMA_DCHPRI21_ECP_SHIFT)
#define DMA_BRD_DCHPRI21_ECP(base) (BME_UBFX8(&DMA_DCHPRI21_REG(base), DMA_DCHPRI21_ECP_SHIFT, DMA_DCHPRI21_ECP_WIDTH))

/*! @brief Set the ECP field to a new value. */
#define DMA_WR_DCHPRI21_ECP(base, value) (DMA_RMW_DCHPRI21(base, DMA_DCHPRI21_ECP_MASK, DMA_DCHPRI21_ECP(value)))
#define DMA_BWR_DCHPRI21_ECP(base, value) (BME_BFI8(&DMA_DCHPRI21_REG(base), ((uint8_t)(value) << DMA_DCHPRI21_ECP_SHIFT), DMA_DCHPRI21_ECP_SHIFT, DMA_DCHPRI21_ECP_WIDTH))
/*@}*/

/*******************************************************************************
 * DMA_DCHPRI20 - Channel n Priority Register
 ******************************************************************************/

/*!
 * @brief DMA_DCHPRI20 - Channel n Priority Register (RW)
 *
 * Reset value: 0x00U
 *
 * When fixed-priority channel arbitration is enabled (CR[ERCA] = 0), the
 * contents of these registers define the unique priorities associated with each
 * channel within a group. The channel priorities are evaluated by numeric value; for
 * example, 0 is the lowest priority, 1 is the next higher priority, then 2, 3,
 * etc. Software must program the channel priorities with unique values; otherwise,
 * a configuration error is reported. The range of the priority value is limited
 * to the values of 0 through 15. When read, the GRPPRI bits of the DCHPRIn
 * register reflect the current priority level of the group of channels in which the
 * corresponding channel resides. GRPPRI bits are not affected by writes to the
 * DCHPRIn registers. The group priority is assigned in the DMA control register.
 */
/*!
 * @name Constants and macros for entire DMA_DCHPRI20 register
 */
/*@{*/
#define DMA_RD_DCHPRI20(base)    (DMA_DCHPRI20_REG(base))
#define DMA_WR_DCHPRI20(base, value) (DMA_DCHPRI20_REG(base) = (value))
#define DMA_RMW_DCHPRI20(base, mask, value) (DMA_WR_DCHPRI20(base, (DMA_RD_DCHPRI20(base) & ~(mask)) | (value)))
#define DMA_SET_DCHPRI20(base, value) (BME_OR8(&DMA_DCHPRI20_REG(base), (uint8_t)(value)))
#define DMA_CLR_DCHPRI20(base, value) (BME_AND8(&DMA_DCHPRI20_REG(base), (uint8_t)(~(value))))
#define DMA_TOG_DCHPRI20(base, value) (BME_XOR8(&DMA_DCHPRI20_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual DMA_DCHPRI20 bitfields
 */

/*!
 * @name Register DMA_DCHPRI20, field CHPRI[3:0] (RW)
 *
 * Channel priority when fixed-priority arbitration is enabled Reset value for
 * the group and channel priority fields, GRPPRI and CHPRI, is equal to the
 * corresponding channel number for each priority register, that is, DCHPRI31[GRPPRI] =
 * 0b01 and DCHPRI31[CHPRI] = 0b01111.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI20_CHPRI field. */
#define DMA_RD_DCHPRI20_CHPRI(base) ((DMA_DCHPRI20_REG(base) & DMA_DCHPRI20_CHPRI_MASK) >> DMA_DCHPRI20_CHPRI_SHIFT)
#define DMA_BRD_DCHPRI20_CHPRI(base) (BME_UBFX8(&DMA_DCHPRI20_REG(base), DMA_DCHPRI20_CHPRI_SHIFT, DMA_DCHPRI20_CHPRI_WIDTH))

/*! @brief Set the CHPRI field to a new value. */
#define DMA_WR_DCHPRI20_CHPRI(base, value) (DMA_RMW_DCHPRI20(base, DMA_DCHPRI20_CHPRI_MASK, DMA_DCHPRI20_CHPRI(value)))
#define DMA_BWR_DCHPRI20_CHPRI(base, value) (BME_BFI8(&DMA_DCHPRI20_REG(base), ((uint8_t)(value) << DMA_DCHPRI20_CHPRI_SHIFT), DMA_DCHPRI20_CHPRI_SHIFT, DMA_DCHPRI20_CHPRI_WIDTH))
/*@}*/

/*!
 * @name Register DMA_DCHPRI20, field GRPPRI[5:4] (RO)
 *
 * Group priority assigned to this channel group when fixed-priority arbitration
 * is enabled. This field is read-only; writes are ignored. Reset value for the
 * group and channel priority fields, GRPPRI and CHPRI, is equal to the
 * corresponding channel number for each priority register, that is, DCHPRI31[GRPPRI] =
 * 0b01 and DCHPRI31[CHPRI] equals 0b1111.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI20_GRPPRI field. */
#define DMA_RD_DCHPRI20_GRPPRI(base) ((DMA_DCHPRI20_REG(base) & DMA_DCHPRI20_GRPPRI_MASK) >> DMA_DCHPRI20_GRPPRI_SHIFT)
#define DMA_BRD_DCHPRI20_GRPPRI(base) (BME_UBFX8(&DMA_DCHPRI20_REG(base), DMA_DCHPRI20_GRPPRI_SHIFT, DMA_DCHPRI20_GRPPRI_WIDTH))
/*@}*/

/*!
 * @name Register DMA_DCHPRI20, field DPA[6] (RW)
 *
 * Values:
 * - 0b0 - Channel n can suspend a lower priority channel.
 * - 0b1 - Channel n cannot suspend any channel, regardless of channel priority.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI20_DPA field. */
#define DMA_RD_DCHPRI20_DPA(base) ((DMA_DCHPRI20_REG(base) & DMA_DCHPRI20_DPA_MASK) >> DMA_DCHPRI20_DPA_SHIFT)
#define DMA_BRD_DCHPRI20_DPA(base) (BME_UBFX8(&DMA_DCHPRI20_REG(base), DMA_DCHPRI20_DPA_SHIFT, DMA_DCHPRI20_DPA_WIDTH))

/*! @brief Set the DPA field to a new value. */
#define DMA_WR_DCHPRI20_DPA(base, value) (DMA_RMW_DCHPRI20(base, DMA_DCHPRI20_DPA_MASK, DMA_DCHPRI20_DPA(value)))
#define DMA_BWR_DCHPRI20_DPA(base, value) (BME_BFI8(&DMA_DCHPRI20_REG(base), ((uint8_t)(value) << DMA_DCHPRI20_DPA_SHIFT), DMA_DCHPRI20_DPA_SHIFT, DMA_DCHPRI20_DPA_WIDTH))
/*@}*/

/*!
 * @name Register DMA_DCHPRI20, field ECP[7] (RW)
 *
 * Values:
 * - 0b0 - Channel n cannot be suspended by a higher priority channel's service
 *     request.
 * - 0b1 - Channel n can be temporarily suspended by the service request of a
 *     higher priority channel.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI20_ECP field. */
#define DMA_RD_DCHPRI20_ECP(base) ((DMA_DCHPRI20_REG(base) & DMA_DCHPRI20_ECP_MASK) >> DMA_DCHPRI20_ECP_SHIFT)
#define DMA_BRD_DCHPRI20_ECP(base) (BME_UBFX8(&DMA_DCHPRI20_REG(base), DMA_DCHPRI20_ECP_SHIFT, DMA_DCHPRI20_ECP_WIDTH))

/*! @brief Set the ECP field to a new value. */
#define DMA_WR_DCHPRI20_ECP(base, value) (DMA_RMW_DCHPRI20(base, DMA_DCHPRI20_ECP_MASK, DMA_DCHPRI20_ECP(value)))
#define DMA_BWR_DCHPRI20_ECP(base, value) (BME_BFI8(&DMA_DCHPRI20_REG(base), ((uint8_t)(value) << DMA_DCHPRI20_ECP_SHIFT), DMA_DCHPRI20_ECP_SHIFT, DMA_DCHPRI20_ECP_WIDTH))
/*@}*/

