RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*! @brief Set the TRIG field to a new value. */
#define DMAMUX_WR_CHCFG_TRIG(base, index, value) (DMAMUX_RMW_CHCFG(base, index, DMAMUX_CHCFG_TRIG_MASK, DMAMUX_CHCFG_TRIG(value)))
#define DMAMUX_BWR_CHCFG_TRIG(base, index, value) (BME_BFI8(&DMAMUX_CHCFG_REG(base, index), ((uint8_t)(value) << DMAMUX_CHCFG_TRIG_SHIFT), DMAMUX_CHCFG_TRIG_SHIFT, DMAMUX_CHCFG_TRIG_WIDTH))
/*@}*/

/*!
 * @name Register DMAMUX_CHCFG, field ENBL[7] (RW)
 *
 * Enables the DMA channel.
 *
 * Values:
 * - 0b0 - DMA channel is disabled. This mode is primarily used during
 *     configuration of the DMAMux. The DMA has separate channel enables/disables, which
 *     should be used to disable or reconfigure a DMA channel.
 * - 0b1 - DMA channel is enabled
 */
/*@{*/
/*! @brief Read current value of the DMAMUX_CHCFG_ENBL field. */
#define DMAMUX_RD_CHCFG_ENBL(base, index) ((DMAMUX_CHCFG_REG(base, index) & DMAMUX_CHCFG_ENBL_MASK) >> DMAMUX_CHCFG_ENBL_SHIFT)
#define DMAMUX_BRD_CHCFG_ENBL(base, index) (BME_UBFX8(&DMAMUX_CHCFG_REG(base, index), DMAMUX_CHCFG_ENBL_SHIFT, DMAMUX_CHCFG_ENBL_WIDTH))

/*! @brief Set the ENBL field to a new value. */
#define DMAMUX_WR_CHCFG_ENBL(base, index, value) (DMAMUX_RMW_CHCFG(base, index, DMAMUX_CHCFG_ENBL_MASK, DMAMUX_CHCFG_ENBL(value)))
#define DMAMUX_BWR_CHCFG_ENBL(base, index, value) (BME_BFI8(&DMAMUX_CHCFG_REG(base, index), ((uint8_t)(value) << DMAMUX_CHCFG_ENBL_SHIFT), DMAMUX_CHCFG_ENBL_SHIFT, DMAMUX_CHCFG_ENBL_WIDTH))
/*@}*/

/*
 * MK80F25615 EMVSIM
 *
 * EMVSIM
 *
 * Registers defined in this header file:
 * - EMVSIM_VER_ID - Version ID Register
 * - EMVSIM_PARAM - Parameter Register
 * - EMVSIM_CLKCFG - Clock Configuration Register
 * - EMVSIM_DIVISOR - Baud Rate Divisor Register
 * - EMVSIM_CTRL - Control Register
 * - EMVSIM_INT_MASK - Interrupt Mask Register
 * - EMVSIM_RX_THD - Receiver Threshold Register
 * - EMVSIM_TX_THD - Transmitter Threshold Register
 * - EMVSIM_RX_STATUS - Receive Status Register
 * - EMVSIM_TX_STATUS - Transmitter Status Register
 * - EMVSIM_PCSR - Port Control and Status Register
 * - EMVSIM_RX_BUF - Receive Data Read Buffer
 * - EMVSIM_TX_BUF - Transmit Data Buffer
 * - EMVSIM_TX_GETU - Transmitter Guard ETU Value Register
 * - EMVSIM_CWT_VAL - Character Wait Time Value Register
 * - EMVSIM_BWT_VAL - Block Wait Time Value Register
 * - EMVSIM_BGT_VAL - Block Guard Time Value Register
 * - EMVSIM_GPCNT0_VAL - General Purpose Counter 0 Timeout Value Register
 * - EMVSIM_GPCNT1_VAL - General Purpose Counter 1 Timeout Value
 */

#define EMVSIM_INSTANCE_COUNT (2U) /*!< Number of instances of the EMVSIM module. */
#define EMVSIM0_IDX (0U) /*!< Instance number for EMVSIM0. */
#define EMVSIM1_IDX (1U) /*!< Instance number for EMVSIM1. */

/*******************************************************************************
 * EMVSIM_VER_ID - Version ID Register
 ******************************************************************************/

/*!
 * @brief EMVSIM_VER_ID - Version ID Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * Version ID for the IP. It corresponds to the version of IP being used.
 */
/*!
 * @name Constants and macros for entire EMVSIM_VER_ID register
 */
/*@{*/
#define EMVSIM_RD_VER_ID(base)   (EMVSIM_VER_ID_REG(base))
/*@}*/

/*******************************************************************************
 * EMVSIM_PARAM - Parameter Register
 ******************************************************************************/

/*!
 * @brief EMVSIM_PARAM - Parameter Register (RO)
 *
 * Reset value: 0x00001010U
 *
 * This register provides details on the parameter settings that were used while
 * including this module in the chip.
 */
/*!
 * @name Constants and macros for entire EMVSIM_PARAM register
 */
/*@{*/
#define EMVSIM_RD_PARAM(base)    (EMVSIM_PARAM_REG(base))
/*@}*/

/*
 * Constants & macros for individual EMVSIM_PARAM bitfields
 */

/*!
 * @name Register EMVSIM_PARAM, field RX_FIFO_DEPTH[7:0] (RO)
 *
 * Value of parameter for Receive FIFO Depth (in Bytes)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_PARAM_RX_FIFO_DEPTH field. */
#define EMVSIM_RD_PARAM_RX_FIFO_DEPTH(base) ((EMVSIM_PARAM_REG(base) & EMVSIM_PARAM_RX_FIFO_DEPTH_MASK) >> EMVSIM_PARAM_RX_FIFO_DEPTH_SHIFT)
#define EMVSIM_BRD_PARAM_RX_FIFO_DEPTH(base) (BME_UBFX32(&EMVSIM_PARAM_REG(base), EMVSIM_PARAM_RX_FIFO_DEPTH_SHIFT, EMVSIM_PARAM_RX_FIFO_DEPTH_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_PARAM, field TX_FIFO_DEPTH[15:8] (RO)
 *
 * Value of parameter for Transmit FIFO Depth (in Bytes)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_PARAM_TX_FIFO_DEPTH field. */
#define EMVSIM_RD_PARAM_TX_FIFO_DEPTH(base) ((EMVSIM_PARAM_REG(base) & EMVSIM_PARAM_TX_FIFO_DEPTH_MASK) >> EMVSIM_PARAM_TX_FIFO_DEPTH_SHIFT)
#define EMVSIM_BRD_PARAM_TX_FIFO_DEPTH(base) (BME_UBFX32(&EMVSIM_PARAM_REG(base), EMVSIM_PARAM_TX_FIFO_DEPTH_SHIFT, EMVSIM_PARAM_TX_FIFO_DEPTH_WIDTH))
/*@}*/

/*******************************************************************************
 * EMVSIM_CLKCFG - Clock Configuration Register
 ******************************************************************************/

/*!
 * @brief EMVSIM_CLKCFG - Clock Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register provides configuration details to enable the right clock
 * frequency of clocks used by EMV SIM module.
 */
/*!
 * @name Constants and macros for entire EMVSIM_CLKCFG register
 */
/*@{*/
#define EMVSIM_RD_CLKCFG(base)   (EMVSIM_CLKCFG_REG(base))
#define EMVSIM_WR_CLKCFG(base, value) (EMVSIM_CLKCFG_REG(base) = (value))
#define EMVSIM_RMW_CLKCFG(base, mask, value) (EMVSIM_WR_CLKCFG(base, (EMVSIM_RD_CLKCFG(base) & ~(mask)) | (value)))
#define EMVSIM_SET_CLKCFG(base, value) (BME_OR32(&EMVSIM_CLKCFG_REG(base), (uint32_t)(value)))
#define EMVSIM_CLR_CLKCFG(base, value) (BME_AND32(&EMVSIM_CLKCFG_REG(base), (uint32_t)(~(value))))
#define EMVSIM_TOG_CLKCFG(base, value) (BME_XOR32(&EMVSIM_CLKCFG_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual EMVSIM_CLKCFG bitfields
 */

/*!
 * @name Register EMVSIM_CLKCFG, field CLK_PRSC[7:0] (RW)
 *
 * The value written to this register will determine the desired card clock
 * frequency. The Card Clock frequency is the EMV SIM Protocol (or logic) clock
 * divided by this prescaler value. The prescaler value should be updated only when
 * card clock is disabled and transmitter and receiver are not operational.
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CLKCFG_CLK_PRSC field. */
#define EMVSIM_RD_CLKCFG_CLK_PRSC(base) ((EMVSIM_CLKCFG_REG(base) & EMVSIM_CLKCFG_CLK_PRSC_MASK) >> EMVSIM_CLKCFG_CLK_PRSC_SHIFT)
#define EMVSIM_BRD_CLKCFG_CLK_PRSC(base) (BME_UBFX32(&EMVSIM_CLKCFG_REG(base), EMVSIM_CLKCFG_CLK_PRSC_SHIFT, EMVSIM_CLKCFG_CLK_PRSC_WIDTH))

/*! @brief Set the CLK_PRSC field to a new value. */
#define EMVSIM_WR_CLKCFG_CLK_PRSC(base, value) (EMVSIM_RMW_CLKCFG(base, EMVSIM_CLKCFG_CLK_PRSC_MASK, EMVSIM_CLKCFG_CLK_PRSC(value)))
#define EMVSIM_BWR_CLKCFG_CLK_PRSC(base, value) (BME_BFI32(&EMVSIM_CLKCFG_REG(base), ((uint32_t)(value) << EMVSIM_CLKCFG_CLK_PRSC_SHIFT), EMVSIM_CLKCFG_CLK_PRSC_SHIFT, EMVSIM_CLKCFG_CLK_PRSC_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CLKCFG, field GPCNT1_CLK_SEL[9:8] (RW)
 *
 * Selects which clock source is used by EMV SIM Module general purpose counter
 * 1. The only way to reset the counter is to set these bits to zero. The counter
 * will begin counting as soon as the clock input is selected and the clocks are
 * active. These input clocks are enabled through other register bits of the EMV
 * SIM module (KILL_CLOCK, RCV_EN, and XMT_EN). Counter is active while RCV_EN
 * or XMT_EN are set.
 *
 * Values:
 * - 0b00 - Disabled / Reset (default)
 * - 0b01 - Card Clock
 * - 0b10 - Receive Clock
 * - 0b11 - ETU Clock (transmit clock)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CLKCFG_GPCNT1_CLK_SEL field. */
#define EMVSIM_RD_CLKCFG_GPCNT1_CLK_SEL(base) ((EMVSIM_CLKCFG_REG(base) & EMVSIM_CLKCFG_GPCNT1_CLK_SEL_MASK) >> EMVSIM_CLKCFG_GPCNT1_CLK_SEL_SHIFT)
#define EMVSIM_BRD_CLKCFG_GPCNT1_CLK_SEL(base) (BME_UBFX32(&EMVSIM_CLKCFG_REG(base), EMVSIM_CLKCFG_GPCNT1_CLK_SEL_SHIFT, EMVSIM_CLKCFG_GPCNT1_CLK_SEL_WIDTH))

/*! @brief Set the GPCNT1_CLK_SEL field to a new value. */
#define EMVSIM_WR_CLKCFG_GPCNT1_CLK_SEL(base, value) (EMVSIM_RMW_CLKCFG(base, EMVSIM_CLKCFG_GPCNT1_CLK_SEL_MASK, EMVSIM_CLKCFG_GPCNT1_CLK_SEL(value)))
#define EMVSIM_BWR_CLKCFG_GPCNT1_CLK_SEL(base, value) (BME_BFI32(&EMVSIM_CLKCFG_REG(base), ((uint32_t)(value) << EMVSIM_CLKCFG_GPCNT1_CLK_SEL_SHIFT), EMVSIM_CLKCFG_GPCNT1_CLK_SEL_SHIFT, EMVSIM_CLKCFG_GPCNT1_CLK_SEL_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CLKCFG, field GPCNT0_CLK_SEL[11:10] (RW)
 *
 * Selects which clock source is used by EMV SIM Module general purpose counter
 * 0. The only way to reset the counter is to set these bits to zero. The counter
 * will begin counting as soon as the clock input is selected and the clocks are
 * active. These input clocks are enabled through other register bits of the EMV
 * SIM module (KILL_CLOCK, RCV_EN, and XMT_EN). Counter is active while RCV_EN
 * or XMT_EN are set.
 *
 * Values:
 * - 0b00 - Disabled / Reset (default)
 * - 0b01 - Card Clock
 * - 0b10 - Receive Clock
 * - 0b11 - ETU Clock (transmit clock)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CLKCFG_GPCNT0_CLK_SEL field. */
#define EMVSIM_RD_CLKCFG_GPCNT0_CLK_SEL(base) ((EMVSIM_CLKCFG_REG(base) & EMVSIM_CLKCFG_GPCNT0_CLK_SEL_MASK) >> EMVSIM_CLKCFG_GPCNT0_CLK_SEL_SHIFT)
#define EMVSIM_BRD_CLKCFG_GPCNT0_CLK_SEL(base) (BME_UBFX32(&EMVSIM_CLKCFG_REG(base), EMVSIM_CLKCFG_GPCNT0_CLK_SEL_SHIFT, EMVSIM_CLKCFG_GPCNT0_CLK_SEL_WIDTH))

/*! @brief Set the GPCNT0_CLK_SEL field to a new value. */
#define EMVSIM_WR_CLKCFG_GPCNT0_CLK_SEL(base, value) (EMVSIM_RMW_CLKCFG(base, EMVSIM_CLKCFG_GPCNT0_CLK_SEL_MASK, EMVSIM_CLKCFG_GPCNT0_CLK_SEL(value)))
#define EMVSIM_BWR_CLKCFG_GPCNT0_CLK_SEL(base, value) (BME_BFI32(&EMVSIM_CLKCFG_REG(base), ((uint32_t)(value) << EMVSIM_CLKCFG_GPCNT0_CLK_SEL_SHIFT), EMVSIM_CLKCFG_GPCNT0_CLK_SEL_SHIFT, EMVSIM_CLKCFG_GPCNT0_CLK_SEL_WIDTH))
/*@}*/

