RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*******************************************************************************
 * EMVSIM_DIVISOR - Baud Rate Divisor Register
 ******************************************************************************/

/*!
 * @brief EMVSIM_DIVISOR - Baud Rate Divisor Register (RW)
 *
 * Reset value: 0x00000174U
 *
 * This regiter configures the divisor value to generate the baud clock which
 * will drive the card clock and also generate the transmit and receive clocks and
 * respective ETUs.
 */
/*!
 * @name Constants and macros for entire EMVSIM_DIVISOR register
 */
/*@{*/
#define EMVSIM_RD_DIVISOR(base)  (EMVSIM_DIVISOR_REG(base))
#define EMVSIM_WR_DIVISOR(base, value) (EMVSIM_DIVISOR_REG(base) = (value))
#define EMVSIM_RMW_DIVISOR(base, mask, value) (EMVSIM_WR_DIVISOR(base, (EMVSIM_RD_DIVISOR(base) & ~(mask)) | (value)))
#define EMVSIM_SET_DIVISOR(base, value) (BME_OR32(&EMVSIM_DIVISOR_REG(base), (uint32_t)(value)))
#define EMVSIM_CLR_DIVISOR(base, value) (BME_AND32(&EMVSIM_DIVISOR_REG(base), (uint32_t)(~(value))))
#define EMVSIM_TOG_DIVISOR(base, value) (BME_XOR32(&EMVSIM_DIVISOR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual EMVSIM_DIVISOR bitfields
 */

/*!
 * @name Register EMVSIM_DIVISOR, field DIVISOR_VALUE[8:0] (RW)
 *
 * The value written to this register will be used to generate the ETU bit
 * period that will be used by the transmitter and receiver. The divisor value is the
 * integer result of F/D value; where F and D are the clock rate conversion
 * integer and baud rate adjustment integer, respectively, that required for the
 * desired operation. The value in this register can be changed when no transaction is
 * active with the smart card. When programming this field, the fractional part
 * of F/D should be rounded off the nearest integer.
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_DIVISOR_DIVISOR_VALUE field. */
#define EMVSIM_RD_DIVISOR_DIVISOR_VALUE(base) ((EMVSIM_DIVISOR_REG(base) & EMVSIM_DIVISOR_DIVISOR_VALUE_MASK) >> EMVSIM_DIVISOR_DIVISOR_VALUE_SHIFT)
#define EMVSIM_BRD_DIVISOR_DIVISOR_VALUE(base) (EMVSIM_RD_DIVISOR_DIVISOR_VALUE(base))

/*! @brief Set the DIVISOR_VALUE field to a new value. */
#define EMVSIM_WR_DIVISOR_DIVISOR_VALUE(base, value) (EMVSIM_RMW_DIVISOR(base, EMVSIM_DIVISOR_DIVISOR_VALUE_MASK, EMVSIM_DIVISOR_DIVISOR_VALUE(value)))
#define EMVSIM_BWR_DIVISOR_DIVISOR_VALUE(base, value) (EMVSIM_WR_DIVISOR_DIVISOR_VALUE(base, value))
/*@}*/

/*******************************************************************************
 * EMVSIM_CTRL - Control Register
 ******************************************************************************/

/*!
 * @brief EMVSIM_CTRL - Control Register (RW)
 *
 * Reset value: 0x01000006U
 */
/*!
 * @name Constants and macros for entire EMVSIM_CTRL register
 */
/*@{*/
#define EMVSIM_RD_CTRL(base)     (EMVSIM_CTRL_REG(base))
#define EMVSIM_WR_CTRL(base, value) (EMVSIM_CTRL_REG(base) = (value))
#define EMVSIM_RMW_CTRL(base, mask, value) (EMVSIM_WR_CTRL(base, (EMVSIM_RD_CTRL(base) & ~(mask)) | (value)))
#define EMVSIM_SET_CTRL(base, value) (BME_OR32(&EMVSIM_CTRL_REG(base), (uint32_t)(value)))
#define EMVSIM_CLR_CTRL(base, value) (BME_AND32(&EMVSIM_CTRL_REG(base), (uint32_t)(~(value))))
#define EMVSIM_TOG_CTRL(base, value) (BME_XOR32(&EMVSIM_CTRL_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual EMVSIM_CTRL bitfields
 */

/*!
 * @name Register EMVSIM_CTRL, field IC[0] (RW)
 *
 * Used to configure the EMV SIM to use either inverse convention or direct
 * convention for its data format. The IC bit can be controlled by software, but it
 * is normally set by hardware as a result of the interpretation of the initial
 * character when in ICM mode.
 *
 * Values:
 * - 0b0 - Direction convention transfers enabled (default)
 * - 0b1 - Inverse convention transfers enabled
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_IC field. */
#define EMVSIM_RD_CTRL_IC(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_IC_MASK) >> EMVSIM_CTRL_IC_SHIFT)
#define EMVSIM_BRD_CTRL_IC(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_IC_SHIFT, EMVSIM_CTRL_IC_WIDTH))

/*! @brief Set the IC field to a new value. */
#define EMVSIM_WR_CTRL_IC(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_IC_MASK, EMVSIM_CTRL_IC(value)))
#define EMVSIM_BWR_CTRL_IC(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_IC_SHIFT), EMVSIM_CTRL_IC_SHIFT, EMVSIM_CTRL_IC_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field ICM[1] (RW)
 *
 * Enables initial character mode. Will be automatically cleared by hardware
 * once a valid initial character is received.
 *
 * Values:
 * - 0b0 - Initial Character Mode disabled
 * - 0b1 - Initial Character Mode enabled (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_ICM field. */
#define EMVSIM_RD_CTRL_ICM(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_ICM_MASK) >> EMVSIM_CTRL_ICM_SHIFT)
#define EMVSIM_BRD_CTRL_ICM(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_ICM_SHIFT, EMVSIM_CTRL_ICM_WIDTH))

/*! @brief Set the ICM field to a new value. */
#define EMVSIM_WR_CTRL_ICM(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_ICM_MASK, EMVSIM_CTRL_ICM(value)))
#define EMVSIM_BWR_CTRL_ICM(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_ICM_SHIFT), EMVSIM_CTRL_ICM_SHIFT, EMVSIM_CTRL_ICM_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field ANACK[2] (RW)
 *
 * Enables NACK generation for parity errors in receieved messages or when
 * invalid initial characters are received in ICM mode.
 *
 * Values:
 * - 0b0 - NACK generation on errors disabled
 * - 0b1 - NACK generation on errors enabled (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_ANACK field. */
#define EMVSIM_RD_CTRL_ANACK(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_ANACK_MASK) >> EMVSIM_CTRL_ANACK_SHIFT)
#define EMVSIM_BRD_CTRL_ANACK(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_ANACK_SHIFT, EMVSIM_CTRL_ANACK_WIDTH))

/*! @brief Set the ANACK field to a new value. */
#define EMVSIM_WR_CTRL_ANACK(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_ANACK_MASK, EMVSIM_CTRL_ANACK(value)))
#define EMVSIM_BWR_CTRL_ANACK(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_ANACK_SHIFT), EMVSIM_CTRL_ANACK_SHIFT, EMVSIM_CTRL_ANACK_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field ONACK[3] (RW)
 *
 * Enables NACK generation when Rx FIFO is full and another message is ready for
 * writing into the FIFO.
 *
 * Values:
 * - 0b0 - NACK generation on overrun is disabled (default)
 * - 0b1 - NACK generation on overrun is enabled
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_ONACK field. */
#define EMVSIM_RD_CTRL_ONACK(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_ONACK_MASK) >> EMVSIM_CTRL_ONACK_SHIFT)
#define EMVSIM_BRD_CTRL_ONACK(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_ONACK_SHIFT, EMVSIM_CTRL_ONACK_WIDTH))

/*! @brief Set the ONACK field to a new value. */
#define EMVSIM_WR_CTRL_ONACK(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_ONACK_MASK, EMVSIM_CTRL_ONACK(value)))
#define EMVSIM_BWR_CTRL_ONACK(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_ONACK_SHIFT), EMVSIM_CTRL_ONACK_SHIFT, EMVSIM_CTRL_ONACK_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field FLSH_RX[8] (WORZ)
 *
 * This bit operates as an EMV SIM receiver reset. The transmit portion of the
 * EMV SIM module is not affected. This bits clears automatically and always reads
 * 0.
 *
 * Values:
 * - 0b0 - EMV SIM Receiver normal operation (default)
 * - 0b1 - EMV SIM Receiver held in Reset
 */
/*@{*/
/*! @brief Set the FLSH_RX field to a new value. */
#define EMVSIM_WR_CTRL_FLSH_RX(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_FLSH_RX_MASK, EMVSIM_CTRL_FLSH_RX(value)))
#define EMVSIM_BWR_CTRL_FLSH_RX(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_FLSH_RX_SHIFT), EMVSIM_CTRL_FLSH_RX_SHIFT, EMVSIM_CTRL_FLSH_RX_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field FLSH_TX[9] (WORZ)
 *
 * This bit operates as an EMV SIM transmitter reset. The receive portion of the
 * EMV SIM module is not affected. This bit clears automatically and always
 * reads 0.
 *
 * Values:
 * - 0b0 - EMV SIM Transmitter normal operation (default)
 * - 0b1 - EMV SIM Transmitter held in Reset
 */
/*@{*/
/*! @brief Set the FLSH_TX field to a new value. */
#define EMVSIM_WR_CTRL_FLSH_TX(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_FLSH_TX_MASK, EMVSIM_CTRL_FLSH_TX(value)))
#define EMVSIM_BWR_CTRL_FLSH_TX(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_FLSH_TX_SHIFT), EMVSIM_CTRL_FLSH_TX_SHIFT, EMVSIM_CTRL_FLSH_TX_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field SW_RST[10] (WORZ)
 *
 * Used to reset the entire EMV SIM module. This acts the same as a hardware
 * reset for the EMV SIM module. This bit is self-clearing and always reads 0. Note:
 * Software should allow a minimum of 4 Protocol clock cycles before attempting
 * to access the EMV SIM module after a software reset.
 *
 * Values:
 * - 0b0 - EMV SIM Normal operation (default)
 * - 0b1 - EMV SIM held in Reset
 */
/*@{*/
/*! @brief Set the SW_RST field to a new value. */
#define EMVSIM_WR_CTRL_SW_RST(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_SW_RST_MASK, EMVSIM_CTRL_SW_RST(value)))
#define EMVSIM_BWR_CTRL_SW_RST(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_SW_RST_SHIFT), EMVSIM_CTRL_SW_RST_SHIFT, EMVSIM_CTRL_SW_RST_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field KILL_CLOCKS[11] (RW)
 *
 * Used to enable/disable the clock input to the EMV SIM module. This bit will
 * gate all clocks including the Smart Card clock regardless of the state of the
 * STOP bit described above. Note: This bit will have no effect on the register
 * read write clock. Only EMV SIM logic clock is gated.
 *
 * Values:
 * - 0b0 - EMV SIM input clock enabled (default)
 * - 0b1 - EMV SIM input clock is disabled
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_KILL_CLOCKS field. */
#define EMVSIM_RD_CTRL_KILL_CLOCKS(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_KILL_CLOCKS_MASK) >> EMVSIM_CTRL_KILL_CLOCKS_SHIFT)
#define EMVSIM_BRD_CTRL_KILL_CLOCKS(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_KILL_CLOCKS_SHIFT, EMVSIM_CTRL_KILL_CLOCKS_WIDTH))

/*! @brief Set the KILL_CLOCKS field to a new value. */
#define EMVSIM_WR_CTRL_KILL_CLOCKS(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_KILL_CLOCKS_MASK, EMVSIM_CTRL_KILL_CLOCKS(value)))
#define EMVSIM_BWR_CTRL_KILL_CLOCKS(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_KILL_CLOCKS_SHIFT), EMVSIM_CTRL_KILL_CLOCKS_SHIFT, EMVSIM_CTRL_KILL_CLOCKS_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field DOZE_EN[12] (RW)
 *
 * Used to configure the operation of the EMV SIM module when a processor DOZE
 * instruction is executed.
 *
 * Values:
 * - 0b0 - DOZE instruction will gate all internal EMV SIM clocks as well as the
 *     Smart Card clock when the transmit FIFO is empty (default)
 * - 0b1 - DOZE instruction has no effect on EMV SIM module
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_DOZE_EN field. */
#define EMVSIM_RD_CTRL_DOZE_EN(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_DOZE_EN_MASK) >> EMVSIM_CTRL_DOZE_EN_SHIFT)
#define EMVSIM_BRD_CTRL_DOZE_EN(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_DOZE_EN_SHIFT, EMVSIM_CTRL_DOZE_EN_WIDTH))

/*! @brief Set the DOZE_EN field to a new value. */
#define EMVSIM_WR_CTRL_DOZE_EN(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_DOZE_EN_MASK, EMVSIM_CTRL_DOZE_EN(value)))
#define EMVSIM_BWR_CTRL_DOZE_EN(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_DOZE_EN_SHIFT), EMVSIM_CTRL_DOZE_EN_SHIFT, EMVSIM_CTRL_DOZE_EN_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field STOP_EN[13] (RW)
 *
 * Used to configure the operation of the EMV SIM module when a processor STOP
 * instruction is executed. This bit is added to provide support for Smart Cards
 * that do not allow the Smart Card clock to be stopped while power is applied.
 * Note: To enable Card Clock in STOP mode, both STOP_EN and DOZE_EN should be set
 * to 1.
 *
 * Values:
 * - 0b0 - STOP instruction shuts down all EMV SIM clocks (default)
 * - 0b1 - STOP instruction shuts down all clocks except for the Smart Card
 *     Clock (SCK) (clock provided to Smart Card)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_STOP_EN field. */
#define EMVSIM_RD_CTRL_STOP_EN(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_STOP_EN_MASK) >> EMVSIM_CTRL_STOP_EN_SHIFT)
#define EMVSIM_BRD_CTRL_STOP_EN(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_STOP_EN_SHIFT, EMVSIM_CTRL_STOP_EN_WIDTH))

/*! @brief Set the STOP_EN field to a new value. */
#define EMVSIM_WR_CTRL_STOP_EN(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_STOP_EN_MASK, EMVSIM_CTRL_STOP_EN(value)))
#define EMVSIM_BWR_CTRL_STOP_EN(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_STOP_EN_SHIFT), EMVSIM_CTRL_STOP_EN_SHIFT, EMVSIM_CTRL_STOP_EN_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field RCV_EN[16] (RW)
 *
 * Used to enable/disable the EMV SIM receiver block. Once the transmitter has
 * completed its operation, the software must enable the receiver using this bit.
 * It can be set to 0 during the auto power down sequence.
 *
 * Values:
 * - 0b0 - EMV SIM Receiver disabled (default)
 * - 0b1 - EMV SIM Receiver enabled
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_RCV_EN field. */
#define EMVSIM_RD_CTRL_RCV_EN(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_RCV_EN_MASK) >> EMVSIM_CTRL_RCV_EN_SHIFT)
#define EMVSIM_BRD_CTRL_RCV_EN(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_RCV_EN_SHIFT, EMVSIM_CTRL_RCV_EN_WIDTH))

