RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*
 * Constants & macros for individual EMVSIM_RX_STATUS bitfields
 */

/*!
 * @name Register EMVSIM_RX_STATUS, field RFO[0] (W1C)
 *
 * Used to indicate that the EMV SIM was unable to store received data due to
 * already unread bytes in the FIFO (FIFO full or almost full). It does not
 * necessarily indicate that data has been lost. If the ONACK control bit in the CNTL
 * register is set, there will be a NACK pulse generated on bytes that would
 * otherwise cause a loss of data due to a full FIFO. These bytes should be
 * retransmitted by the Smart Card which implies that no data has actually been lost. In
 * this case, the RFO flag is just an indicator that this situation has occurred
 * which may be helpful in system debug. For the case where ONACK is not set, a set
 * RFO flag does indicate a loss of data since all bytes received with the OEF
 * flag set will indeed be lost (including the byte that caused the bit to be set).
 * The RFO flag will cause an interrupt if the RFO_IM bit in the INT_MASK
 * register. The RFO flag is a write-one-to-clear bit.
 *
 * Values:
 * - 0b0 - No overrun error has occurred (default)
 * - 0b1 - A byte was received when the received FIFO was already full
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_RX_STATUS_RFO field. */
#define EMVSIM_RD_RX_STATUS_RFO(base) ((EMVSIM_RX_STATUS_REG(base) & EMVSIM_RX_STATUS_RFO_MASK) >> EMVSIM_RX_STATUS_RFO_SHIFT)
#define EMVSIM_BRD_RX_STATUS_RFO(base) (BME_UBFX32(&EMVSIM_RX_STATUS_REG(base), EMVSIM_RX_STATUS_RFO_SHIFT, EMVSIM_RX_STATUS_RFO_WIDTH))

/*! @brief Set the RFO field to a new value. */
#define EMVSIM_WR_RX_STATUS_RFO(base, value) (EMVSIM_RMW_RX_STATUS(base, (EMVSIM_RX_STATUS_RFO_MASK | EMVSIM_RX_STATUS_RX_DATA_MASK | EMVSIM_RX_STATUS_CWT_ERR_MASK | EMVSIM_RX_STATUS_RTE_MASK | EMVSIM_RX_STATUS_BWT_ERR_MASK | EMVSIM_RX_STATUS_BGT_ERR_MASK | EMVSIM_RX_STATUS_PEF_MASK | EMVSIM_RX_STATUS_FEF_MASK), EMVSIM_RX_STATUS_RFO(value)))
#define EMVSIM_BWR_RX_STATUS_RFO(base, value) (BME_BFI32(&EMVSIM_RX_STATUS_REG(base), ((uint32_t)(value) << EMVSIM_RX_STATUS_RFO_SHIFT), EMVSIM_RX_STATUS_RFO_SHIFT, EMVSIM_RX_STATUS_RFO_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_RX_STATUS, field RX_DATA[4] (W1C)
 *
 * Interrupt asserted when a new data byte is received and entered into the
 * Receive FIFO.
 *
 * Values:
 * - 0b0 - No new byte is received
 * - 0b1 - New byte is received ans stored in Receive FIFO
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_RX_STATUS_RX_DATA field. */
#define EMVSIM_RD_RX_STATUS_RX_DATA(base) ((EMVSIM_RX_STATUS_REG(base) & EMVSIM_RX_STATUS_RX_DATA_MASK) >> EMVSIM_RX_STATUS_RX_DATA_SHIFT)
#define EMVSIM_BRD_RX_STATUS_RX_DATA(base) (BME_UBFX32(&EMVSIM_RX_STATUS_REG(base), EMVSIM_RX_STATUS_RX_DATA_SHIFT, EMVSIM_RX_STATUS_RX_DATA_WIDTH))

/*! @brief Set the RX_DATA field to a new value. */
#define EMVSIM_WR_RX_STATUS_RX_DATA(base, value) (EMVSIM_RMW_RX_STATUS(base, (EMVSIM_RX_STATUS_RX_DATA_MASK | EMVSIM_RX_STATUS_RFO_MASK | EMVSIM_RX_STATUS_CWT_ERR_MASK | EMVSIM_RX_STATUS_RTE_MASK | EMVSIM_RX_STATUS_BWT_ERR_MASK | EMVSIM_RX_STATUS_BGT_ERR_MASK | EMVSIM_RX_STATUS_PEF_MASK | EMVSIM_RX_STATUS_FEF_MASK), EMVSIM_RX_STATUS_RX_DATA(value)))
#define EMVSIM_BWR_RX_STATUS_RX_DATA(base, value) (BME_BFI32(&EMVSIM_RX_STATUS_REG(base), ((uint32_t)(value) << EMVSIM_RX_STATUS_RX_DATA_SHIFT), EMVSIM_RX_STATUS_RX_DATA_SHIFT, EMVSIM_RX_STATUS_RX_DATA_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_RX_STATUS, field RDTF[5] (RO)
 *
 * Interrupt flag asserted when total bytes in the Receive FIFO equal or is
 * greater than the programmed receive threshold RDT[3:0]. The RDTF flag will be set
 * any time the number of unread bytes in the receive FIFO is equal to or greater
 * than the value set by RDT[3:0]. The flag can be cleared by reading enough
 * bytes out of the receive FIFO so as to bring the number of bytes left in the FIFO
 * below the RDT[3:0] level. Another way to clear the flag is to set the
 * RDT[3:0] level higher than the number of unread bytes currently in the FIFO. The RDTF
 * flag will create an interrupt if the RDT_IM bit in the INT_MASK register is
 * cleared.
 *
 * Values:
 * - 0b0 - Number of unread bytes in receive FIFO less than the value set by
 *     RDT[3:0] (default).
 * - 0b1 - Number of unread bytes in receive FIFO greater or than equal to value
 *     set by RDT[3:0].
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_RX_STATUS_RDTF field. */
#define EMVSIM_RD_RX_STATUS_RDTF(base) ((EMVSIM_RX_STATUS_REG(base) & EMVSIM_RX_STATUS_RDTF_MASK) >> EMVSIM_RX_STATUS_RDTF_SHIFT)
#define EMVSIM_BRD_RX_STATUS_RDTF(base) (BME_UBFX32(&EMVSIM_RX_STATUS_REG(base), EMVSIM_RX_STATUS_RDTF_SHIFT, EMVSIM_RX_STATUS_RDTF_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_RX_STATUS, field LRC_OK[6] (RO)
 *
 * Used to indicate when the calculated 8-bit LRC value is correct for the
 * current input data stream. The value is calculated across all received characters
 * from the point the LRC_EN bit is set in the CTRL register. The current LRC
 * residual can be reset by three mechanisms: Clear LRC_EN bit in CTRL register Set
 * XMT_EN bit in ENABLE register Automatically by hardware when ETC flag is set at
 * the end of a transmission.
 *
 * Values:
 * - 0b0 - Current LRC value does not match remainder.
 * - 0b1 - Current calculated LRC value matches the expected result (i.e. zero).
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_RX_STATUS_LRC_OK field. */
#define EMVSIM_RD_RX_STATUS_LRC_OK(base) ((EMVSIM_RX_STATUS_REG(base) & EMVSIM_RX_STATUS_LRC_OK_MASK) >> EMVSIM_RX_STATUS_LRC_OK_SHIFT)
#define EMVSIM_BRD_RX_STATUS_LRC_OK(base) (BME_UBFX32(&EMVSIM_RX_STATUS_REG(base), EMVSIM_RX_STATUS_LRC_OK_SHIFT, EMVSIM_RX_STATUS_LRC_OK_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_RX_STATUS, field CRC_OK[7] (RO)
 *
 * Used to indicate when the calculated 16-bit CRC value matches the expected
 * value for the current input data stream. The value is calculated across all
 * received characters from the point the CRC_EN bit is set in the CTRL register. The
 * current CRC residual can be reset by three mechanisms: Clear CRC_EN bit in
 * CTRL register Set XMT_EN bit in ENABLE register Automatically by hardware when
 * ETC flag is set at the end of a transmission.
 *
 * Values:
 * - 0b0 - Current CRC value does not match remainder.
 * - 0b1 - Current calculated CRC value matches the expected result.
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_RX_STATUS_CRC_OK field. */
#define EMVSIM_RD_RX_STATUS_CRC_OK(base) ((EMVSIM_RX_STATUS_REG(base) & EMVSIM_RX_STATUS_CRC_OK_MASK) >> EMVSIM_RX_STATUS_CRC_OK_SHIFT)
#define EMVSIM_BRD_RX_STATUS_CRC_OK(base) (BME_UBFX32(&EMVSIM_RX_STATUS_REG(base), EMVSIM_RX_STATUS_CRC_OK_SHIFT, EMVSIM_RX_STATUS_CRC_OK_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_RX_STATUS, field CWT_ERR[8] (W1C)
 *
 * Used to indicate when the time between received characters is equal to or
 * greater than the value programmed in the CHAR_WAIT register.
 *
 * Values:
 * - 0b0 - No CWT violation has occurred (default).
 * - 0b1 - Time between two consecutive characters has exceeded the value in
 *     CHAR_WAIT.
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_RX_STATUS_CWT_ERR field. */
#define EMVSIM_RD_RX_STATUS_CWT_ERR(base) ((EMVSIM_RX_STATUS_REG(base) & EMVSIM_RX_STATUS_CWT_ERR_MASK) >> EMVSIM_RX_STATUS_CWT_ERR_SHIFT)
#define EMVSIM_BRD_RX_STATUS_CWT_ERR(base) (BME_UBFX32(&EMVSIM_RX_STATUS_REG(base), EMVSIM_RX_STATUS_CWT_ERR_SHIFT, EMVSIM_RX_STATUS_CWT_ERR_WIDTH))

/*! @brief Set the CWT_ERR field to a new value. */
#define EMVSIM_WR_RX_STATUS_CWT_ERR(base, value) (EMVSIM_RMW_RX_STATUS(base, (EMVSIM_RX_STATUS_CWT_ERR_MASK | EMVSIM_RX_STATUS_RFO_MASK | EMVSIM_RX_STATUS_RX_DATA_MASK | EMVSIM_RX_STATUS_RTE_MASK | EMVSIM_RX_STATUS_BWT_ERR_MASK | EMVSIM_RX_STATUS_BGT_ERR_MASK | EMVSIM_RX_STATUS_PEF_MASK | EMVSIM_RX_STATUS_FEF_MASK), EMVSIM_RX_STATUS_CWT_ERR(value)))
#define EMVSIM_BWR_RX_STATUS_CWT_ERR(base, value) (BME_BFI32(&EMVSIM_RX_STATUS_REG(base), ((uint32_t)(value) << EMVSIM_RX_STATUS_CWT_ERR_SHIFT), EMVSIM_RX_STATUS_CWT_ERR_SHIFT, EMVSIM_RX_STATUS_CWT_ERR_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_RX_STATUS, field RTE[9] (W1C)
 *
 * Used to indicate whether the number of consecutive NACK's generated by the
 * EMV SIM module in response to receive parity errors, for the byte being
 * received, equals the value programmed in the RTH[3:0] in the RX_THRESHOLD register.
 * This bit will never set unless the ANACK bit is set in the CNTL register. The
 * SAPDx bit in the CNTL resister must be set to enable the threshold error to
 * trigger the auto power down sequence. RTE is a write once to clear bit. Clearing
 * this bit also resets the internal counter for consecutive NACK's being
 * transmitted for a given byte.
 *
 * Values:
 * - 0b0 - Number of NACKs generated by the receiver is less than the value
 *     programmed in RTH[3:0]
 * - 0b1 - Number of NACKs generated by the receiver is equal to the value
 *     programmed in RTH[3:0]
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_RX_STATUS_RTE field. */
#define EMVSIM_RD_RX_STATUS_RTE(base) ((EMVSIM_RX_STATUS_REG(base) & EMVSIM_RX_STATUS_RTE_MASK) >> EMVSIM_RX_STATUS_RTE_SHIFT)
#define EMVSIM_BRD_RX_STATUS_RTE(base) (BME_UBFX32(&EMVSIM_RX_STATUS_REG(base), EMVSIM_RX_STATUS_RTE_SHIFT, EMVSIM_RX_STATUS_RTE_WIDTH))

/*! @brief Set the RTE field to a new value. */
#define EMVSIM_WR_RX_STATUS_RTE(base, value) (EMVSIM_RMW_RX_STATUS(base, (EMVSIM_RX_STATUS_RTE_MASK | EMVSIM_RX_STATUS_RFO_MASK | EMVSIM_RX_STATUS_RX_DATA_MASK | EMVSIM_RX_STATUS_CWT_ERR_MASK | EMVSIM_RX_STATUS_BWT_ERR_MASK | EMVSIM_RX_STATUS_BGT_ERR_MASK | EMVSIM_RX_STATUS_PEF_MASK | EMVSIM_RX_STATUS_FEF_MASK), EMVSIM_RX_STATUS_RTE(value)))
#define EMVSIM_BWR_RX_STATUS_RTE(base, value) (BME_BFI32(&EMVSIM_RX_STATUS_REG(base), ((uint32_t)(value) << EMVSIM_RX_STATUS_RTE_SHIFT), EMVSIM_RX_STATUS_RTE_SHIFT, EMVSIM_RX_STATUS_RTE_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_RX_STATUS, field BWT_ERR[10] (W1C)
 *
 * Used to indicate if the block wait time has been exceeded. The threshold is
 * set by the block wait time registers.
 *
 * Values:
 * - 0b0 - Block wait time not exceeded
 * - 0b1 - Block wait time was exceeded
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_RX_STATUS_BWT_ERR field. */
#define EMVSIM_RD_RX_STATUS_BWT_ERR(base) ((EMVSIM_RX_STATUS_REG(base) & EMVSIM_RX_STATUS_BWT_ERR_MASK) >> EMVSIM_RX_STATUS_BWT_ERR_SHIFT)
#define EMVSIM_BRD_RX_STATUS_BWT_ERR(base) (BME_UBFX32(&EMVSIM_RX_STATUS_REG(base), EMVSIM_RX_STATUS_BWT_ERR_SHIFT, EMVSIM_RX_STATUS_BWT_ERR_WIDTH))

/*! @brief Set the BWT_ERR field to a new value. */
#define EMVSIM_WR_RX_STATUS_BWT_ERR(base, value) (EMVSIM_RMW_RX_STATUS(base, (EMVSIM_RX_STATUS_BWT_ERR_MASK | EMVSIM_RX_STATUS_RFO_MASK | EMVSIM_RX_STATUS_RX_DATA_MASK | EMVSIM_RX_STATUS_CWT_ERR_MASK | EMVSIM_RX_STATUS_RTE_MASK | EMVSIM_RX_STATUS_BGT_ERR_MASK | EMVSIM_RX_STATUS_PEF_MASK | EMVSIM_RX_STATUS_FEF_MASK), EMVSIM_RX_STATUS_BWT_ERR(value)))
#define EMVSIM_BWR_RX_STATUS_BWT_ERR(base, value) (BME_BFI32(&EMVSIM_RX_STATUS_REG(base), ((uint32_t)(value) << EMVSIM_RX_STATUS_BWT_ERR_SHIFT), EMVSIM_RX_STATUS_BWT_ERR_SHIFT, EMVSIM_RX_STATUS_BWT_ERR_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_RX_STATUS, field BGT_ERR[11] (W1C)
 *
 * Used to indicate if the block guard time was too small. The threshold is set
 * by the block guard time register.
 *
 * Values:
 * - 0b0 - Block guard time was sufficient
 * - 0b1 - Block guard time was too small
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_RX_STATUS_BGT_ERR field. */
#define EMVSIM_RD_RX_STATUS_BGT_ERR(base) ((EMVSIM_RX_STATUS_REG(base) & EMVSIM_RX_STATUS_BGT_ERR_MASK) >> EMVSIM_RX_STATUS_BGT_ERR_SHIFT)
#define EMVSIM_BRD_RX_STATUS_BGT_ERR(base) (BME_UBFX32(&EMVSIM_RX_STATUS_REG(base), EMVSIM_RX_STATUS_BGT_ERR_SHIFT, EMVSIM_RX_STATUS_BGT_ERR_WIDTH))

/*! @brief Set the BGT_ERR field to a new value. */
#define EMVSIM_WR_RX_STATUS_BGT_ERR(base, value) (EMVSIM_RMW_RX_STATUS(base, (EMVSIM_RX_STATUS_BGT_ERR_MASK | EMVSIM_RX_STATUS_RFO_MASK | EMVSIM_RX_STATUS_RX_DATA_MASK | EMVSIM_RX_STATUS_CWT_ERR_MASK | EMVSIM_RX_STATUS_RTE_MASK | EMVSIM_RX_STATUS_BWT_ERR_MASK | EMVSIM_RX_STATUS_PEF_MASK | EMVSIM_RX_STATUS_FEF_MASK), EMVSIM_RX_STATUS_BGT_ERR(value)))
#define EMVSIM_BWR_RX_STATUS_BGT_ERR(base, value) (BME_BFI32(&EMVSIM_RX_STATUS_REG(base), ((uint32_t)(value) << EMVSIM_RX_STATUS_BGT_ERR_SHIFT), EMVSIM_RX_STATUS_BGT_ERR_SHIFT, EMVSIM_RX_STATUS_BGT_ERR_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_RX_STATUS, field PEF[12] (W1C)
 *
 * Used to indicate if a received byte had a parity error or not. A parity error
 * will cause transmission of NACK if ANACK bit is set in CTRL register and PEF
 * bit will not be asserted. When ANACK is not set, PEF will be asserted. This
 * bit will also not assert when ICM bit is set; however parity is checked in ICM =
 * 1 mode. It is simply an indication that a parity error has occured.
 *
 * Values:
 * - 0b0 - No parity error detected
 * - 0b1 - Parity error detected
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_RX_STATUS_PEF field. */
#define EMVSIM_RD_RX_STATUS_PEF(base) ((EMVSIM_RX_STATUS_REG(base) & EMVSIM_RX_STATUS_PEF_MASK) >> EMVSIM_RX_STATUS_PEF_SHIFT)
#define EMVSIM_BRD_RX_STATUS_PEF(base) (BME_UBFX32(&EMVSIM_RX_STATUS_REG(base), EMVSIM_RX_STATUS_PEF_SHIFT, EMVSIM_RX_STATUS_PEF_WIDTH))

