RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*! @brief Set the PEF field to a new value. */
#define EMVSIM_WR_RX_STATUS_PEF(base, value) (EMVSIM_RMW_RX_STATUS(base, (EMVSIM_RX_STATUS_PEF_MASK | EMVSIM_RX_STATUS_RFO_MASK | EMVSIM_RX_STATUS_RX_DATA_MASK | EMVSIM_RX_STATUS_CWT_ERR_MASK | EMVSIM_RX_STATUS_RTE_MASK | EMVSIM_RX_STATUS_BWT_ERR_MASK | EMVSIM_RX_STATUS_BGT_ERR_MASK | EMVSIM_RX_STATUS_FEF_MASK), EMVSIM_RX_STATUS_PEF(value)))
#define EMVSIM_BWR_RX_STATUS_PEF(base, value) (BME_BFI32(&EMVSIM_RX_STATUS_REG(base), ((uint32_t)(value) << EMVSIM_RX_STATUS_PEF_SHIFT), EMVSIM_RX_STATUS_PEF_SHIFT, EMVSIM_RX_STATUS_PEF_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_RX_STATUS, field FEF[13] (W1C)
 *
 * Used to indicate if the current received byte did not have proper STOP bits.
 * This will not cause a NACK transmission. This bit will not cause an interrupt
 * assertion. It is simply an indication that a framing error has occured.
 *
 * Values:
 * - 0b0 - No frame error detected
 * - 0b1 - Frame error detected
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_RX_STATUS_FEF field. */
#define EMVSIM_RD_RX_STATUS_FEF(base) ((EMVSIM_RX_STATUS_REG(base) & EMVSIM_RX_STATUS_FEF_MASK) >> EMVSIM_RX_STATUS_FEF_SHIFT)
#define EMVSIM_BRD_RX_STATUS_FEF(base) (BME_UBFX32(&EMVSIM_RX_STATUS_REG(base), EMVSIM_RX_STATUS_FEF_SHIFT, EMVSIM_RX_STATUS_FEF_WIDTH))

/*! @brief Set the FEF field to a new value. */
#define EMVSIM_WR_RX_STATUS_FEF(base, value) (EMVSIM_RMW_RX_STATUS(base, (EMVSIM_RX_STATUS_FEF_MASK | EMVSIM_RX_STATUS_RFO_MASK | EMVSIM_RX_STATUS_RX_DATA_MASK | EMVSIM_RX_STATUS_CWT_ERR_MASK | EMVSIM_RX_STATUS_RTE_MASK | EMVSIM_RX_STATUS_BWT_ERR_MASK | EMVSIM_RX_STATUS_BGT_ERR_MASK | EMVSIM_RX_STATUS_PEF_MASK), EMVSIM_RX_STATUS_FEF(value)))
#define EMVSIM_BWR_RX_STATUS_FEF(base, value) (BME_BFI32(&EMVSIM_RX_STATUS_REG(base), ((uint32_t)(value) << EMVSIM_RX_STATUS_FEF_SHIFT), EMVSIM_RX_STATUS_FEF_SHIFT, EMVSIM_RX_STATUS_FEF_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_RX_STATUS, field RX_WPTR[19:16] (RO)
 *
 * Value of write pointer of Receive FIFO
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_RX_STATUS_RX_WPTR field. */
#define EMVSIM_RD_RX_STATUS_RX_WPTR(base) ((EMVSIM_RX_STATUS_REG(base) & EMVSIM_RX_STATUS_RX_WPTR_MASK) >> EMVSIM_RX_STATUS_RX_WPTR_SHIFT)
#define EMVSIM_BRD_RX_STATUS_RX_WPTR(base) (BME_UBFX32(&EMVSIM_RX_STATUS_REG(base), EMVSIM_RX_STATUS_RX_WPTR_SHIFT, EMVSIM_RX_STATUS_RX_WPTR_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_RX_STATUS, field RX_CNT[28:24] (RO)
 *
 * These bits indicate the number of bytes stored in the receive FIFO.
 *
 * Values:
 * - 0b00000 - FIFO is emtpy
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_RX_STATUS_RX_CNT field. */
#define EMVSIM_RD_RX_STATUS_RX_CNT(base) ((EMVSIM_RX_STATUS_REG(base) & EMVSIM_RX_STATUS_RX_CNT_MASK) >> EMVSIM_RX_STATUS_RX_CNT_SHIFT)
#define EMVSIM_BRD_RX_STATUS_RX_CNT(base) (BME_UBFX32(&EMVSIM_RX_STATUS_REG(base), EMVSIM_RX_STATUS_RX_CNT_SHIFT, EMVSIM_RX_STATUS_RX_CNT_WIDTH))
/*@}*/

/*******************************************************************************
 * EMVSIM_TX_STATUS - Transmitter Status Register
 ******************************************************************************/

/*!
 * @brief EMVSIM_TX_STATUS - Transmitter Status Register (RW)
 *
 * Reset value: 0x000000B8U
 */
/*!
 * @name Constants and macros for entire EMVSIM_TX_STATUS register
 */
/*@{*/
#define EMVSIM_RD_TX_STATUS(base) (EMVSIM_TX_STATUS_REG(base))
#define EMVSIM_WR_TX_STATUS(base, value) (EMVSIM_TX_STATUS_REG(base) = (value))
#define EMVSIM_RMW_TX_STATUS(base, mask, value) (EMVSIM_WR_TX_STATUS(base, (EMVSIM_RD_TX_STATUS(base) & ~(mask)) | (value)))
#define EMVSIM_SET_TX_STATUS(base, value) (BME_OR32(&EMVSIM_TX_STATUS_REG(base), (uint32_t)(value)))
#define EMVSIM_CLR_TX_STATUS(base, value) (BME_AND32(&EMVSIM_TX_STATUS_REG(base), (uint32_t)(~(value))))
#define EMVSIM_TOG_TX_STATUS(base, value) (BME_XOR32(&EMVSIM_TX_STATUS_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual EMVSIM_TX_STATUS bitfields
 */

/*!
 * @name Register EMVSIM_TX_STATUS, field TNTE[0] (W1C)
 *
 * Used to indicate the transmit NACK threshold has been reached. When TNTE is
 * high, no further transmissions will be done until the TNTE flag is cleared. Any
 * data transmissions still pending in the transmit FIFO will be aborted, and
 * the TC, ETC, and TFE flags will be set. The TNTE flag will create an interrupt
 * if TNACK_IM in the INT_MASK register is low. The TNTE bit is a
 * write-one-to-clear bit.
 *
 * Values:
 * - 0b0 - Transmit NACK threshold has not been reached (default)
 * - 0b1 - Transmit NACK threshold reached; transmitter frozen
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_TX_STATUS_TNTE field. */
#define EMVSIM_RD_TX_STATUS_TNTE(base) ((EMVSIM_TX_STATUS_REG(base) & EMVSIM_TX_STATUS_TNTE_MASK) >> EMVSIM_TX_STATUS_TNTE_SHIFT)
#define EMVSIM_BRD_TX_STATUS_TNTE(base) (BME_UBFX32(&EMVSIM_TX_STATUS_REG(base), EMVSIM_TX_STATUS_TNTE_SHIFT, EMVSIM_TX_STATUS_TNTE_WIDTH))

/*! @brief Set the TNTE field to a new value. */
#define EMVSIM_WR_TX_STATUS_TNTE(base, value) (EMVSIM_RMW_TX_STATUS(base, (EMVSIM_TX_STATUS_TNTE_MASK | EMVSIM_TX_STATUS_TFE_MASK | EMVSIM_TX_STATUS_ETCF_MASK | EMVSIM_TX_STATUS_TCF_MASK | EMVSIM_TX_STATUS_TFF_MASK | EMVSIM_TX_STATUS_GPCNT0_TO_MASK | EMVSIM_TX_STATUS_GPCNT1_TO_MASK), EMVSIM_TX_STATUS_TNTE(value)))
#define EMVSIM_BWR_TX_STATUS_TNTE(base, value) (BME_BFI32(&EMVSIM_TX_STATUS_REG(base), ((uint32_t)(value) << EMVSIM_TX_STATUS_TNTE_SHIFT), EMVSIM_TX_STATUS_TNTE_SHIFT, EMVSIM_TX_STATUS_TNTE_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_TX_STATUS, field TFE[3] (W1C)
 *
 * Used to indicate that the EMV SIM transmit FIFO has been emptied. This bit
 * will be set when the last byte in the transmit FIFO has been transferred out of
 * the EMV SIM transmitter to the Smart Card successfully. TFE will also be set
 * when the TNTE flag is set. The TFE flag will create an interrupt if TFE_IM in
 * the INT_MASK register is low. The TFE bit is a write-one-to-clear bit.
 *
 * Values:
 * - 0b0 - Transmit FIFO is not empty
 * - 0b1 - Transmit FIFO is empty (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_TX_STATUS_TFE field. */
#define EMVSIM_RD_TX_STATUS_TFE(base) ((EMVSIM_TX_STATUS_REG(base) & EMVSIM_TX_STATUS_TFE_MASK) >> EMVSIM_TX_STATUS_TFE_SHIFT)
#define EMVSIM_BRD_TX_STATUS_TFE(base) (BME_UBFX32(&EMVSIM_TX_STATUS_REG(base), EMVSIM_TX_STATUS_TFE_SHIFT, EMVSIM_TX_STATUS_TFE_WIDTH))

/*! @brief Set the TFE field to a new value. */
#define EMVSIM_WR_TX_STATUS_TFE(base, value) (EMVSIM_RMW_TX_STATUS(base, (EMVSIM_TX_STATUS_TFE_MASK | EMVSIM_TX_STATUS_TNTE_MASK | EMVSIM_TX_STATUS_ETCF_MASK | EMVSIM_TX_STATUS_TCF_MASK | EMVSIM_TX_STATUS_TFF_MASK | EMVSIM_TX_STATUS_GPCNT0_TO_MASK | EMVSIM_TX_STATUS_GPCNT1_TO_MASK), EMVSIM_TX_STATUS_TFE(value)))
#define EMVSIM_BWR_TX_STATUS_TFE(base, value) (BME_BFI32(&EMVSIM_TX_STATUS_REG(base), ((uint32_t)(value) << EMVSIM_TX_STATUS_TFE_SHIFT), EMVSIM_TX_STATUS_TFE_SHIFT, EMVSIM_TX_STATUS_TFE_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_TX_STATUS, field ETCF[4] (W1C)
 *
 * Used to indicate that the EMV SIM transmitter has finished sending the last
 * byte in transmit FIFO (if XMT_CRC_LRC = 0) or finished sending the LRC or CRC
 * byte (if XMT_CRC_LRC = 1). This bit differs from the TC bit in that it is set
 * before the guard time of the last byte has elapsed. The ETC flag will create an
 * interrupt if ETC_IM in the INT_MASK register is low. The ETC bit is a
 * write-one-to-clear bit.
 *
 * Values:
 * - 0b0 - Transmit pending or in progress
 * - 0b1 - Transmit complete (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_TX_STATUS_ETCF field. */
#define EMVSIM_RD_TX_STATUS_ETCF(base) ((EMVSIM_TX_STATUS_REG(base) & EMVSIM_TX_STATUS_ETCF_MASK) >> EMVSIM_TX_STATUS_ETCF_SHIFT)
#define EMVSIM_BRD_TX_STATUS_ETCF(base) (BME_UBFX32(&EMVSIM_TX_STATUS_REG(base), EMVSIM_TX_STATUS_ETCF_SHIFT, EMVSIM_TX_STATUS_ETCF_WIDTH))

