RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*******************************************************************************
 * EMVSIM_PCSR - Port Control and Status Register
 ******************************************************************************/

/*!
 * @brief EMVSIM_PCSR - Port Control and Status Register (RW)
 *
 * Reset value: 0x01000000U
 */
/*!
 * @name Constants and macros for entire EMVSIM_PCSR register
 */
/*@{*/
#define EMVSIM_RD_PCSR(base)     (EMVSIM_PCSR_REG(base))
#define EMVSIM_WR_PCSR(base, value) (EMVSIM_PCSR_REG(base) = (value))
#define EMVSIM_RMW_PCSR(base, mask, value) (EMVSIM_WR_PCSR(base, (EMVSIM_RD_PCSR(base) & ~(mask)) | (value)))
#define EMVSIM_SET_PCSR(base, value) (BME_OR32(&EMVSIM_PCSR_REG(base), (uint32_t)(value)))
#define EMVSIM_CLR_PCSR(base, value) (BME_AND32(&EMVSIM_PCSR_REG(base), (uint32_t)(~(value))))
#define EMVSIM_TOG_PCSR(base, value) (BME_XOR32(&EMVSIM_PCSR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual EMVSIM_PCSR bitfields
 */

/*!
 * @name Register EMVSIM_PCSR, field SAPD[0] (RW)
 *
 * Used to enable/disable the auto power down feature. This bit must be set
 * prior to the auto power conditions are met. This bit will be return to 0 at the
 * end of the auto power down sequence. This bit controls the auto power down
 * function which can be initiated by: Setting the SPD bit in this register by
 * software Assertion of the RTE bit in the RX_STATUS register Assertion of the SPDIF
 * bit when the interrupt is used for detecting card removal Manual Power Down via
 * software by writing to the SCEN, SRST, and VCC_EN can still be carried out
 * irrespective of the value of this bit.
 *
 * Values:
 * - 0b0 - Auto power down disabled (default)
 * - 0b1 - Auto power down enabled
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_PCSR_SAPD field. */
#define EMVSIM_RD_PCSR_SAPD(base) ((EMVSIM_PCSR_REG(base) & EMVSIM_PCSR_SAPD_MASK) >> EMVSIM_PCSR_SAPD_SHIFT)
#define EMVSIM_BRD_PCSR_SAPD(base) (BME_UBFX32(&EMVSIM_PCSR_REG(base), EMVSIM_PCSR_SAPD_SHIFT, EMVSIM_PCSR_SAPD_WIDTH))

/*! @brief Set the SAPD field to a new value. */
#define EMVSIM_WR_PCSR_SAPD(base, value) (EMVSIM_RMW_PCSR(base, (EMVSIM_PCSR_SAPD_MASK | EMVSIM_PCSR_SPDIF_MASK), EMVSIM_PCSR_SAPD(value)))
#define EMVSIM_BWR_PCSR_SAPD(base, value) (BME_BFI32(&EMVSIM_PCSR_REG(base), ((uint32_t)(value) << EMVSIM_PCSR_SAPD_SHIFT), EMVSIM_PCSR_SAPD_SHIFT, EMVSIM_PCSR_SAPD_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_PCSR, field SVCC_EN[1] (RW)
 *
 * Used to control the state of the SVEN pin on Smart Card port. The SVEN pin
 * controls the Smart Card Vcc enable in the power management chip. It can be
 * forced low by hardware during the auto power down sequence. This bit is XORed with
 * the VCCENP bit to control the polarity of the SVEN output pad.
 *
 * Values:
 * - 0b0 - Smart Card Voltage disabled (default)
 * - 0b1 - Smart Card Voltage enabled
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_PCSR_SVCC_EN field. */
#define EMVSIM_RD_PCSR_SVCC_EN(base) ((EMVSIM_PCSR_REG(base) & EMVSIM_PCSR_SVCC_EN_MASK) >> EMVSIM_PCSR_SVCC_EN_SHIFT)
#define EMVSIM_BRD_PCSR_SVCC_EN(base) (BME_UBFX32(&EMVSIM_PCSR_REG(base), EMVSIM_PCSR_SVCC_EN_SHIFT, EMVSIM_PCSR_SVCC_EN_WIDTH))

/*! @brief Set the SVCC_EN field to a new value. */
#define EMVSIM_WR_PCSR_SVCC_EN(base, value) (EMVSIM_RMW_PCSR(base, (EMVSIM_PCSR_SVCC_EN_MASK | EMVSIM_PCSR_SPDIF_MASK), EMVSIM_PCSR_SVCC_EN(value)))
#define EMVSIM_BWR_PCSR_SVCC_EN(base, value) (BME_BFI32(&EMVSIM_PCSR_REG(base), ((uint32_t)(value) << EMVSIM_PCSR_SVCC_EN_SHIFT), EMVSIM_PCSR_SVCC_EN_SHIFT, EMVSIM_PCSR_SVCC_EN_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_PCSR, field VCCENP[2] (RW)
 *
 * Used to control the polarity of the SVEN output pad via the SVCC_EN bit. When
 * set to '1', this bit will invert the value of SVCC_EN bit of this register
 * and output to SVEN output pad of device.
 *
 * Values:
 * - 0b0 - VCC_EN is active high. Polarity of SVCC_EN is unchanged.
 * - 0b1 - VCC_EN is active low. Polarity of SVCC_EN is inverted.
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_PCSR_VCCENP field. */
#define EMVSIM_RD_PCSR_VCCENP(base) ((EMVSIM_PCSR_REG(base) & EMVSIM_PCSR_VCCENP_MASK) >> EMVSIM_PCSR_VCCENP_SHIFT)
#define EMVSIM_BRD_PCSR_VCCENP(base) (BME_UBFX32(&EMVSIM_PCSR_REG(base), EMVSIM_PCSR_VCCENP_SHIFT, EMVSIM_PCSR_VCCENP_WIDTH))

/*! @brief Set the VCCENP field to a new value. */
#define EMVSIM_WR_PCSR_VCCENP(base, value) (EMVSIM_RMW_PCSR(base, (EMVSIM_PCSR_VCCENP_MASK | EMVSIM_PCSR_SPDIF_MASK), EMVSIM_PCSR_VCCENP(value)))
#define EMVSIM_BWR_PCSR_VCCENP(base, value) (BME_BFI32(&EMVSIM_PCSR_REG(base), ((uint32_t)(value) << EMVSIM_PCSR_VCCENP_SHIFT), EMVSIM_PCSR_VCCENP_SHIFT, EMVSIM_PCSR_VCCENP_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_PCSR, field SRST[3] (RW)
 *
 * Used to control state of reset line to the Smart Card. It can be forced low
 * by hardware during the auto power down sequence. Smart Card reset signals are
 * active low.
 *
 * Values:
 * - 0b0 - Smart Card Reset is asserted (default)
 * - 0b1 - Smart Card Reset is de-asserted
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_PCSR_SRST field. */
#define EMVSIM_RD_PCSR_SRST(base) ((EMVSIM_PCSR_REG(base) & EMVSIM_PCSR_SRST_MASK) >> EMVSIM_PCSR_SRST_SHIFT)
#define EMVSIM_BRD_PCSR_SRST(base) (BME_UBFX32(&EMVSIM_PCSR_REG(base), EMVSIM_PCSR_SRST_SHIFT, EMVSIM_PCSR_SRST_WIDTH))

/*! @brief Set the SRST field to a new value. */
#define EMVSIM_WR_PCSR_SRST(base, value) (EMVSIM_RMW_PCSR(base, (EMVSIM_PCSR_SRST_MASK | EMVSIM_PCSR_SPDIF_MASK), EMVSIM_PCSR_SRST(value)))
#define EMVSIM_BWR_PCSR_SRST(base, value) (BME_BFI32(&EMVSIM_PCSR_REG(base), ((uint32_t)(value) << EMVSIM_PCSR_SRST_SHIFT), EMVSIM_PCSR_SRST_SHIFT, EMVSIM_PCSR_SRST_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_PCSR, field SCEN[4] (RW)
 *
 * Used to enable/disable the clock to the Smart Card. It can be forced low by
 * hardware during the auto power down sequence.
 *
 * Values:
 * - 0b0 - Smart Card Clock Disabled
 * - 0b1 - Smart Card Clock Enabled
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_PCSR_SCEN field. */
#define EMVSIM_RD_PCSR_SCEN(base) ((EMVSIM_PCSR_REG(base) & EMVSIM_PCSR_SCEN_MASK) >> EMVSIM_PCSR_SCEN_SHIFT)
#define EMVSIM_BRD_PCSR_SCEN(base) (BME_UBFX32(&EMVSIM_PCSR_REG(base), EMVSIM_PCSR_SCEN_SHIFT, EMVSIM_PCSR_SCEN_WIDTH))

