RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*
 * MK80F25615 FB
 *
 * FlexBus external bus interface
 *
 * Registers defined in this header file:
 * - FB_CSAR - Chip Select Address Register
 * - FB_CSMR - Chip Select Mask Register
 * - FB_CSCR - Chip Select Control Register
 * - FB_CSPMCR - Chip Select port Multiplexing Control Register
 */

#define FB_INSTANCE_COUNT (1U) /*!< Number of instances of the FB module. */
#define FB_IDX (0U) /*!< Instance number for FB. */

/*******************************************************************************
 * FB_CSAR - Chip Select Address Register
 ******************************************************************************/

/*!
 * @brief FB_CSAR - Chip Select Address Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Specifies the associated chip-select's base address.
 */
/*!
 * @name Constants and macros for entire FB_CSAR register
 */
/*@{*/
#define FB_RD_CSAR(base, index)  (FB_CSAR_REG(base, index))
#define FB_WR_CSAR(base, index, value) (FB_CSAR_REG(base, index) = (value))
#define FB_RMW_CSAR(base, index, mask, value) (FB_WR_CSAR(base, index, (FB_RD_CSAR(base, index) & ~(mask)) | (value)))
#define FB_SET_CSAR(base, index, value) (BME_OR32(&FB_CSAR_REG(base, index), (uint32_t)(value)))
#define FB_CLR_CSAR(base, index, value) (BME_AND32(&FB_CSAR_REG(base, index), (uint32_t)(~(value))))
#define FB_TOG_CSAR(base, index, value) (BME_XOR32(&FB_CSAR_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual FB_CSAR bitfields
 */

/*!
 * @name Register FB_CSAR, field BA[31:16] (RW)
 *
 * Defines the base address for memory dedicated to the associated chip-select.
 * BA is compared to bits 31-16 on the internal address bus to determine if the
 * associated chip-select's memory is being accessed. Because the FlexBus module
 * is one of the slaves connected to the crossbar switch, it is only accessible
 * within a certain memory range. See the chip memory map for the applicable
 * FlexBus "expansion" address range for which the chip-selects can be active. Set the
 * CSARn and CSMRn registers appropriately before accessing this region.
 */
/*@{*/
/*! @brief Read current value of the FB_CSAR_BA field. */
#define FB_RD_CSAR_BA(base, index) ((FB_CSAR_REG(base, index) & FB_CSAR_BA_MASK) >> FB_CSAR_BA_SHIFT)
#define FB_BRD_CSAR_BA(base, index) (FB_RD_CSAR_BA(base, index))

/*! @brief Set the BA field to a new value. */
#define FB_WR_CSAR_BA(base, index, value) (FB_RMW_CSAR(base, index, FB_CSAR_BA_MASK, FB_CSAR_BA(value)))
#define FB_BWR_CSAR_BA(base, index, value) (FB_WR_CSAR_BA(base, index, value))
/*@}*/

/*******************************************************************************
 * FB_CSMR - Chip Select Mask Register
 ******************************************************************************/

/*!
 * @brief FB_CSMR - Chip Select Mask Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Specifies the address mask and allowable access types for the associated
 * chip-select.
 */
/*!
 * @name Constants and macros for entire FB_CSMR register
 */
/*@{*/
#define FB_RD_CSMR(base, index)  (FB_CSMR_REG(base, index))
#define FB_WR_CSMR(base, index, value) (FB_CSMR_REG(base, index) = (value))
#define FB_RMW_CSMR(base, index, mask, value) (FB_WR_CSMR(base, index, (FB_RD_CSMR(base, index) & ~(mask)) | (value)))
#define FB_SET_CSMR(base, index, value) (BME_OR32(&FB_CSMR_REG(base, index), (uint32_t)(value)))
#define FB_CLR_CSMR(base, index, value) (BME_AND32(&FB_CSMR_REG(base, index), (uint32_t)(~(value))))
#define FB_TOG_CSMR(base, index, value) (BME_XOR32(&FB_CSMR_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual FB_CSMR bitfields
 */

/*!
 * @name Register FB_CSMR, field V[0] (RW)
 *
 * Specifies whether the corresponding CSAR, CSMR, and CSCR contents are valid.
 * Programmed chip-selects do not assert until the V bit is 1b (except for
 * FB_CS0, which acts as the global chip-select). At reset, FB_CS0 will fire for any
 * access to the FlexBus memory region. CSMR0[V] must be set as part of the chip
 * select initialization sequence to allow other chip selects to function as
 * programmed.
 *
 * Values:
 * - 0b0 - Chip-select is invalid.
 * - 0b1 - Chip-select is valid.
 */
/*@{*/
/*! @brief Read current value of the FB_CSMR_V field. */
#define FB_RD_CSMR_V(base, index) ((FB_CSMR_REG(base, index) & FB_CSMR_V_MASK) >> FB_CSMR_V_SHIFT)
#define FB_BRD_CSMR_V(base, index) (BME_UBFX32(&FB_CSMR_REG(base, index), FB_CSMR_V_SHIFT, FB_CSMR_V_WIDTH))

/*! @brief Set the V field to a new value. */
#define FB_WR_CSMR_V(base, index, value) (FB_RMW_CSMR(base, index, FB_CSMR_V_MASK, FB_CSMR_V(value)))
#define FB_BWR_CSMR_V(base, index, value) (BME_BFI32(&FB_CSMR_REG(base, index), ((uint32_t)(value) << FB_CSMR_V_SHIFT), FB_CSMR_V_SHIFT, FB_CSMR_V_WIDTH))
/*@}*/

/*!
 * @name Register FB_CSMR, field WP[8] (RW)
 *
 * Controls write accesses to the address range in the corresponding CSAR.
 *
 * Values:
 * - 0b0 - Write accesses are allowed.
 * - 0b1 - Write accesses are not allowed. Attempting to write to the range of
 *     addresses for which the WP bit is set results in a bus error termination of
 *     the internal cycle and no external cycle.
 */
/*@{*/
/*! @brief Read current value of the FB_CSMR_WP field. */
#define FB_RD_CSMR_WP(base, index) ((FB_CSMR_REG(base, index) & FB_CSMR_WP_MASK) >> FB_CSMR_WP_SHIFT)
#define FB_BRD_CSMR_WP(base, index) (BME_UBFX32(&FB_CSMR_REG(base, index), FB_CSMR_WP_SHIFT, FB_CSMR_WP_WIDTH))

/*! @brief Set the WP field to a new value. */
#define FB_WR_CSMR_WP(base, index, value) (FB_RMW_CSMR(base, index, FB_CSMR_WP_MASK, FB_CSMR_WP(value)))
#define FB_BWR_CSMR_WP(base, index, value) (BME_BFI32(&FB_CSMR_REG(base, index), ((uint32_t)(value) << FB_CSMR_WP_SHIFT), FB_CSMR_WP_SHIFT, FB_CSMR_WP_WIDTH))
/*@}*/

/*!
 * @name Register FB_CSMR, field BAM[31:16] (RW)
 *
 * Defines the associated chip-select's block size by masking address bits.
 *
 * Values:
 * - 0b0000000000000000 - The corresponding address bit in CSAR is used in the
 *     chip-select decode.
 * - 0b0000000000000001 - The corresponding address bit in CSAR is a don't care
 *     in the chip-select decode.
 */
/*@{*/
/*! @brief Read current value of the FB_CSMR_BAM field. */
#define FB_RD_CSMR_BAM(base, index) ((FB_CSMR_REG(base, index) & FB_CSMR_BAM_MASK) >> FB_CSMR_BAM_SHIFT)
#define FB_BRD_CSMR_BAM(base, index) (FB_RD_CSMR_BAM(base, index))

/*! @brief Set the BAM field to a new value. */
#define FB_WR_CSMR_BAM(base, index, value) (FB_RMW_CSMR(base, index, FB_CSMR_BAM_MASK, FB_CSMR_BAM(value)))
#define FB_BWR_CSMR_BAM(base, index, value) (FB_WR_CSMR_BAM(base, index, value))
/*@}*/

