RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*******************************************************************************
 * FLEXIO_TIMCMP - Timer Compare N Register
 ******************************************************************************/

/*!
 * @brief FLEXIO_TIMCMP - Timer Compare N Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
/*!
 * @name Constants and macros for entire FLEXIO_TIMCMP register
 */
/*@{*/
#define FLEXIO_RD_TIMCMP(base, index) (FLEXIO_TIMCMP_REG(base, index))
#define FLEXIO_WR_TIMCMP(base, index, value) (FLEXIO_TIMCMP_REG(base, index) = (value))
#define FLEXIO_RMW_TIMCMP(base, index, mask, value) (FLEXIO_WR_TIMCMP(base, index, (FLEXIO_RD_TIMCMP(base, index) & ~(mask)) | (value)))
#define FLEXIO_SET_TIMCMP(base, index, value) (BME_OR32(&FLEXIO_TIMCMP_REG(base, index), (uint32_t)(value)))
#define FLEXIO_CLR_TIMCMP(base, index, value) (BME_AND32(&FLEXIO_TIMCMP_REG(base, index), (uint32_t)(~(value))))
#define FLEXIO_TOG_TIMCMP(base, index, value) (BME_XOR32(&FLEXIO_TIMCMP_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual FLEXIO_TIMCMP bitfields
 */

/*!
 * @name Register FLEXIO_TIMCMP, field CMP[15:0] (RW)
 *
 * The timer compare value is loaded into the timer counter when the timer is
 * first enabled, when the timer is reset and when the timer decrements down to
 * zero. In dual 8-bit counters baud/bit mode, the lower 8-bits configures the baud
 * rate divider equal to (CMP[7:0] + 1) * 2. The upper 8-bits configure the
 * number of bits in each word equal to (CMP[15:8] + 1) / 2. In dual 8-bit counters
 * PWM mode, the lower 8-bits configure the high period of the output to (CMP[7:0]
 * + 1) and the upper 8-bits configure the low period of the output to (CMP[15:8]
 * + 1). In 16-bit counter mode, the compare value can be used to generate the
 * baud rate divider (if shift clock source is timer output) to equal (CMP[15:0] +
 * 1) * 2. When the shift clock source is a pin or trigger input, the compare
 * register is used to set the number of bits in each word equal to (CMP[15:0] + 1)
 * / 2.
 */
/*@{*/
/*! @brief Read current value of the FLEXIO_TIMCMP_CMP field. */
#define FLEXIO_RD_TIMCMP_CMP(base, index) ((FLEXIO_TIMCMP_REG(base, index) & FLEXIO_TIMCMP_CMP_MASK) >> FLEXIO_TIMCMP_CMP_SHIFT)
#define FLEXIO_BRD_TIMCMP_CMP(base, index) (FLEXIO_RD_TIMCMP_CMP(base, index))

/*! @brief Set the CMP field to a new value. */
#define FLEXIO_WR_TIMCMP_CMP(base, index, value) (FLEXIO_RMW_TIMCMP(base, index, FLEXIO_TIMCMP_CMP_MASK, FLEXIO_TIMCMP_CMP(value)))
#define FLEXIO_BWR_TIMCMP_CMP(base, index, value) (FLEXIO_WR_TIMCMP_CMP(base, index, value))
/*@}*/

/*******************************************************************************
 * FLEXIO_SHIFTBUFNBS - Shifter Buffer N Nibble Byte Swapped Register
 ******************************************************************************/

/*!
 * @brief FLEXIO_SHIFTBUFNBS - Shifter Buffer N Nibble Byte Swapped Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
/*!
 * @name Constants and macros for entire FLEXIO_SHIFTBUFNBS register
 */
/*@{*/
#define FLEXIO_RD_SHIFTBUFNBS(base, index) (FLEXIO_SHIFTBUFNBS_REG(base, index))
#define FLEXIO_WR_SHIFTBUFNBS(base, index, value) (FLEXIO_SHIFTBUFNBS_REG(base, index) = (value))
#define FLEXIO_RMW_SHIFTBUFNBS(base, index, mask, value) (FLEXIO_WR_SHIFTBUFNBS(base, index, (FLEXIO_RD_SHIFTBUFNBS(base, index) & ~(mask)) | (value)))
#define FLEXIO_SET_SHIFTBUFNBS(base, index, value) (BME_OR32(&FLEXIO_SHIFTBUFNBS_REG(base, index), (uint32_t)(value)))
#define FLEXIO_CLR_SHIFTBUFNBS(base, index, value) (BME_AND32(&FLEXIO_SHIFTBUFNBS_REG(base, index), (uint32_t)(~(value))))
#define FLEXIO_TOG_SHIFTBUFNBS(base, index, value) (BME_XOR32(&FLEXIO_SHIFTBUFNBS_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * FLEXIO_SHIFTBUFHWS - Shifter Buffer N Half Word Swapped Register
 ******************************************************************************/

/*!
 * @brief FLEXIO_SHIFTBUFHWS - Shifter Buffer N Half Word Swapped Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
/*!
 * @name Constants and macros for entire FLEXIO_SHIFTBUFHWS register
 */
/*@{*/
#define FLEXIO_RD_SHIFTBUFHWS(base, index) (FLEXIO_SHIFTBUFHWS_REG(base, index))
#define FLEXIO_WR_SHIFTBUFHWS(base, index, value) (FLEXIO_SHIFTBUFHWS_REG(base, index) = (value))
#define FLEXIO_RMW_SHIFTBUFHWS(base, index, mask, value) (FLEXIO_WR_SHIFTBUFHWS(base, index, (FLEXIO_RD_SHIFTBUFHWS(base, index) & ~(mask)) | (value)))
#define FLEXIO_SET_SHIFTBUFHWS(base, index, value) (BME_OR32(&FLEXIO_SHIFTBUFHWS_REG(base, index), (uint32_t)(value)))
#define FLEXIO_CLR_SHIFTBUFHWS(base, index, value) (BME_AND32(&FLEXIO_SHIFTBUFHWS_REG(base, index), (uint32_t)(~(value))))
#define FLEXIO_TOG_SHIFTBUFHWS(base, index, value) (BME_XOR32(&FLEXIO_SHIFTBUFHWS_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * FLEXIO_SHIFTBUFNIS - Shifter Buffer N Nibble Swapped Register
 ******************************************************************************/

/*!
 * @brief FLEXIO_SHIFTBUFNIS - Shifter Buffer N Nibble Swapped Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
/*!
 * @name Constants and macros for entire FLEXIO_SHIFTBUFNIS register
 */
/*@{*/
#define FLEXIO_RD_SHIFTBUFNIS(base, index) (FLEXIO_SHIFTBUFNIS_REG(base, index))
#define FLEXIO_WR_SHIFTBUFNIS(base, index, value) (FLEXIO_SHIFTBUFNIS_REG(base, index) = (value))
#define FLEXIO_RMW_SHIFTBUFNIS(base, index, mask, value) (FLEXIO_WR_SHIFTBUFNIS(base, index, (FLEXIO_RD_SHIFTBUFNIS(base, index) & ~(mask)) | (value)))
#define FLEXIO_SET_SHIFTBUFNIS(base, index, value) (BME_OR32(&FLEXIO_SHIFTBUFNIS_REG(base, index), (uint32_t)(value)))
#define FLEXIO_CLR_SHIFTBUFNIS(base, index, value) (BME_AND32(&FLEXIO_SHIFTBUFNIS_REG(base, index), (uint32_t)(~(value))))
#define FLEXIO_TOG_SHIFTBUFNIS(base, index, value) (BME_XOR32(&FLEXIO_SHIFTBUFNIS_REG(base, index), (uint32_t)(value)))
/*@}*/

