RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*! @brief Set the R7 field to a new value. */
#define LMEM_WR_PCCRMR_R7(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R7_MASK, LMEM_PCCRMR_R7(value)))
#define LMEM_BWR_PCCRMR_R7(base, value) (LMEM_WR_PCCRMR_R7(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R6[19:18] (RW)
 *
 * Controls the cache mode for region 6
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R6 field. */
#define LMEM_RD_PCCRMR_R6(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R6_MASK) >> LMEM_PCCRMR_R6_SHIFT)
#define LMEM_BRD_PCCRMR_R6(base) (LMEM_RD_PCCRMR_R6(base))

/*! @brief Set the R6 field to a new value. */
#define LMEM_WR_PCCRMR_R6(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R6_MASK, LMEM_PCCRMR_R6(value)))
#define LMEM_BWR_PCCRMR_R6(base, value) (LMEM_WR_PCCRMR_R6(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R5[21:20] (RW)
 *
 * Controls the cache mode for region 5
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R5 field. */
#define LMEM_RD_PCCRMR_R5(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R5_MASK) >> LMEM_PCCRMR_R5_SHIFT)
#define LMEM_BRD_PCCRMR_R5(base) (LMEM_RD_PCCRMR_R5(base))

/*! @brief Set the R5 field to a new value. */
#define LMEM_WR_PCCRMR_R5(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R5_MASK, LMEM_PCCRMR_R5(value)))
#define LMEM_BWR_PCCRMR_R5(base, value) (LMEM_WR_PCCRMR_R5(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R4[23:22] (RW)
 *
 * Controls the cache mode for region 4
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R4 field. */
#define LMEM_RD_PCCRMR_R4(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R4_MASK) >> LMEM_PCCRMR_R4_SHIFT)
#define LMEM_BRD_PCCRMR_R4(base) (LMEM_RD_PCCRMR_R4(base))

/*! @brief Set the R4 field to a new value. */
#define LMEM_WR_PCCRMR_R4(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R4_MASK, LMEM_PCCRMR_R4(value)))
#define LMEM_BWR_PCCRMR_R4(base, value) (LMEM_WR_PCCRMR_R4(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R3[25:24] (RW)
 *
 * Controls the cache mode for region 3
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R3 field. */
#define LMEM_RD_PCCRMR_R3(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R3_MASK) >> LMEM_PCCRMR_R3_SHIFT)
#define LMEM_BRD_PCCRMR_R3(base) (LMEM_RD_PCCRMR_R3(base))

/*! @brief Set the R3 field to a new value. */
#define LMEM_WR_PCCRMR_R3(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R3_MASK, LMEM_PCCRMR_R3(value)))
#define LMEM_BWR_PCCRMR_R3(base, value) (LMEM_WR_PCCRMR_R3(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R2[27:26] (RW)
 *
 * Controls the cache mode for region 2
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R2 field. */
#define LMEM_RD_PCCRMR_R2(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R2_MASK) >> LMEM_PCCRMR_R2_SHIFT)
#define LMEM_BRD_PCCRMR_R2(base) (LMEM_RD_PCCRMR_R2(base))

/*! @brief Set the R2 field to a new value. */
#define LMEM_WR_PCCRMR_R2(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R2_MASK, LMEM_PCCRMR_R2(value)))
#define LMEM_BWR_PCCRMR_R2(base, value) (LMEM_WR_PCCRMR_R2(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R1[29:28] (RW)
 *
 * Controls the cache mode for region 1
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R1 field. */
#define LMEM_RD_PCCRMR_R1(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R1_MASK) >> LMEM_PCCRMR_R1_SHIFT)
#define LMEM_BRD_PCCRMR_R1(base) (LMEM_RD_PCCRMR_R1(base))

/*! @brief Set the R1 field to a new value. */
#define LMEM_WR_PCCRMR_R1(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R1_MASK, LMEM_PCCRMR_R1(value)))
#define LMEM_BWR_PCCRMR_R1(base, value) (LMEM_WR_PCCRMR_R1(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R0[31:30] (RW)
 *
 * Controls the cache mode for region 0
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R0 field. */
#define LMEM_RD_PCCRMR_R0(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R0_MASK) >> LMEM_PCCRMR_R0_SHIFT)
#define LMEM_BRD_PCCRMR_R0(base) (LMEM_RD_PCCRMR_R0(base))

/*! @brief Set the R0 field to a new value. */
#define LMEM_WR_PCCRMR_R0(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R0_MASK, LMEM_PCCRMR_R0(value)))
#define LMEM_BWR_PCCRMR_R0(base, value) (LMEM_WR_PCCRMR_R0(base, value))
/*@}*/

/*******************************************************************************
 * LMEM_PSCCR - Cache control register
 ******************************************************************************/

/*!
 * @brief LMEM_PSCCR - Cache control register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LMEM_PSCCR register
 */
/*@{*/
#define LMEM_RD_PSCCR(base)      (LMEM_PSCCR_REG(base))
#define LMEM_WR_PSCCR(base, value) (LMEM_PSCCR_REG(base) = (value))
#define LMEM_RMW_PSCCR(base, mask, value) (LMEM_WR_PSCCR(base, (LMEM_RD_PSCCR(base) & ~(mask)) | (value)))
#define LMEM_SET_PSCCR(base, value) (LMEM_WR_PSCCR(base, LMEM_RD_PSCCR(base) |  (value)))
#define LMEM_CLR_PSCCR(base, value) (LMEM_WR_PSCCR(base, LMEM_RD_PSCCR(base) & ~(value)))
#define LMEM_TOG_PSCCR(base, value) (LMEM_WR_PSCCR(base, LMEM_RD_PSCCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LMEM_PSCCR bitfields
 */

/*!
 * @name Register LMEM_PSCCR, field ENCACHE[0] (RW)
 *
 * Values:
 * - 0b0 - Cache disabled
 * - 0b1 - Cache enabled
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCCR_ENCACHE field. */
#define LMEM_RD_PSCCR_ENCACHE(base) ((LMEM_PSCCR_REG(base) & LMEM_PSCCR_ENCACHE_MASK) >> LMEM_PSCCR_ENCACHE_SHIFT)
#define LMEM_BRD_PSCCR_ENCACHE(base) (LMEM_RD_PSCCR_ENCACHE(base))

