RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*! @brief Set the R7 field to a new value. */
#define LMEM_WR_PSCRMR_R7(base, value) (LMEM_RMW_PSCRMR(base, LMEM_PSCRMR_R7_MASK, LMEM_PSCRMR_R7(value)))
#define LMEM_BWR_PSCRMR_R7(base, value) (LMEM_WR_PSCRMR_R7(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCRMR, field R6[19:18] (RW)
 *
 * Controls the cache mode for region 6
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCRMR_R6 field. */
#define LMEM_RD_PSCRMR_R6(base) ((LMEM_PSCRMR_REG(base) & LMEM_PSCRMR_R6_MASK) >> LMEM_PSCRMR_R6_SHIFT)
#define LMEM_BRD_PSCRMR_R6(base) (LMEM_RD_PSCRMR_R6(base))

/*! @brief Set the R6 field to a new value. */
#define LMEM_WR_PSCRMR_R6(base, value) (LMEM_RMW_PSCRMR(base, LMEM_PSCRMR_R6_MASK, LMEM_PSCRMR_R6(value)))
#define LMEM_BWR_PSCRMR_R6(base, value) (LMEM_WR_PSCRMR_R6(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCRMR, field R5[21:20] (RW)
 *
 * Controls the cache mode for region 5
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCRMR_R5 field. */
#define LMEM_RD_PSCRMR_R5(base) ((LMEM_PSCRMR_REG(base) & LMEM_PSCRMR_R5_MASK) >> LMEM_PSCRMR_R5_SHIFT)
#define LMEM_BRD_PSCRMR_R5(base) (LMEM_RD_PSCRMR_R5(base))

/*! @brief Set the R5 field to a new value. */
#define LMEM_WR_PSCRMR_R5(base, value) (LMEM_RMW_PSCRMR(base, LMEM_PSCRMR_R5_MASK, LMEM_PSCRMR_R5(value)))
#define LMEM_BWR_PSCRMR_R5(base, value) (LMEM_WR_PSCRMR_R5(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCRMR, field R4[23:22] (RW)
 *
 * Controls the cache mode for region 4
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCRMR_R4 field. */
#define LMEM_RD_PSCRMR_R4(base) ((LMEM_PSCRMR_REG(base) & LMEM_PSCRMR_R4_MASK) >> LMEM_PSCRMR_R4_SHIFT)
#define LMEM_BRD_PSCRMR_R4(base) (LMEM_RD_PSCRMR_R4(base))

/*! @brief Set the R4 field to a new value. */
#define LMEM_WR_PSCRMR_R4(base, value) (LMEM_RMW_PSCRMR(base, LMEM_PSCRMR_R4_MASK, LMEM_PSCRMR_R4(value)))
#define LMEM_BWR_PSCRMR_R4(base, value) (LMEM_WR_PSCRMR_R4(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCRMR, field R3[25:24] (RW)
 *
 * Controls the cache mode for region 3
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCRMR_R3 field. */
#define LMEM_RD_PSCRMR_R3(base) ((LMEM_PSCRMR_REG(base) & LMEM_PSCRMR_R3_MASK) >> LMEM_PSCRMR_R3_SHIFT)
#define LMEM_BRD_PSCRMR_R3(base) (LMEM_RD_PSCRMR_R3(base))

/*! @brief Set the R3 field to a new value. */
#define LMEM_WR_PSCRMR_R3(base, value) (LMEM_RMW_PSCRMR(base, LMEM_PSCRMR_R3_MASK, LMEM_PSCRMR_R3(value)))
#define LMEM_BWR_PSCRMR_R3(base, value) (LMEM_WR_PSCRMR_R3(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCRMR, field R2[27:26] (RW)
 *
 * Controls the cache mode for region 2
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCRMR_R2 field. */
#define LMEM_RD_PSCRMR_R2(base) ((LMEM_PSCRMR_REG(base) & LMEM_PSCRMR_R2_MASK) >> LMEM_PSCRMR_R2_SHIFT)
#define LMEM_BRD_PSCRMR_R2(base) (LMEM_RD_PSCRMR_R2(base))

/*! @brief Set the R2 field to a new value. */
#define LMEM_WR_PSCRMR_R2(base, value) (LMEM_RMW_PSCRMR(base, LMEM_PSCRMR_R2_MASK, LMEM_PSCRMR_R2(value)))
#define LMEM_BWR_PSCRMR_R2(base, value) (LMEM_WR_PSCRMR_R2(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCRMR, field R1[29:28] (RW)
 *
 * Controls the cache mode for region 1
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCRMR_R1 field. */
#define LMEM_RD_PSCRMR_R1(base) ((LMEM_PSCRMR_REG(base) & LMEM_PSCRMR_R1_MASK) >> LMEM_PSCRMR_R1_SHIFT)
#define LMEM_BRD_PSCRMR_R1(base) (LMEM_RD_PSCRMR_R1(base))

/*! @brief Set the R1 field to a new value. */
#define LMEM_WR_PSCRMR_R1(base, value) (LMEM_RMW_PSCRMR(base, LMEM_PSCRMR_R1_MASK, LMEM_PSCRMR_R1(value)))
#define LMEM_BWR_PSCRMR_R1(base, value) (LMEM_WR_PSCRMR_R1(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCRMR, field R0[31:30] (RW)
 *
 * Controls the cache mode for region 0
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCRMR_R0 field. */
#define LMEM_RD_PSCRMR_R0(base) ((LMEM_PSCRMR_REG(base) & LMEM_PSCRMR_R0_MASK) >> LMEM_PSCRMR_R0_SHIFT)
#define LMEM_BRD_PSCRMR_R0(base) (LMEM_RD_PSCRMR_R0(base))

/*! @brief Set the R0 field to a new value. */
#define LMEM_WR_PSCRMR_R0(base, value) (LMEM_RMW_PSCRMR(base, LMEM_PSCRMR_R0_MASK, LMEM_PSCRMR_R0(value)))
#define LMEM_BWR_PSCRMR_R0(base, value) (LMEM_WR_PSCRMR_R0(base, value))
/*@}*/

/*
 * MK80F25615 LPTMR
 *
 * Low Power Timer
 *
 * Registers defined in this header file:
 * - LPTMR_CSR - Low Power Timer Control Status Register
 * - LPTMR_PSR - Low Power Timer Prescale Register
 * - LPTMR_CMR - Low Power Timer Compare Register
 * - LPTMR_CNR - Low Power Timer Counter Register
 */

#define LPTMR_INSTANCE_COUNT (2U) /*!< Number of instances of the LPTMR module. */
#define LPTMR0_IDX (0U) /*!< Instance number for LPTMR0. */
#define LPTMR1_IDX (1U) /*!< Instance number for LPTMR1. */

/*******************************************************************************
 * LPTMR_CSR - Low Power Timer Control Status Register
 ******************************************************************************/

/*!
 * @brief LPTMR_CSR - Low Power Timer Control Status Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPTMR_CSR register
 */
/*@{*/
#define LPTMR_RD_CSR(base)       (LPTMR_CSR_REG(base))
#define LPTMR_WR_CSR(base, value) (LPTMR_CSR_REG(base) = (value))
#define LPTMR_RMW_CSR(base, mask, value) (LPTMR_WR_CSR(base, (LPTMR_RD_CSR(base) & ~(mask)) | (value)))
#define LPTMR_SET_CSR(base, value) (BME_OR32(&LPTMR_CSR_REG(base), (uint32_t)(value)))
#define LPTMR_CLR_CSR(base, value) (BME_AND32(&LPTMR_CSR_REG(base), (uint32_t)(~(value))))
#define LPTMR_TOG_CSR(base, value) (BME_XOR32(&LPTMR_CSR_REG(base), (uint32_t)(value)))
/*@}*/

