RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*! @brief Set the RTSWATER field to a new value. */
#define LPUART_WR_MODIR_RTSWATER(base, value) (LPUART_RMW_MODIR(base, LPUART_MODIR_RTSWATER_MASK, LPUART_MODIR_RTSWATER(value)))
#define LPUART_BWR_MODIR_RTSWATER(base, value) (BME_BFI32(&LPUART_MODIR_REG(base), ((uint32_t)(value) << LPUART_MODIR_RTSWATER_SHIFT), LPUART_MODIR_RTSWATER_SHIFT, LPUART_MODIR_RTSWATER_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_MODIR, field TNP[17:16] (RW)
 *
 * Enables whether the LPUART transmits a 1/OSR, 2/OSR, 3/OSR or 4/OSR narrow
 * pulse.
 *
 * Values:
 * - 0b00 - 1/OSR.
 * - 0b01 - 2/OSR.
 * - 0b10 - 3/OSR.
 * - 0b11 - 4/OSR.
 */
/*@{*/
/*! @brief Read current value of the LPUART_MODIR_TNP field. */
#define LPUART_RD_MODIR_TNP(base) ((LPUART_MODIR_REG(base) & LPUART_MODIR_TNP_MASK) >> LPUART_MODIR_TNP_SHIFT)
#define LPUART_BRD_MODIR_TNP(base) (BME_UBFX32(&LPUART_MODIR_REG(base), LPUART_MODIR_TNP_SHIFT, LPUART_MODIR_TNP_WIDTH))

/*! @brief Set the TNP field to a new value. */
#define LPUART_WR_MODIR_TNP(base, value) (LPUART_RMW_MODIR(base, LPUART_MODIR_TNP_MASK, LPUART_MODIR_TNP(value)))
#define LPUART_BWR_MODIR_TNP(base, value) (BME_BFI32(&LPUART_MODIR_REG(base), ((uint32_t)(value) << LPUART_MODIR_TNP_SHIFT), LPUART_MODIR_TNP_SHIFT, LPUART_MODIR_TNP_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_MODIR, field IREN[18] (RW)
 *
 * Enables/disables the infrared modulation/demodulation.
 *
 * Values:
 * - 0b0 - IR disabled.
 * - 0b1 - IR enabled.
 */
/*@{*/
/*! @brief Read current value of the LPUART_MODIR_IREN field. */
#define LPUART_RD_MODIR_IREN(base) ((LPUART_MODIR_REG(base) & LPUART_MODIR_IREN_MASK) >> LPUART_MODIR_IREN_SHIFT)
#define LPUART_BRD_MODIR_IREN(base) (BME_UBFX32(&LPUART_MODIR_REG(base), LPUART_MODIR_IREN_SHIFT, LPUART_MODIR_IREN_WIDTH))

/*! @brief Set the IREN field to a new value. */
#define LPUART_WR_MODIR_IREN(base, value) (LPUART_RMW_MODIR(base, LPUART_MODIR_IREN_MASK, LPUART_MODIR_IREN(value)))
#define LPUART_BWR_MODIR_IREN(base, value) (BME_BFI32(&LPUART_MODIR_REG(base), ((uint32_t)(value) << LPUART_MODIR_IREN_SHIFT), LPUART_MODIR_IREN_SHIFT, LPUART_MODIR_IREN_WIDTH))
/*@}*/

/*******************************************************************************
 * LPUART_FIFO - LPUART FIFO Register
 ******************************************************************************/

/*!
 * @brief LPUART_FIFO - LPUART FIFO Register (RW)
 *
 * Reset value: 0x00000022U
 *
 * This register provides the ability for the programmer to turn on and off FIFO
 * functionality. It also provides the size of the FIFO that has been
 * implemented. This register may be read at any time. This register must be written only
 * when CTRL[RE] and CTRL[TE] are cleared/not set and when the data buffer/FIFO is
 * empty.
 */
/*!
 * @name Constants and macros for entire LPUART_FIFO register
 */
/*@{*/
#define LPUART_RD_FIFO(base)     (LPUART_FIFO_REG(base))
#define LPUART_WR_FIFO(base, value) (LPUART_FIFO_REG(base) = (value))
#define LPUART_RMW_FIFO(base, mask, value) (LPUART_WR_FIFO(base, (LPUART_RD_FIFO(base) & ~(mask)) | (value)))
#define LPUART_SET_FIFO(base, value) (BME_OR32(&LPUART_FIFO_REG(base), (uint32_t)(value)))
#define LPUART_CLR_FIFO(base, value) (BME_AND32(&LPUART_FIFO_REG(base), (uint32_t)(~(value))))
#define LPUART_TOG_FIFO(base, value) (BME_XOR32(&LPUART_FIFO_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPUART_FIFO bitfields
 */

/*!
 * @name Register LPUART_FIFO, field RXFIFOSIZE[2:0] (RO)
 *
 * The maximum number of receive datawords that can be stored in the receive
 * buffer before an overrun occurs. This field is read only.
 *
 * Values:
 * - 0b000 - Receive FIFO/Buffer depth = 1 dataword.
 * - 0b001 - Receive FIFO/Buffer depth = 4 datawords.
 * - 0b010 - Receive FIFO/Buffer depth = 8 datawords.
 * - 0b011 - Receive FIFO/Buffer depth = 16 datawords.
 * - 0b100 - Receive FIFO/Buffer depth = 32 datawords.
 * - 0b101 - Receive FIFO/Buffer depth = 64 datawords.
 * - 0b110 - Receive FIFO/Buffer depth = 128 datawords.
 * - 0b111 - Receive FIFO/Buffer depth = 256 datawords.
 */
/*@{*/
/*! @brief Read current value of the LPUART_FIFO_RXFIFOSIZE field. */
#define LPUART_RD_FIFO_RXFIFOSIZE(base) ((LPUART_FIFO_REG(base) & LPUART_FIFO_RXFIFOSIZE_MASK) >> LPUART_FIFO_RXFIFOSIZE_SHIFT)
#define LPUART_BRD_FIFO_RXFIFOSIZE(base) (BME_UBFX32(&LPUART_FIFO_REG(base), LPUART_FIFO_RXFIFOSIZE_SHIFT, LPUART_FIFO_RXFIFOSIZE_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_FIFO, field RXFE[3] (RW)
 *
 * When this field is set, the built in FIFO structure for the receive buffer is
 * enabled. The size of the FIFO structure is indicated by the RXFIFOSIZE field.
 * If this field is not set, the receive buffer operates as a FIFO of depth one
 * dataword regardless of the value in RXFIFOSIZE. Both CTRL[TE] and CTRL[RE]
 * must be cleared prior to changing this field.
 *
 * Values:
 * - 0b0 - Receive FIFO is not enabled. Buffer is depth 1. (Legacy support)
 * - 0b1 - Receive FIFO is enabled. Buffer is depth indicted by RXFIFOSIZE.
 */
/*@{*/
/*! @brief Read current value of the LPUART_FIFO_RXFE field. */
#define LPUART_RD_FIFO_RXFE(base) ((LPUART_FIFO_REG(base) & LPUART_FIFO_RXFE_MASK) >> LPUART_FIFO_RXFE_SHIFT)
#define LPUART_BRD_FIFO_RXFE(base) (BME_UBFX32(&LPUART_FIFO_REG(base), LPUART_FIFO_RXFE_SHIFT, LPUART_FIFO_RXFE_WIDTH))

/*! @brief Set the RXFE field to a new value. */
#define LPUART_WR_FIFO_RXFE(base, value) (LPUART_RMW_FIFO(base, (LPUART_FIFO_RXFE_MASK | LPUART_FIFO_RXUF_MASK | LPUART_FIFO_TXOF_MASK), LPUART_FIFO_RXFE(value)))
#define LPUART_BWR_FIFO_RXFE(base, value) (BME_BFI32(&LPUART_FIFO_REG(base), ((uint32_t)(value) << LPUART_FIFO_RXFE_SHIFT), LPUART_FIFO_RXFE_SHIFT, LPUART_FIFO_RXFE_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_FIFO, field TXFIFOSIZE[6:4] (RO)
 *
 * The maximum number of transmit datawords that can be stored in the transmit
 * buffer. This field is read only.
 *
 * Values:
 * - 0b000 - Transmit FIFO/Buffer depth = 1 dataword.
 * - 0b001 - Transmit FIFO/Buffer depth = 4 datawords.
 * - 0b010 - Transmit FIFO/Buffer depth = 8 datawords.
 * - 0b011 - Transmit FIFO/Buffer depth = 16 datawords.
 * - 0b100 - Transmit FIFO/Buffer depth = 32 datawords.
 * - 0b101 - Transmit FIFO/Buffer depth = 64 datawords.
 * - 0b110 - Transmit FIFO/Buffer depth = 128 datawords.
 * - 0b111 - Transmit FIFO/Buffer depth = 256 datawords
 */
/*@{*/
/*! @brief Read current value of the LPUART_FIFO_TXFIFOSIZE field. */
#define LPUART_RD_FIFO_TXFIFOSIZE(base) ((LPUART_FIFO_REG(base) & LPUART_FIFO_TXFIFOSIZE_MASK) >> LPUART_FIFO_TXFIFOSIZE_SHIFT)
#define LPUART_BRD_FIFO_TXFIFOSIZE(base) (BME_UBFX32(&LPUART_FIFO_REG(base), LPUART_FIFO_TXFIFOSIZE_SHIFT, LPUART_FIFO_TXFIFOSIZE_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_FIFO, field TXFE[7] (RW)
 *
 * When this field is set, the built in FIFO structure for the transmit buffer
 * is enabled. The size of the FIFO structure is indicated by TXFIFOSIZE. If this
 * field is not set, the transmit buffer operates as a FIFO of depth one dataword
 * regardless of the value in TXFIFOSIZE. Both CTRL[TE] and CTRL[RE] must be
 * cleared prior to changing this field.
 *
 * Values:
 * - 0b0 - Transmit FIFO is not enabled. Buffer is depth 1. (Legacy support).
 * - 0b1 - Transmit FIFO is enabled. Buffer is depth indicated by TXFIFOSIZE.
 */
/*@{*/
/*! @brief Read current value of the LPUART_FIFO_TXFE field. */
#define LPUART_RD_FIFO_TXFE(base) ((LPUART_FIFO_REG(base) & LPUART_FIFO_TXFE_MASK) >> LPUART_FIFO_TXFE_SHIFT)
#define LPUART_BRD_FIFO_TXFE(base) (BME_UBFX32(&LPUART_FIFO_REG(base), LPUART_FIFO_TXFE_SHIFT, LPUART_FIFO_TXFE_WIDTH))

/*! @brief Set the TXFE field to a new value. */
#define LPUART_WR_FIFO_TXFE(base, value) (LPUART_RMW_FIFO(base, (LPUART_FIFO_TXFE_MASK | LPUART_FIFO_RXUF_MASK | LPUART_FIFO_TXOF_MASK), LPUART_FIFO_TXFE(value)))
#define LPUART_BWR_FIFO_TXFE(base, value) (BME_BFI32(&LPUART_FIFO_REG(base), ((uint32_t)(value) << LPUART_FIFO_TXFE_SHIFT), LPUART_FIFO_TXFE_SHIFT, LPUART_FIFO_TXFE_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_FIFO, field RXUFE[8] (RW)
 *
 * When this field is set, the RXUF flag generates an interrupt to the host.
 *
 * Values:
 * - 0b0 - RXUF flag does not generate an interrupt to the host.
 * - 0b1 - RXUF flag generates an interrupt to the host.
 */
/*@{*/
/*! @brief Read current value of the LPUART_FIFO_RXUFE field. */
#define LPUART_RD_FIFO_RXUFE(base) ((LPUART_FIFO_REG(base) & LPUART_FIFO_RXUFE_MASK) >> LPUART_FIFO_RXUFE_SHIFT)
#define LPUART_BRD_FIFO_RXUFE(base) (BME_UBFX32(&LPUART_FIFO_REG(base), LPUART_FIFO_RXUFE_SHIFT, LPUART_FIFO_RXUFE_WIDTH))

/*! @brief Set the RXUFE field to a new value. */
#define LPUART_WR_FIFO_RXUFE(base, value) (LPUART_RMW_FIFO(base, (LPUART_FIFO_RXUFE_MASK | LPUART_FIFO_RXUF_MASK | LPUART_FIFO_TXOF_MASK), LPUART_FIFO_RXUFE(value)))
#define LPUART_BWR_FIFO_RXUFE(base, value) (BME_BFI32(&LPUART_FIFO_REG(base), ((uint32_t)(value) << LPUART_FIFO_RXUFE_SHIFT), LPUART_FIFO_RXUFE_SHIFT, LPUART_FIFO_RXUFE_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_FIFO, field TXOFE[9] (RW)
 *
 * When this field is set, the TXOF flag generates an interrupt to the host.
 *
 * Values:
 * - 0b0 - TXOF flag does not generate an interrupt to the host.
 * - 0b1 - TXOF flag generates an interrupt to the host.
 */
/*@{*/
/*! @brief Read current value of the LPUART_FIFO_TXOFE field. */
#define LPUART_RD_FIFO_TXOFE(base) ((LPUART_FIFO_REG(base) & LPUART_FIFO_TXOFE_MASK) >> LPUART_FIFO_TXOFE_SHIFT)
#define LPUART_BRD_FIFO_TXOFE(base) (BME_UBFX32(&LPUART_FIFO_REG(base), LPUART_FIFO_TXOFE_SHIFT, LPUART_FIFO_TXOFE_WIDTH))

/*! @brief Set the TXOFE field to a new value. */
#define LPUART_WR_FIFO_TXOFE(base, value) (LPUART_RMW_FIFO(base, (LPUART_FIFO_TXOFE_MASK | LPUART_FIFO_RXUF_MASK | LPUART_FIFO_TXOF_MASK), LPUART_FIFO_TXOFE(value)))
#define LPUART_BWR_FIFO_TXOFE(base, value) (BME_BFI32(&LPUART_FIFO_REG(base), ((uint32_t)(value) << LPUART_FIFO_TXOFE_SHIFT), LPUART_FIFO_TXOFE_SHIFT, LPUART_FIFO_TXOFE_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_FIFO, field RXIDEN[12:10] (RW)
 *
 * When set, enables the assertion of RDRF when the receiver is idle for a
 * number of idle characters and the FIFO is not empty.
 *
 * Values:
 * - 0b000 - Disable RDRF assertion due to partially filled FIFO when receiver
 *     is idle.
 * - 0b001 - Enable RDRF assertion due to partially filled FIFO when receiver is
 *     idle for 1 character.
 * - 0b010 - Enable RDRF assertion due to partially filled FIFO when receiver is
 *     idle for 2 characters.
 * - 0b011 - Enable RDRF assertion due to partially filled FIFO when receiver is
 *     idle for 4 characters.
 * - 0b100 - Enable RDRF assertion due to partially filled FIFO when receiver is
 *     idle for 8 characters.
 * - 0b101 - Enable RDRF assertion due to partially filled FIFO when receiver is
 *     idle for 16 characters.
 * - 0b110 - Enable RDRF assertion due to partially filled FIFO when receiver is
 *     idle for 32 characters.
 * - 0b111 - Enable RDRF assertion due to partially filled FIFO when receiver is
 *     idle for 64 characters.
 */
/*@{*/
/*! @brief Read current value of the LPUART_FIFO_RXIDEN field. */
#define LPUART_RD_FIFO_RXIDEN(base) ((LPUART_FIFO_REG(base) & LPUART_FIFO_RXIDEN_MASK) >> LPUART_FIFO_RXIDEN_SHIFT)
#define LPUART_BRD_FIFO_RXIDEN(base) (BME_UBFX32(&LPUART_FIFO_REG(base), LPUART_FIFO_RXIDEN_SHIFT, LPUART_FIFO_RXIDEN_WIDTH))

/*! @brief Set the RXIDEN field to a new value. */
#define LPUART_WR_FIFO_RXIDEN(base, value) (LPUART_RMW_FIFO(base, (LPUART_FIFO_RXIDEN_MASK | LPUART_FIFO_RXUF_MASK | LPUART_FIFO_TXOF_MASK), LPUART_FIFO_RXIDEN(value)))
#define LPUART_BWR_FIFO_RXIDEN(base, value) (BME_BFI32(&LPUART_FIFO_REG(base), ((uint32_t)(value) << LPUART_FIFO_RXIDEN_SHIFT), LPUART_FIFO_RXIDEN_SHIFT, LPUART_FIFO_RXIDEN_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_FIFO, field RXFLUSH[14] (WORZ)
 *
 * Writing to this field causes all data that is stored in the receive
 * FIFO/buffer to be flushed. This does not affect data that is in the receive shift
 * register.
 *
 * Values:
 * - 0b0 - No flush operation occurs.
 * - 0b1 - All data in the receive FIFO/buffer is cleared out.
 */
/*@{*/
/*! @brief Set the RXFLUSH field to a new value. */
#define LPUART_WR_FIFO_RXFLUSH(base, value) (LPUART_RMW_FIFO(base, (LPUART_FIFO_RXFLUSH_MASK | LPUART_FIFO_RXUF_MASK | LPUART_FIFO_TXOF_MASK), LPUART_FIFO_RXFLUSH(value)))
#define LPUART_BWR_FIFO_RXFLUSH(base, value) (BME_BFI32(&LPUART_FIFO_REG(base), ((uint32_t)(value) << LPUART_FIFO_RXFLUSH_SHIFT), LPUART_FIFO_RXFLUSH_SHIFT, LPUART_FIFO_RXFLUSH_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_FIFO, field TXFLUSH[15] (WORZ)
 *
 * Writing to this field causes all data that is stored in the transmit
 * FIFO/buffer to be flushed. This does not affect data that is in the transmit shift
 * register.
 *
 * Values:
 * - 0b0 - No flush operation occurs.
 * - 0b1 - All data in the transmit FIFO/Buffer is cleared out.
 */
/*@{*/
/*! @brief Set the TXFLUSH field to a new value. */
#define LPUART_WR_FIFO_TXFLUSH(base, value) (LPUART_RMW_FIFO(base, (LPUART_FIFO_TXFLUSH_MASK | LPUART_FIFO_RXUF_MASK | LPUART_FIFO_TXOF_MASK), LPUART_FIFO_TXFLUSH(value)))
#define LPUART_BWR_FIFO_TXFLUSH(base, value) (BME_BFI32(&LPUART_FIFO_REG(base), ((uint32_t)(value) << LPUART_FIFO_TXFLUSH_SHIFT), LPUART_FIFO_TXFLUSH_SHIFT, LPUART_FIFO_TXFLUSH_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_FIFO, field RXUF[16] (W1C)
 *
 * Indicates that more data has been read from the receive buffer than was
 * present. This field will assert regardless of the value of RXUFE. However, an
 * interrupt will be issued to the host only if RXUFE is set. This flag is cleared by
 * writing a 1.
 *
 * Values:
 * - 0b0 - No receive buffer underflow has occurred since the last time the flag
 *     was cleared.
 * - 0b1 - At least one receive buffer underflow has occurred since the last
 *     time the flag was cleared.
 */
/*@{*/
/*! @brief Read current value of the LPUART_FIFO_RXUF field. */
#define LPUART_RD_FIFO_RXUF(base) ((LPUART_FIFO_REG(base) & LPUART_FIFO_RXUF_MASK) >> LPUART_FIFO_RXUF_SHIFT)
#define LPUART_BRD_FIFO_RXUF(base) (BME_UBFX32(&LPUART_FIFO_REG(base), LPUART_FIFO_RXUF_SHIFT, LPUART_FIFO_RXUF_WIDTH))

/*! @brief Set the RXUF field to a new value. */
#define LPUART_WR_FIFO_RXUF(base, value) (LPUART_RMW_FIFO(base, (LPUART_FIFO_RXUF_MASK | LPUART_FIFO_TXOF_MASK), LPUART_FIFO_RXUF(value)))
#define LPUART_BWR_FIFO_RXUF(base, value) (BME_BFI32(&LPUART_FIFO_REG(base), ((uint32_t)(value) << LPUART_FIFO_RXUF_SHIFT), LPUART_FIFO_RXUF_SHIFT, LPUART_FIFO_RXUF_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_FIFO, field TXOF[17] (W1C)
 *
 * Indicates that more data has been written to the transmit buffer than it can
 * hold. This field will assert regardless of the value of TXOFE. However, an
 * interrupt will be issued to the host only if TXOFE is set. This flag is cleared
 * by writing a 1.
 *
 * Values:
 * - 0b0 - No transmit buffer overflow has occurred since the last time the flag
 *     was cleared.
 * - 0b1 - At least one transmit buffer overflow has occurred since the last
 *     time the flag was cleared.
 */
/*@{*/
/*! @brief Read current value of the LPUART_FIFO_TXOF field. */
#define LPUART_RD_FIFO_TXOF(base) ((LPUART_FIFO_REG(base) & LPUART_FIFO_TXOF_MASK) >> LPUART_FIFO_TXOF_SHIFT)
#define LPUART_BRD_FIFO_TXOF(base) (BME_UBFX32(&LPUART_FIFO_REG(base), LPUART_FIFO_TXOF_SHIFT, LPUART_FIFO_TXOF_WIDTH))

/*! @brief Set the TXOF field to a new value. */
#define LPUART_WR_FIFO_TXOF(base, value) (LPUART_RMW_FIFO(base, (LPUART_FIFO_TXOF_MASK | LPUART_FIFO_RXUF_MASK), LPUART_FIFO_TXOF(value)))
#define LPUART_BWR_FIFO_TXOF(base, value) (BME_BFI32(&LPUART_FIFO_REG(base), ((uint32_t)(value) << LPUART_FIFO_TXOF_SHIFT), LPUART_FIFO_TXOF_SHIFT, LPUART_FIFO_TXOF_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_FIFO, field RXEMPT[22] (RO)
 *
 * Asserts when there is no data in the receive FIFO/Buffer. This field does not
 * take into account data that is in the receive shift register.
 *
 * Values:
 * - 0b0 - Receive buffer is not empty.
 * - 0b1 - Receive buffer is empty.
 */
/*@{*/
/*! @brief Read current value of the LPUART_FIFO_RXEMPT field. */
#define LPUART_RD_FIFO_RXEMPT(base) ((LPUART_FIFO_REG(base) & LPUART_FIFO_RXEMPT_MASK) >> LPUART_FIFO_RXEMPT_SHIFT)
#define LPUART_BRD_FIFO_RXEMPT(base) (BME_UBFX32(&LPUART_FIFO_REG(base), LPUART_FIFO_RXEMPT_SHIFT, LPUART_FIFO_RXEMPT_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_FIFO, field TXEMPT[23] (RO)
 *
 * Asserts when there is no data in the Transmit FIFO/buffer. This field does
 * not take into account data that is in the transmit shift register.
 *
 * Values:
 * - 0b0 - Transmit buffer is not empty.
 * - 0b1 - Transmit buffer is empty.
 */
/*@{*/
/*! @brief Read current value of the LPUART_FIFO_TXEMPT field. */
#define LPUART_RD_FIFO_TXEMPT(base) ((LPUART_FIFO_REG(base) & LPUART_FIFO_TXEMPT_MASK) >> LPUART_FIFO_TXEMPT_SHIFT)
#define LPUART_BRD_FIFO_TXEMPT(base) (BME_UBFX32(&LPUART_FIFO_REG(base), LPUART_FIFO_TXEMPT_SHIFT, LPUART_FIFO_TXEMPT_WIDTH))
/*@}*/

