RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*******************************************************************************
 * LPUART_WATER - LPUART Watermark Register
 ******************************************************************************/

/*!
 * @brief LPUART_WATER - LPUART Watermark Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register provides the ability to set a programmable threshold for
 * notification of needing additional transmit data. This register may be read at any
 * time but must be written only when CTRL[TE] is not set.
 */
/*!
 * @name Constants and macros for entire LPUART_WATER register
 */
/*@{*/
#define LPUART_RD_WATER(base)    (LPUART_WATER_REG(base))
#define LPUART_WR_WATER(base, value) (LPUART_WATER_REG(base) = (value))
#define LPUART_RMW_WATER(base, mask, value) (LPUART_WR_WATER(base, (LPUART_RD_WATER(base) & ~(mask)) | (value)))
#define LPUART_SET_WATER(base, value) (BME_OR32(&LPUART_WATER_REG(base), (uint32_t)(value)))
#define LPUART_CLR_WATER(base, value) (BME_AND32(&LPUART_WATER_REG(base), (uint32_t)(~(value))))
#define LPUART_TOG_WATER(base, value) (BME_XOR32(&LPUART_WATER_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPUART_WATER bitfields
 */

/*!
 * @name Register LPUART_WATER, field TXWATER[7:0] (RW)
 *
 * When the number of datawords in the transmit FIFO/buffer is equal to or less
 * than the value in this register field, an interrupt or a DMA request is
 * generated. For proper operation, the value in TXWATER must be set to be less than
 * the size of the transmit buffer/FIFO size as indicated by FIFO[TXFIFOSIZE] and
 * FIFO[TXFE].
 */
/*@{*/
/*! @brief Read current value of the LPUART_WATER_TXWATER field. */
#define LPUART_RD_WATER_TXWATER(base) ((LPUART_WATER_REG(base) & LPUART_WATER_TXWATER_MASK) >> LPUART_WATER_TXWATER_SHIFT)
#define LPUART_BRD_WATER_TXWATER(base) (BME_UBFX32(&LPUART_WATER_REG(base), LPUART_WATER_TXWATER_SHIFT, LPUART_WATER_TXWATER_WIDTH))

/*! @brief Set the TXWATER field to a new value. */
#define LPUART_WR_WATER_TXWATER(base, value) (LPUART_RMW_WATER(base, LPUART_WATER_TXWATER_MASK, LPUART_WATER_TXWATER(value)))
#define LPUART_BWR_WATER_TXWATER(base, value) (BME_BFI32(&LPUART_WATER_REG(base), ((uint32_t)(value) << LPUART_WATER_TXWATER_SHIFT), LPUART_WATER_TXWATER_SHIFT, LPUART_WATER_TXWATER_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_WATER, field TXCOUNT[15:8] (RO)
 *
 * The value in this register indicates the number of datawords that are in the
 * transmit FIFO/buffer. If a dataword is being transmitted, that is, in the
 * transmit shift register, it is not included in the count. This value may be used
 * in conjunction with FIFO[TXFIFOSIZE] to calculate how much room is left in the
 * transmit FIFO/buffer.
 */
/*@{*/
/*! @brief Read current value of the LPUART_WATER_TXCOUNT field. */
#define LPUART_RD_WATER_TXCOUNT(base) ((LPUART_WATER_REG(base) & LPUART_WATER_TXCOUNT_MASK) >> LPUART_WATER_TXCOUNT_SHIFT)
#define LPUART_BRD_WATER_TXCOUNT(base) (BME_UBFX32(&LPUART_WATER_REG(base), LPUART_WATER_TXCOUNT_SHIFT, LPUART_WATER_TXCOUNT_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_WATER, field RXWATER[23:16] (RW)
 *
 * When the number of datawords in the receive FIFO/buffer is equal to or
 * greater than the value in this register field, an interrupt or a DMA request is
 * generated. For proper operation, the value in RXWATER must be set to be less than
 * the receive FIFO/buffer size as indicated by FIFO[RXFIFOSIZE] and FIFO[RXFE]
 * and must be greater than 0.
 */
/*@{*/
/*! @brief Read current value of the LPUART_WATER_RXWATER field. */
#define LPUART_RD_WATER_RXWATER(base) ((LPUART_WATER_REG(base) & LPUART_WATER_RXWATER_MASK) >> LPUART_WATER_RXWATER_SHIFT)
#define LPUART_BRD_WATER_RXWATER(base) (BME_UBFX32(&LPUART_WATER_REG(base), LPUART_WATER_RXWATER_SHIFT, LPUART_WATER_RXWATER_WIDTH))

/*! @brief Set the RXWATER field to a new value. */
#define LPUART_WR_WATER_RXWATER(base, value) (LPUART_RMW_WATER(base, LPUART_WATER_RXWATER_MASK, LPUART_WATER_RXWATER(value)))
#define LPUART_BWR_WATER_RXWATER(base, value) (BME_BFI32(&LPUART_WATER_REG(base), ((uint32_t)(value) << LPUART_WATER_RXWATER_SHIFT), LPUART_WATER_RXWATER_SHIFT, LPUART_WATER_RXWATER_WIDTH))
/*@}*/

/*!
 * @name Register LPUART_WATER, field RXCOUNT[31:24] (RO)
 *
 * The value in this register indicates the number of datawords that are in the
 * receive FIFO/buffer. If a dataword is being received, that is, in the receive
 * shift register, it is not included in the count. This value may be used in
 * conjunction with FIFO[RXFIFOSIZE] to calculate how much room is left in the
 * receive FIFO/buffer.
 */
/*@{*/
/*! @brief Read current value of the LPUART_WATER_RXCOUNT field. */
#define LPUART_RD_WATER_RXCOUNT(base) ((LPUART_WATER_REG(base) & LPUART_WATER_RXCOUNT_MASK) >> LPUART_WATER_RXCOUNT_SHIFT)
#define LPUART_BRD_WATER_RXCOUNT(base) (BME_UBFX32(&LPUART_WATER_REG(base), LPUART_WATER_RXCOUNT_SHIFT, LPUART_WATER_RXCOUNT_WIDTH))
/*@}*/

/*
 * MK80F25615 MCG
 *
 * Multipurpose Clock Generator module
 *
 * Registers defined in this header file:
 * - MCG_C1 - MCG Control 1 Register
 * - MCG_C2 - MCG Control 2 Register
 * - MCG_C3 - MCG Control 3 Register
 * - MCG_C4 - MCG Control 4 Register
 * - MCG_C5 - MCG Control 5 Register
 * - MCG_C6 - MCG Control 6 Register
 * - MCG_S - MCG Status Register
 * - MCG_SC - MCG Status and Control Register
 * - MCG_ATCVH - MCG Auto Trim Compare Value High Register
 * - MCG_ATCVL - MCG Auto Trim Compare Value Low Register
 * - MCG_C7 - MCG Control 7 Register
 * - MCG_C8 - MCG Control 8 Register
 */

#define MCG_INSTANCE_COUNT (1U) /*!< Number of instances of the MCG module. */
#define MCG_IDX (0U) /*!< Instance number for MCG. */

/*******************************************************************************
 * MCG_C1 - MCG Control 1 Register
 ******************************************************************************/

/*!
 * @brief MCG_C1 - MCG Control 1 Register (RW)
 *
 * Reset value: 0x04U
 */
/*!
 * @name Constants and macros for entire MCG_C1 register
 */
/*@{*/
#define MCG_RD_C1(base)          (MCG_C1_REG(base))
#define MCG_WR_C1(base, value)   (MCG_C1_REG(base) = (value))
#define MCG_RMW_C1(base, mask, value) (MCG_WR_C1(base, (MCG_RD_C1(base) & ~(mask)) | (value)))
#define MCG_SET_C1(base, value)  (BME_OR8(&MCG_C1_REG(base), (uint8_t)(value)))
#define MCG_CLR_C1(base, value)  (BME_AND8(&MCG_C1_REG(base), (uint8_t)(~(value))))
#define MCG_TOG_C1(base, value)  (BME_XOR8(&MCG_C1_REG(base), (uint8_t)(value)))
/*@}*/

