RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*
 * MK80F25615 QuadSPI
 *
 * QuadSPI
 *
 * Registers defined in this header file:
 * - QuadSPI_MCR - Module Configuration Register
 * - QuadSPI_IPCR - IP Configuration Register
 * - QuadSPI_FLSHCR - Flash Configuration Register
 * - QuadSPI_BUF0CR - Buffer0 Configuration Register
 * - QuadSPI_BUF1CR - Buffer1 Configuration Register
 * - QuadSPI_BUF2CR - Buffer2 Configuration Register
 * - QuadSPI_BUF3CR - Buffer3 Configuration Register
 * - QuadSPI_BFGENCR - Buffer Generic Configuration Register
 * - QuadSPI_SOCCR - SOC Configuration Register
 * - QuadSPI_BUF0IND - Buffer0 Top Index Register
 * - QuadSPI_BUF1IND - Buffer1 Top Index Register
 * - QuadSPI_BUF2IND - Buffer2 Top Index Register
 * - QuadSPI_SFAR - Serial Flash Address Register
 * - QuadSPI_SFACR - Serial Flash Address Configuration Register
 * - QuadSPI_SMPR - Sampling Register
 * - QuadSPI_RBSR - RX Buffer Status Register
 * - QuadSPI_RBCT - RX Buffer Control Register
 * - QuadSPI_TBSR - TX Buffer Status Register
 * - QuadSPI_TBDR - TX Buffer Data Register
 * - QuadSPI_TBCT - Tx Buffer Control Register
 * - QuadSPI_SR - Status Register
 * - QuadSPI_FR - Flag Register
 * - QuadSPI_RSER - Interrupt and DMA Request Select and Enable Register
 * - QuadSPI_SPNDST - Sequence Suspend Status Register
 * - QuadSPI_SPTRCLR - Sequence Pointer Clear Register
 * - QuadSPI_SFA1AD - Serial Flash A1 Top Address
 * - QuadSPI_SFA2AD - Serial Flash A2 Top Address
 * - QuadSPI_SFB1AD - Serial Flash B1Top Address
 * - QuadSPI_SFB2AD - Serial Flash B2Top Address
 * - QuadSPI_DLPR - Data Learn Pattern Register
 * - QuadSPI_RBDR - RX Buffer Data Register
 * - QuadSPI_LUTKEY - LUT Key Register
 * - QuadSPI_LCKCR - LUT Lock Configuration Register
 * - QuadSPI_LUT - Look-up Table register
 */

#define QuadSPI_INSTANCE_COUNT (1U) /*!< Number of instances of the QuadSPI module. */
#define QuadSPI0_IDX (0U) /*!< Instance number for QuadSPI0. */

/*******************************************************************************
 * QuadSPI_MCR - Module Configuration Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_MCR - Module Configuration Register (RW)
 *
 * Reset value: 0x000F400CU
 *
 * The QuadSPI_MCR holds configuration data associated with QuadSPI operation.
 * Write: All other fields: Anytime
 */
/*!
 * @name Constants and macros for entire QuadSPI_MCR register
 */
/*@{*/
#define QuadSPI_RD_MCR(base)     (QuadSPI_MCR_REG(base))
#define QuadSPI_WR_MCR(base, value) (QuadSPI_MCR_REG(base) = (value))
#define QuadSPI_RMW_MCR(base, mask, value) (QuadSPI_WR_MCR(base, (QuadSPI_RD_MCR(base) & ~(mask)) | (value)))
#define QuadSPI_SET_MCR(base, value) (BME_OR32(&QuadSPI_MCR_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_MCR(base, value) (BME_AND32(&QuadSPI_MCR_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_MCR(base, value) (BME_XOR32(&QuadSPI_MCR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_MCR bitfields
 */

/*!
 * @name Register QuadSPI_MCR, field SWRSTSD[0] (RW)
 *
 * Software reset for Serial Flash domain
 *
 * Values:
 * - 0b0 - No action
 * - 0b1 - Serial Flash domain flops are reset. Does not reset configuration
 *     registers. It is advisable to reset both the serial flash domain and AHB
 *     domain at the same time. Resetting only one domain might lead to side effects.
 *     The software resets need the clock to be running to propagate to the
 *     design. The MCR[MDIS] should therefore be set to 0 when the software reset
 *     bits are asserted. Also, before they can be deasserted again (by setting
 *     MCR[SWRSTSD] to 0), it is recommended to set the MCR[MDIS] bit to 1. Once the
 *     software resets have been deasserted, the normal operation can be started
 *     by setting the MCR[MDIS] bit to 0.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_MCR_SWRSTSD field. */
#define QuadSPI_RD_MCR_SWRSTSD(base) ((QuadSPI_MCR_REG(base) & QuadSPI_MCR_SWRSTSD_MASK) >> QuadSPI_MCR_SWRSTSD_SHIFT)
#define QuadSPI_BRD_MCR_SWRSTSD(base) (BME_UBFX32(&QuadSPI_MCR_REG(base), QuadSPI_MCR_SWRSTSD_SHIFT, QuadSPI_MCR_SWRSTSD_WIDTH))

/*! @brief Set the SWRSTSD field to a new value. */
#define QuadSPI_WR_MCR_SWRSTSD(base, value) (QuadSPI_RMW_MCR(base, QuadSPI_MCR_SWRSTSD_MASK, QuadSPI_MCR_SWRSTSD(value)))
#define QuadSPI_BWR_MCR_SWRSTSD(base, value) (BME_BFI32(&QuadSPI_MCR_REG(base), ((uint32_t)(value) << QuadSPI_MCR_SWRSTSD_SHIFT), QuadSPI_MCR_SWRSTSD_SHIFT, QuadSPI_MCR_SWRSTSD_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_MCR, field SWRSTHD[1] (RW)
 *
 * Software reset for AHB domain
 *
 * Values:
 * - 0b0 - No action
 * - 0b1 - AHB domain flops are reset. Does not reset configuration registers.
 *     It is advisable to reset both the serial flash domain and AHB domain at the
 *     same time. Resetting only one domain might lead to side effects. The
 *     software resets need the clock to be running to propagate to the design. The
 *     MCR[MDIS] should therefore be set to 0 when the software reset bits are
 *     asserted. Also, before they can be deasserted again (by setting MCR[SWRSTHD]
 *     to 0), it is recommended to set the MCR[MDIS] bit to 1. Once the software
 *     resets have been deasserted, the normal operation can be started by
 *     setting the MCR[MDIS] bit to 0.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_MCR_SWRSTHD field. */
#define QuadSPI_RD_MCR_SWRSTHD(base) ((QuadSPI_MCR_REG(base) & QuadSPI_MCR_SWRSTHD_MASK) >> QuadSPI_MCR_SWRSTHD_SHIFT)
#define QuadSPI_BRD_MCR_SWRSTHD(base) (BME_UBFX32(&QuadSPI_MCR_REG(base), QuadSPI_MCR_SWRSTHD_SHIFT, QuadSPI_MCR_SWRSTHD_WIDTH))

/*! @brief Set the SWRSTHD field to a new value. */
#define QuadSPI_WR_MCR_SWRSTHD(base, value) (QuadSPI_RMW_MCR(base, QuadSPI_MCR_SWRSTHD_MASK, QuadSPI_MCR_SWRSTHD(value)))
#define QuadSPI_BWR_MCR_SWRSTHD(base, value) (BME_BFI32(&QuadSPI_MCR_REG(base), ((uint32_t)(value) << QuadSPI_MCR_SWRSTHD_SHIFT), QuadSPI_MCR_SWRSTHD_SHIFT, QuadSPI_MCR_SWRSTHD_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_MCR, field END_CFG[3:2] (RW)
 *
 * Defines the endianness of the QSPI module.For more details refer to Byte
 * Ordering Endianess
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_MCR_END_CFG field. */
#define QuadSPI_RD_MCR_END_CFG(base) ((QuadSPI_MCR_REG(base) & QuadSPI_MCR_END_CFG_MASK) >> QuadSPI_MCR_END_CFG_SHIFT)
#define QuadSPI_BRD_MCR_END_CFG(base) (BME_UBFX32(&QuadSPI_MCR_REG(base), QuadSPI_MCR_END_CFG_SHIFT, QuadSPI_MCR_END_CFG_WIDTH))

