RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*
 * Constants & macros for individual QuadSPI_BUF1CR bitfields
 */

/*!
 * @name Register QuadSPI_BUF1CR, field MSTRID[3:0] (RW)
 *
 * Master ID: The ID of the AHB master associated with BUFFER1. Any AHB access
 * with this master port number is routed to this buffer.It must be ensured that
 * the master id's associated with all buffers must be different.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_BUF1CR_MSTRID field. */
#define QuadSPI_RD_BUF1CR_MSTRID(base) ((QuadSPI_BUF1CR_REG(base) & QuadSPI_BUF1CR_MSTRID_MASK) >> QuadSPI_BUF1CR_MSTRID_SHIFT)
#define QuadSPI_BRD_BUF1CR_MSTRID(base) (BME_UBFX32(&QuadSPI_BUF1CR_REG(base), QuadSPI_BUF1CR_MSTRID_SHIFT, QuadSPI_BUF1CR_MSTRID_WIDTH))

/*! @brief Set the MSTRID field to a new value. */
#define QuadSPI_WR_BUF1CR_MSTRID(base, value) (QuadSPI_RMW_BUF1CR(base, QuadSPI_BUF1CR_MSTRID_MASK, QuadSPI_BUF1CR_MSTRID(value)))
#define QuadSPI_BWR_BUF1CR_MSTRID(base, value) (BME_BFI32(&QuadSPI_BUF1CR_REG(base), ((uint32_t)(value) << QuadSPI_BUF1CR_MSTRID_SHIFT), QuadSPI_BUF1CR_MSTRID_SHIFT, QuadSPI_BUF1CR_MSTRID_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_BUF1CR, field ADATSZ[14:8] (RW)
 *
 * Defines the data transfer size in 8 bytes of an AHB triggered access to
 * serial flash.For example, a value of 0x2 will set transfer size to 16bytes. When
 * ADATSZ = 0, the data size mentioned the sequence pointed to by the SEQID field
 * overrides this value.SW should ensure that this transfer size is not greater
 * than the size of this buffer.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_BUF1CR_ADATSZ field. */
#define QuadSPI_RD_BUF1CR_ADATSZ(base) ((QuadSPI_BUF1CR_REG(base) & QuadSPI_BUF1CR_ADATSZ_MASK) >> QuadSPI_BUF1CR_ADATSZ_SHIFT)
#define QuadSPI_BRD_BUF1CR_ADATSZ(base) (BME_UBFX32(&QuadSPI_BUF1CR_REG(base), QuadSPI_BUF1CR_ADATSZ_SHIFT, QuadSPI_BUF1CR_ADATSZ_WIDTH))

/*! @brief Set the ADATSZ field to a new value. */
#define QuadSPI_WR_BUF1CR_ADATSZ(base, value) (QuadSPI_RMW_BUF1CR(base, QuadSPI_BUF1CR_ADATSZ_MASK, QuadSPI_BUF1CR_ADATSZ(value)))
#define QuadSPI_BWR_BUF1CR_ADATSZ(base, value) (BME_BFI32(&QuadSPI_BUF1CR_REG(base), ((uint32_t)(value) << QuadSPI_BUF1CR_ADATSZ_SHIFT), QuadSPI_BUF1CR_ADATSZ_SHIFT, QuadSPI_BUF1CR_ADATSZ_WIDTH))
/*@}*/

/*******************************************************************************
 * QuadSPI_BUF2CR - Buffer2 Configuration Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_BUF2CR - Buffer2 Configuration Register (RW)
 *
 * Reset value: 0x00000004U
 *
 * This register provides the configuration for any access to buffer2. An access
 * is routed to buffer2 when the master port number of the incoming AHB request
 * matches the MSTRID field of the BUF2CR. Any buffer "miss" leads to the buffer
 * being flushed and a serial flash transaction being triggered as per the
 * sequence pointed to by the SEQID field. Write: QSPI_SR[AHB_ACC] = 0
 */
/*!
 * @name Constants and macros for entire QuadSPI_BUF2CR register
 */
/*@{*/
#define QuadSPI_RD_BUF2CR(base)  (QuadSPI_BUF2CR_REG(base))
#define QuadSPI_WR_BUF2CR(base, value) (QuadSPI_BUF2CR_REG(base) = (value))
#define QuadSPI_RMW_BUF2CR(base, mask, value) (QuadSPI_WR_BUF2CR(base, (QuadSPI_RD_BUF2CR(base) & ~(mask)) | (value)))
#define QuadSPI_SET_BUF2CR(base, value) (BME_OR32(&QuadSPI_BUF2CR_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_BUF2CR(base, value) (BME_AND32(&QuadSPI_BUF2CR_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_BUF2CR(base, value) (BME_XOR32(&QuadSPI_BUF2CR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_BUF2CR bitfields
 */

/*!
 * @name Register QuadSPI_BUF2CR, field MSTRID[3:0] (RW)
 *
 * Master ID: The ID of the AHB master associated with BUFFER2. Any AHB access
 * with this master port number is routed to this buffer.It must be ensured that
 * the master id's associated with all buffers must be different.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_BUF2CR_MSTRID field. */
#define QuadSPI_RD_BUF2CR_MSTRID(base) ((QuadSPI_BUF2CR_REG(base) & QuadSPI_BUF2CR_MSTRID_MASK) >> QuadSPI_BUF2CR_MSTRID_SHIFT)
#define QuadSPI_BRD_BUF2CR_MSTRID(base) (BME_UBFX32(&QuadSPI_BUF2CR_REG(base), QuadSPI_BUF2CR_MSTRID_SHIFT, QuadSPI_BUF2CR_MSTRID_WIDTH))

/*! @brief Set the MSTRID field to a new value. */
#define QuadSPI_WR_BUF2CR_MSTRID(base, value) (QuadSPI_RMW_BUF2CR(base, QuadSPI_BUF2CR_MSTRID_MASK, QuadSPI_BUF2CR_MSTRID(value)))
#define QuadSPI_BWR_BUF2CR_MSTRID(base, value) (BME_BFI32(&QuadSPI_BUF2CR_REG(base), ((uint32_t)(value) << QuadSPI_BUF2CR_MSTRID_SHIFT), QuadSPI_BUF2CR_MSTRID_SHIFT, QuadSPI_BUF2CR_MSTRID_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_BUF2CR, field ADATSZ[14:8] (RW)
 *
 * Defines the data transfer size in 8 Bytes of an AHB triggered access to
 * serial flash. For example, a value of 0x2 will set transfer size to 16bytes.When
 * ADATSZ = 0, the data size mentioned the sequence pointed to by the SEQID field
 * overrides this value.SW should ensure that this transfer size is not greater
 * than the size of this buffer.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_BUF2CR_ADATSZ field. */
#define QuadSPI_RD_BUF2CR_ADATSZ(base) ((QuadSPI_BUF2CR_REG(base) & QuadSPI_BUF2CR_ADATSZ_MASK) >> QuadSPI_BUF2CR_ADATSZ_SHIFT)
#define QuadSPI_BRD_BUF2CR_ADATSZ(base) (BME_UBFX32(&QuadSPI_BUF2CR_REG(base), QuadSPI_BUF2CR_ADATSZ_SHIFT, QuadSPI_BUF2CR_ADATSZ_WIDTH))

/*! @brief Set the ADATSZ field to a new value. */
#define QuadSPI_WR_BUF2CR_ADATSZ(base, value) (QuadSPI_RMW_BUF2CR(base, QuadSPI_BUF2CR_ADATSZ_MASK, QuadSPI_BUF2CR_ADATSZ(value)))
#define QuadSPI_BWR_BUF2CR_ADATSZ(base, value) (BME_BFI32(&QuadSPI_BUF2CR_REG(base), ((uint32_t)(value) << QuadSPI_BUF2CR_ADATSZ_SHIFT), QuadSPI_BUF2CR_ADATSZ_SHIFT, QuadSPI_BUF2CR_ADATSZ_WIDTH))
/*@}*/

/*******************************************************************************
 * QuadSPI_BUF3CR - Buffer3 Configuration Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_BUF3CR - Buffer3 Configuration Register (RW)
 *
 * Reset value: 0x80000000U
 *
 * This register provides the configuration for any access to buffer3. An access
 * is routed to buffer3 when the master port number of the incoming AHB request
 * matches the MSTRID field of the BUF3CR. Any buffer "miss" leads to the buffer
 * being flushed a serial flash transaction being triggered as per the sequence
 * pointed to by the SEQID field. In the case that the ALLMST field is not set,
 * any such transaction (where master port number does not match any of the MSTRID
 * fields) will be returned an ERROR response. Write: QSPI_SR[AHB_ACC] = 0
 */
/*!
 * @name Constants and macros for entire QuadSPI_BUF3CR register
 */
/*@{*/
#define QuadSPI_RD_BUF3CR(base)  (QuadSPI_BUF3CR_REG(base))
#define QuadSPI_WR_BUF3CR(base, value) (QuadSPI_BUF3CR_REG(base) = (value))
#define QuadSPI_RMW_BUF3CR(base, mask, value) (QuadSPI_WR_BUF3CR(base, (QuadSPI_RD_BUF3CR(base) & ~(mask)) | (value)))
#define QuadSPI_SET_BUF3CR(base, value) (BME_OR32(&QuadSPI_BUF3CR_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_BUF3CR(base, value) (BME_AND32(&QuadSPI_BUF3CR_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_BUF3CR(base, value) (BME_XOR32(&QuadSPI_BUF3CR_REG(base), (uint32_t)(value)))
/*@}*/

