RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*
 * Constants & macros for individual QuadSPI_BUF3CR bitfields
 */

/*!
 * @name Register QuadSPI_BUF3CR, field MSTRID[3:0] (RW)
 *
 * Master ID: The ID of the AHB master associated with BUFFER3. Any AHB access
 * with this master port number is routed to this buffer. It must be ensured that
 * the master id's associated with all buffers must be different.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_BUF3CR_MSTRID field. */
#define QuadSPI_RD_BUF3CR_MSTRID(base) ((QuadSPI_BUF3CR_REG(base) & QuadSPI_BUF3CR_MSTRID_MASK) >> QuadSPI_BUF3CR_MSTRID_SHIFT)
#define QuadSPI_BRD_BUF3CR_MSTRID(base) (BME_UBFX32(&QuadSPI_BUF3CR_REG(base), QuadSPI_BUF3CR_MSTRID_SHIFT, QuadSPI_BUF3CR_MSTRID_WIDTH))

/*! @brief Set the MSTRID field to a new value. */
#define QuadSPI_WR_BUF3CR_MSTRID(base, value) (QuadSPI_RMW_BUF3CR(base, QuadSPI_BUF3CR_MSTRID_MASK, QuadSPI_BUF3CR_MSTRID(value)))
#define QuadSPI_BWR_BUF3CR_MSTRID(base, value) (BME_BFI32(&QuadSPI_BUF3CR_REG(base), ((uint32_t)(value) << QuadSPI_BUF3CR_MSTRID_SHIFT), QuadSPI_BUF3CR_MSTRID_SHIFT, QuadSPI_BUF3CR_MSTRID_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_BUF3CR, field ADATSZ[14:8] (RW)
 *
 * Defines the data transfer size in 8 Bytes of an AHB triggered access to
 * serial flash. When ADATSZ = 0, the data size mentioned the sequence pointed to by
 * the SEQID field overrides this value. SW should ensure that this transfer size
 * is not greater than the size of this buffer.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_BUF3CR_ADATSZ field. */
#define QuadSPI_RD_BUF3CR_ADATSZ(base) ((QuadSPI_BUF3CR_REG(base) & QuadSPI_BUF3CR_ADATSZ_MASK) >> QuadSPI_BUF3CR_ADATSZ_SHIFT)
#define QuadSPI_BRD_BUF3CR_ADATSZ(base) (BME_UBFX32(&QuadSPI_BUF3CR_REG(base), QuadSPI_BUF3CR_ADATSZ_SHIFT, QuadSPI_BUF3CR_ADATSZ_WIDTH))

/*! @brief Set the ADATSZ field to a new value. */
#define QuadSPI_WR_BUF3CR_ADATSZ(base, value) (QuadSPI_RMW_BUF3CR(base, QuadSPI_BUF3CR_ADATSZ_MASK, QuadSPI_BUF3CR_ADATSZ(value)))
#define QuadSPI_BWR_BUF3CR_ADATSZ(base, value) (BME_BFI32(&QuadSPI_BUF3CR_REG(base), ((uint32_t)(value) << QuadSPI_BUF3CR_ADATSZ_SHIFT), QuadSPI_BUF3CR_ADATSZ_SHIFT, QuadSPI_BUF3CR_ADATSZ_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_BUF3CR, field ALLMST[31] (RW)
 *
 * All master enable: When set, buffer3 acts as an all-master buffer. Any AHB
 * access with a master port number not matching with the master ID of buffer0 or
 * buffer1 or buffer2 is routed to buffer3. When set, the MSTRID field of this
 * register is ignored.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_BUF3CR_ALLMST field. */
#define QuadSPI_RD_BUF3CR_ALLMST(base) ((QuadSPI_BUF3CR_REG(base) & QuadSPI_BUF3CR_ALLMST_MASK) >> QuadSPI_BUF3CR_ALLMST_SHIFT)
#define QuadSPI_BRD_BUF3CR_ALLMST(base) (BME_UBFX32(&QuadSPI_BUF3CR_REG(base), QuadSPI_BUF3CR_ALLMST_SHIFT, QuadSPI_BUF3CR_ALLMST_WIDTH))

/*! @brief Set the ALLMST field to a new value. */
#define QuadSPI_WR_BUF3CR_ALLMST(base, value) (QuadSPI_RMW_BUF3CR(base, QuadSPI_BUF3CR_ALLMST_MASK, QuadSPI_BUF3CR_ALLMST(value)))
#define QuadSPI_BWR_BUF3CR_ALLMST(base, value) (BME_BFI32(&QuadSPI_BUF3CR_REG(base), ((uint32_t)(value) << QuadSPI_BUF3CR_ALLMST_SHIFT), QuadSPI_BUF3CR_ALLMST_SHIFT, QuadSPI_BUF3CR_ALLMST_WIDTH))
/*@}*/

/*******************************************************************************
 * QuadSPI_BFGENCR - Buffer Generic Configuration Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_BFGENCR - Buffer Generic Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register provides the generic configuration to any of the buffer
 * accesses. Any buffer "miss" leads to the buffer being flushed and a serial flash
 * transaction being triggered as per the sequence pointed to by the SEQID field. If
 * the PAR_EN field is set, all the buffer accesses result in parallel accesses
 * to the flashes. Write: QSPI_SR[AHB_ACC] = 0
 */
/*!
 * @name Constants and macros for entire QuadSPI_BFGENCR register
 */
/*@{*/
#define QuadSPI_RD_BFGENCR(base) (QuadSPI_BFGENCR_REG(base))
#define QuadSPI_WR_BFGENCR(base, value) (QuadSPI_BFGENCR_REG(base) = (value))
#define QuadSPI_RMW_BFGENCR(base, mask, value) (QuadSPI_WR_BFGENCR(base, (QuadSPI_RD_BFGENCR(base) & ~(mask)) | (value)))
#define QuadSPI_SET_BFGENCR(base, value) (BME_OR32(&QuadSPI_BFGENCR_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_BFGENCR(base, value) (BME_AND32(&QuadSPI_BFGENCR_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_BFGENCR(base, value) (BME_XOR32(&QuadSPI_BFGENCR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_BFGENCR bitfields
 */

/*!
 * @name Register QuadSPI_BFGENCR, field SEQID[15:12] (RW)
 *
 * Points to a sequence in the Look-up-table. The SEQID defines the bits [6:2]
 * of the LUT index. The bits [1:0] are always assumed to be 0. Refer to Look-up
 * Table. If the sequence pointer differs between the new and previous sequence
 * then the user should reset this. See QSPI_SPTRCLR for more information.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_BFGENCR_SEQID field. */
#define QuadSPI_RD_BFGENCR_SEQID(base) ((QuadSPI_BFGENCR_REG(base) & QuadSPI_BFGENCR_SEQID_MASK) >> QuadSPI_BFGENCR_SEQID_SHIFT)
#define QuadSPI_BRD_BFGENCR_SEQID(base) (BME_UBFX32(&QuadSPI_BFGENCR_REG(base), QuadSPI_BFGENCR_SEQID_SHIFT, QuadSPI_BFGENCR_SEQID_WIDTH))

/*! @brief Set the SEQID field to a new value. */
#define QuadSPI_WR_BFGENCR_SEQID(base, value) (QuadSPI_RMW_BFGENCR(base, QuadSPI_BFGENCR_SEQID_MASK, QuadSPI_BFGENCR_SEQID(value)))
#define QuadSPI_BWR_BFGENCR_SEQID(base, value) (BME_BFI32(&QuadSPI_BFGENCR_REG(base), ((uint32_t)(value) << QuadSPI_BFGENCR_SEQID_SHIFT), QuadSPI_BFGENCR_SEQID_SHIFT, QuadSPI_BFGENCR_SEQID_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_BFGENCR, field PAR_EN[16] (RW)
 *
 * When set, a transaction to two serial flash devices is triggered in parallel
 * mode. Refer to Parallel Flash Mode for more details.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_BFGENCR_PAR_EN field. */
#define QuadSPI_RD_BFGENCR_PAR_EN(base) ((QuadSPI_BFGENCR_REG(base) & QuadSPI_BFGENCR_PAR_EN_MASK) >> QuadSPI_BFGENCR_PAR_EN_SHIFT)
#define QuadSPI_BRD_BFGENCR_PAR_EN(base) (BME_UBFX32(&QuadSPI_BFGENCR_REG(base), QuadSPI_BFGENCR_PAR_EN_SHIFT, QuadSPI_BFGENCR_PAR_EN_WIDTH))

/*! @brief Set the PAR_EN field to a new value. */
#define QuadSPI_WR_BFGENCR_PAR_EN(base, value) (QuadSPI_RMW_BFGENCR(base, QuadSPI_BFGENCR_PAR_EN_MASK, QuadSPI_BFGENCR_PAR_EN(value)))
#define QuadSPI_BWR_BFGENCR_PAR_EN(base, value) (BME_BFI32(&QuadSPI_BFGENCR_REG(base), ((uint32_t)(value) << QuadSPI_BFGENCR_PAR_EN_SHIFT), QuadSPI_BFGENCR_PAR_EN_SHIFT, QuadSPI_BFGENCR_PAR_EN_WIDTH))
/*@}*/

