RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*******************************************************************************
 * QuadSPI_SOCCR - SOC Configuration Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_SOCCR - SOC Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is programmed at chip level for QuadSPI delay chain
 * configuration. For details, refer to chip-specific QuadSPI information. Write:
 * QSPI_SR[AHB_ACC] = 0
 */
/*!
 * @name Constants and macros for entire QuadSPI_SOCCR register
 */
/*@{*/
#define QuadSPI_RD_SOCCR(base)   (QuadSPI_SOCCR_REG(base))
#define QuadSPI_WR_SOCCR(base, value) (QuadSPI_SOCCR_REG(base) = (value))
#define QuadSPI_RMW_SOCCR(base, mask, value) (QuadSPI_WR_SOCCR(base, (QuadSPI_RD_SOCCR(base) & ~(mask)) | (value)))
#define QuadSPI_SET_SOCCR(base, value) (BME_OR32(&QuadSPI_SOCCR_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_SOCCR(base, value) (BME_AND32(&QuadSPI_SOCCR_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_SOCCR(base, value) (BME_XOR32(&QuadSPI_SOCCR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_SOCCR bitfields
 */

/*!
 * @name Register QuadSPI_SOCCR, field QSPISRC[2:0] (RW)
 *
 * Values:
 * - 0b000 - Core/system clock
 * - 0b001 - MCGFLL clock
 * - 0b010 - MCGPLL clock
 * - 0b011 - MCGPLL 2x clock (DDR mode specific)
 * - 0b100 - IRC48M clock
 * - 0b101 - OSCERCLK clock
 * - 0b110 - MCGIRCLK clock
 * - 0b111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SOCCR_QSPISRC field. */
#define QuadSPI_RD_SOCCR_QSPISRC(base) ((QuadSPI_SOCCR_REG(base) & QuadSPI_SOCCR_QSPISRC_MASK) >> QuadSPI_SOCCR_QSPISRC_SHIFT)
#define QuadSPI_BRD_SOCCR_QSPISRC(base) (BME_UBFX32(&QuadSPI_SOCCR_REG(base), QuadSPI_SOCCR_QSPISRC_SHIFT, QuadSPI_SOCCR_QSPISRC_WIDTH))

/*! @brief Set the QSPISRC field to a new value. */
#define QuadSPI_WR_SOCCR_QSPISRC(base, value) (QuadSPI_RMW_SOCCR(base, QuadSPI_SOCCR_QSPISRC_MASK, QuadSPI_SOCCR_QSPISRC(value)))
#define QuadSPI_BWR_SOCCR_QSPISRC(base, value) (BME_BFI32(&QuadSPI_SOCCR_REG(base), ((uint32_t)(value) << QuadSPI_SOCCR_QSPISRC_SHIFT), QuadSPI_SOCCR_QSPISRC_SHIFT, QuadSPI_SOCCR_QSPISRC_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SOCCR, field DQSLPEN[8] (RW)
 *
 * Values:
 * - 0b0 - DQS loop back is disabled
 * - 0b1 - DQS loop back is enabled
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SOCCR_DQSLPEN field. */
#define QuadSPI_RD_SOCCR_DQSLPEN(base) ((QuadSPI_SOCCR_REG(base) & QuadSPI_SOCCR_DQSLPEN_MASK) >> QuadSPI_SOCCR_DQSLPEN_SHIFT)
#define QuadSPI_BRD_SOCCR_DQSLPEN(base) (BME_UBFX32(&QuadSPI_SOCCR_REG(base), QuadSPI_SOCCR_DQSLPEN_SHIFT, QuadSPI_SOCCR_DQSLPEN_WIDTH))

/*! @brief Set the DQSLPEN field to a new value. */
#define QuadSPI_WR_SOCCR_DQSLPEN(base, value) (QuadSPI_RMW_SOCCR(base, QuadSPI_SOCCR_DQSLPEN_MASK, QuadSPI_SOCCR_DQSLPEN(value)))
#define QuadSPI_BWR_SOCCR_DQSLPEN(base, value) (BME_BFI32(&QuadSPI_SOCCR_REG(base), ((uint32_t)(value) << QuadSPI_SOCCR_DQSLPEN_SHIFT), QuadSPI_SOCCR_DQSLPEN_SHIFT, QuadSPI_SOCCR_DQSLPEN_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SOCCR, field DQSPADLPEN[9] (RW)
 *
 * Values:
 * - 0b0 - DQS loop back from DQS pad is disabled
 * - 0b1 - DQS loop back from DQS pad is enabled
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SOCCR_DQSPADLPEN field. */
#define QuadSPI_RD_SOCCR_DQSPADLPEN(base) ((QuadSPI_SOCCR_REG(base) & QuadSPI_SOCCR_DQSPADLPEN_MASK) >> QuadSPI_SOCCR_DQSPADLPEN_SHIFT)
#define QuadSPI_BRD_SOCCR_DQSPADLPEN(base) (BME_UBFX32(&QuadSPI_SOCCR_REG(base), QuadSPI_SOCCR_DQSPADLPEN_SHIFT, QuadSPI_SOCCR_DQSPADLPEN_WIDTH))

/*! @brief Set the DQSPADLPEN field to a new value. */
#define QuadSPI_WR_SOCCR_DQSPADLPEN(base, value) (QuadSPI_RMW_SOCCR(base, QuadSPI_SOCCR_DQSPADLPEN_MASK, QuadSPI_SOCCR_DQSPADLPEN(value)))
#define QuadSPI_BWR_SOCCR_DQSPADLPEN(base, value) (BME_BFI32(&QuadSPI_SOCCR_REG(base), ((uint32_t)(value) << QuadSPI_SOCCR_DQSPADLPEN_SHIFT), QuadSPI_SOCCR_DQSPADLPEN_SHIFT, QuadSPI_SOCCR_DQSPADLPEN_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SOCCR, field DQSPHASEL[11:10] (RW)
 *
 * Values:
 * - 0b00 - No phase shift
 * - 0b01 - Select 45 degree phase shift
 * - 0b10 - Select 90 degree phase shift
 * - 0b11 - Select 135 degree phase shift
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SOCCR_DQSPHASEL field. */
#define QuadSPI_RD_SOCCR_DQSPHASEL(base) ((QuadSPI_SOCCR_REG(base) & QuadSPI_SOCCR_DQSPHASEL_MASK) >> QuadSPI_SOCCR_DQSPHASEL_SHIFT)
#define QuadSPI_BRD_SOCCR_DQSPHASEL(base) (BME_UBFX32(&QuadSPI_SOCCR_REG(base), QuadSPI_SOCCR_DQSPHASEL_SHIFT, QuadSPI_SOCCR_DQSPHASEL_WIDTH))

/*! @brief Set the DQSPHASEL field to a new value. */
#define QuadSPI_WR_SOCCR_DQSPHASEL(base, value) (QuadSPI_RMW_SOCCR(base, QuadSPI_SOCCR_DQSPHASEL_MASK, QuadSPI_SOCCR_DQSPHASEL(value)))
#define QuadSPI_BWR_SOCCR_DQSPHASEL(base, value) (BME_BFI32(&QuadSPI_SOCCR_REG(base), ((uint32_t)(value) << QuadSPI_SOCCR_DQSPHASEL_SHIFT), QuadSPI_SOCCR_DQSPHASEL_SHIFT, QuadSPI_SOCCR_DQSPHASEL_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SOCCR, field DQSINVSEL[12] (RW)
 *
 * Values:
 * - 0b0 - Use 1x internal reference clock for the DQS generation
 * - 0b1 - Use inverse 1x internal reference clock for the DQS generation
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SOCCR_DQSINVSEL field. */
#define QuadSPI_RD_SOCCR_DQSINVSEL(base) ((QuadSPI_SOCCR_REG(base) & QuadSPI_SOCCR_DQSINVSEL_MASK) >> QuadSPI_SOCCR_DQSINVSEL_SHIFT)
#define QuadSPI_BRD_SOCCR_DQSINVSEL(base) (BME_UBFX32(&QuadSPI_SOCCR_REG(base), QuadSPI_SOCCR_DQSINVSEL_SHIFT, QuadSPI_SOCCR_DQSINVSEL_WIDTH))

/*! @brief Set the DQSINVSEL field to a new value. */
#define QuadSPI_WR_SOCCR_DQSINVSEL(base, value) (QuadSPI_RMW_SOCCR(base, QuadSPI_SOCCR_DQSINVSEL_MASK, QuadSPI_SOCCR_DQSINVSEL(value)))
#define QuadSPI_BWR_SOCCR_DQSINVSEL(base, value) (BME_BFI32(&QuadSPI_SOCCR_REG(base), ((uint32_t)(value) << QuadSPI_SOCCR_DQSINVSEL_SHIFT), QuadSPI_SOCCR_DQSINVSEL_SHIFT, QuadSPI_SOCCR_DQSINVSEL_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SOCCR, field CK2EN[13] (RW)
 *
 * Values:
 * - 0b0 - CK2 flash clock is disabled
 * - 0b1 - CK2 flash clock is enabled
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SOCCR_CK2EN field. */
#define QuadSPI_RD_SOCCR_CK2EN(base) ((QuadSPI_SOCCR_REG(base) & QuadSPI_SOCCR_CK2EN_MASK) >> QuadSPI_SOCCR_CK2EN_SHIFT)
#define QuadSPI_BRD_SOCCR_CK2EN(base) (BME_UBFX32(&QuadSPI_SOCCR_REG(base), QuadSPI_SOCCR_CK2EN_SHIFT, QuadSPI_SOCCR_CK2EN_WIDTH))

/*! @brief Set the CK2EN field to a new value. */
#define QuadSPI_WR_SOCCR_CK2EN(base, value) (QuadSPI_RMW_SOCCR(base, QuadSPI_SOCCR_CK2EN_MASK, QuadSPI_SOCCR_CK2EN(value)))
#define QuadSPI_BWR_SOCCR_CK2EN(base, value) (BME_BFI32(&QuadSPI_SOCCR_REG(base), ((uint32_t)(value) << QuadSPI_SOCCR_CK2EN_SHIFT), QuadSPI_SOCCR_CK2EN_SHIFT, QuadSPI_SOCCR_CK2EN_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SOCCR, field DIFFCKEN[14] (RW)
 *
 * Values:
 * - 0b0 - Differential flash clock is disabled
 * - 0b1 - Differential flash clock is enabled
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SOCCR_DIFFCKEN field. */
#define QuadSPI_RD_SOCCR_DIFFCKEN(base) ((QuadSPI_SOCCR_REG(base) & QuadSPI_SOCCR_DIFFCKEN_MASK) >> QuadSPI_SOCCR_DIFFCKEN_SHIFT)
#define QuadSPI_BRD_SOCCR_DIFFCKEN(base) (BME_UBFX32(&QuadSPI_SOCCR_REG(base), QuadSPI_SOCCR_DIFFCKEN_SHIFT, QuadSPI_SOCCR_DIFFCKEN_WIDTH))

/*! @brief Set the DIFFCKEN field to a new value. */
#define QuadSPI_WR_SOCCR_DIFFCKEN(base, value) (QuadSPI_RMW_SOCCR(base, QuadSPI_SOCCR_DIFFCKEN_MASK, QuadSPI_SOCCR_DIFFCKEN(value)))
#define QuadSPI_BWR_SOCCR_DIFFCKEN(base, value) (BME_BFI32(&QuadSPI_SOCCR_REG(base), ((uint32_t)(value) << QuadSPI_SOCCR_DIFFCKEN_SHIFT), QuadSPI_SOCCR_DIFFCKEN_SHIFT, QuadSPI_SOCCR_DIFFCKEN_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SOCCR, field OCTEN[15] (RW)
 *
 * Values:
 * - 0b0 - QSPI0B_DATAx pins are assigned to QSPI Port B
 * - 0b1 - QSPI0B_DATAx pins are assigned to QSPI Port A
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SOCCR_OCTEN field. */
#define QuadSPI_RD_SOCCR_OCTEN(base) ((QuadSPI_SOCCR_REG(base) & QuadSPI_SOCCR_OCTEN_MASK) >> QuadSPI_SOCCR_OCTEN_SHIFT)
#define QuadSPI_BRD_SOCCR_OCTEN(base) (BME_UBFX32(&QuadSPI_SOCCR_REG(base), QuadSPI_SOCCR_OCTEN_SHIFT, QuadSPI_SOCCR_OCTEN_WIDTH))

/*! @brief Set the OCTEN field to a new value. */
#define QuadSPI_WR_SOCCR_OCTEN(base, value) (QuadSPI_RMW_SOCCR(base, QuadSPI_SOCCR_OCTEN_MASK, QuadSPI_SOCCR_OCTEN(value)))
#define QuadSPI_BWR_SOCCR_OCTEN(base, value) (BME_BFI32(&QuadSPI_SOCCR_REG(base), ((uint32_t)(value) << QuadSPI_SOCCR_OCTEN_SHIFT), QuadSPI_SOCCR_OCTEN_SHIFT, QuadSPI_SOCCR_OCTEN_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SOCCR, field DLYTAPSELA[21:16] (RW)
 *
 * Values:
 * - 0b000000 - Select 1 delay chain tap
 * - 0b000001 - Select 2 delay chain tap
 * - 0b000010 - Select 3 delay chain tap
 * - 0b000011 - Select 4 delay chain tap
 * - 0b000100 - Select 5 delay chain tap
 * - 0b000101 - Select 6 delay chain tap
 * - 0b000110 - Select 7 delay chain tap
 * - 0b000111 - Select 8 delay chain tap
 * - 0b001000 - Select 9 delay chain tap
 * - 0b001001 - Select 10 delay chain tap
 * - 0b001010 - Select 11 delay chain tap
 * - 0b001011 - Select 12 delay chain tap
 * - 0b001100 - Select 13 delay chain tap
 * - 0b001101 - Select 14 delay chain tap
 * - 0b001110 - Select 15 delay chain tap
 * - 0b001111 - Select 16 delay chain tap
 * - 0b010000 - Select 17 delay chain tap
 * - 0b010001 - Select 18 delay chain tap
 * - 0b010010 - Select 19 delay chain tap
 * - 0b010011 - Select 20 delay chain tap
 * - 0b010100 - Select 21 delay chain tap
 * - 0b010101 - Select 22 delay chain tap
 * - 0b010110 - Select 23 delay chain tap
 * - 0b010111 - Select 24 delay chain tap
 * - 0b011000 - Select 25 delay chain tap
 * - 0b011001 - Select 26 delay chain tap
 * - 0b011010 - Select 27 delay chain tap
 * - 0b011011 - Select 28 delay chain tap
 * - 0b011100 - Select 29 delay chain tap
 * - 0b011101 - Select 30 delay chain tap
 * - 0b011110 - Select 31 delay chain tap
 * - 0b011111 - Select 32 delay chain tap
 * - 0b100000 - Select 33 delay chain tap
 * - 0b100001 - Select 34 delay chain tap
 * - 0b100010 - Select 35 delay chain tap
 * - 0b100011 - Select 36 delay chain tap
 * - 0b100100 - Select 37 delay chain tap
 * - 0b100101 - Select 38 delay chain tap
 * - 0b100110 - Select 39 delay chain tap
 * - 0b100111 - Select 40 delay chain tap
 * - 0b101000 - Select 41 delay chain tap
 * - 0b101001 - Select 42 delay chain tap
 * - 0b101010 - Select 43 delay chain tap
 * - 0b101011 - Select 44 delay chain tap
 * - 0b101100 - Select 45 delay chain tap
 * - 0b101101 - Select 46 delay chain tap
 * - 0b101110 - Select 47 delay chain tap
 * - 0b101111 - Select 48 delay chain tap
 * - 0b110000 - Select 49 delay chain tap
 * - 0b110001 - Select 50 delay chain tap
 * - 0b110010 - Select 51 delay chain tap
 * - 0b110011 - Select 52 delay chain tap
 * - 0b110100 - Select 53 delay chain tap
 * - 0b110101 - Select 54 delay chain tap
 * - 0b110110 - Select 55 delay chain tap
 * - 0b110111 - Select 56 delay chain tap
 * - 0b111000 - Select 57 delay chain tap
 * - 0b111001 - Select 58 delay chain tap
 * - 0b111010 - Select 59 delay chain tap
 * - 0b111011 - Select 60 delay chain tap
 * - 0b111100 - Select 61 delay chain tap
 * - 0b111101 - Select 62 delay chain tap
 * - 0b111110 - Select 63 delay chain tap
 * - 0b111111 - Select 64 delay chain tap
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SOCCR_DLYTAPSELA field. */
#define QuadSPI_RD_SOCCR_DLYTAPSELA(base) ((QuadSPI_SOCCR_REG(base) & QuadSPI_SOCCR_DLYTAPSELA_MASK) >> QuadSPI_SOCCR_DLYTAPSELA_SHIFT)
#define QuadSPI_BRD_SOCCR_DLYTAPSELA(base) (BME_UBFX32(&QuadSPI_SOCCR_REG(base), QuadSPI_SOCCR_DLYTAPSELA_SHIFT, QuadSPI_SOCCR_DLYTAPSELA_WIDTH))

/*! @brief Set the DLYTAPSELA field to a new value. */
#define QuadSPI_WR_SOCCR_DLYTAPSELA(base, value) (QuadSPI_RMW_SOCCR(base, QuadSPI_SOCCR_DLYTAPSELA_MASK, QuadSPI_SOCCR_DLYTAPSELA(value)))
#define QuadSPI_BWR_SOCCR_DLYTAPSELA(base, value) (BME_BFI32(&QuadSPI_SOCCR_REG(base), ((uint32_t)(value) << QuadSPI_SOCCR_DLYTAPSELA_SHIFT), QuadSPI_SOCCR_DLYTAPSELA_SHIFT, QuadSPI_SOCCR_DLYTAPSELA_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SOCCR, field DLYTAPSELB[29:24] (RW)
 *
 * Values:
 * - 0b000000 - Select 1 delay chain tap
 * - 0b000001 - Select 2 delay chain tap
 * - 0b000010 - Select 3 delay chain tap
 * - 0b000011 - Select 4 delay chain tap
 * - 0b000100 - Select 5 delay chain tap
 * - 0b000101 - Select 6 delay chain tap
 * - 0b000110 - Select 7 delay chain tap
 * - 0b000111 - Select 8 delay chain tap
 * - 0b001000 - Select 9 delay chain tap
 * - 0b001001 - Select 10 delay chain tap
 * - 0b001010 - Select 11 delay chain tap
 * - 0b001011 - Select 12 delay chain tap
 * - 0b001100 - Select 13 delay chain tap
 * - 0b001101 - Select 14 delay chain tap
 * - 0b001110 - Select 15 delay chain tap
 * - 0b001111 - Select 16 delay chain tap
 * - 0b010000 - Select 17 delay chain tap
 * - 0b010001 - Select 18 delay chain tap
 * - 0b010010 - Select 19 delay chain tap
 * - 0b010011 - Select 20 delay chain tap
 * - 0b010100 - Select 21 delay chain tap
 * - 0b010101 - Select 22 delay chain tap
 * - 0b010110 - Select 23 delay chain tap
 * - 0b010111 - Select 24 delay chain tap
 * - 0b011000 - Select 25 delay chain tap
 * - 0b011001 - Select 26 delay chain tap
 * - 0b011010 - Select 27 delay chain tap
 * - 0b011011 - Select 28 delay chain tap
 * - 0b011100 - Select 29 delay chain tap
 * - 0b011101 - Select 30 delay chain tap
 * - 0b011110 - Select 31 delay chain tap
 * - 0b011111 - Select 32 delay chain tap
 * - 0b100000 - Select 33 delay chain tap
 * - 0b100001 - Select 34 delay chain tap
 * - 0b100010 - Select 35 delay chain tap
 * - 0b100011 - Select 36 delay chain tap
 * - 0b100100 - Select 37 delay chain tap
 * - 0b100101 - Select 38 delay chain tap
 * - 0b100110 - Select 39 delay chain tap
 * - 0b100111 - Select 40 delay chain tap
 * - 0b101000 - Select 41 delay chain tap
 * - 0b101001 - Select 42 delay chain tap
 * - 0b101010 - Select 43 delay chain tap
 * - 0b101011 - Select 44 delay chain tap
 * - 0b101100 - Select 45 delay chain tap
 * - 0b101101 - Select 46 delay chain tap
 * - 0b101110 - Select 47 delay chain tap
 * - 0b101111 - Select 48 delay chain tap
 * - 0b110000 - Select 49 delay chain tap
 * - 0b110001 - Select 50 delay chain tap
 * - 0b110010 - Select 51 delay chain tap
 * - 0b110011 - Select 52 delay chain tap
 * - 0b110100 - Select 53 delay chain tap
 * - 0b110101 - Select 54 delay chain tap
 * - 0b110110 - Select 55 delay chain tap
 * - 0b110111 - Select 56 delay chain tap
 * - 0b111000 - Select 57 delay chain tap
 * - 0b111001 - Select 58 delay chain tap
 * - 0b111010 - Select 59 delay chain tap
 * - 0b111011 - Select 60 delay chain tap
 * - 0b111100 - Select 61 delay chain tap
 * - 0b111101 - Select 62 delay chain tap
 * - 0b111110 - Select 63 delay chain tap
 * - 0b111111 - Select 64 delay chain tap
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SOCCR_DLYTAPSELB field. */
#define QuadSPI_RD_SOCCR_DLYTAPSELB(base) ((QuadSPI_SOCCR_REG(base) & QuadSPI_SOCCR_DLYTAPSELB_MASK) >> QuadSPI_SOCCR_DLYTAPSELB_SHIFT)
#define QuadSPI_BRD_SOCCR_DLYTAPSELB(base) (BME_UBFX32(&QuadSPI_SOCCR_REG(base), QuadSPI_SOCCR_DLYTAPSELB_SHIFT, QuadSPI_SOCCR_DLYTAPSELB_WIDTH))

/*! @brief Set the DLYTAPSELB field to a new value. */
#define QuadSPI_WR_SOCCR_DLYTAPSELB(base, value) (QuadSPI_RMW_SOCCR(base, QuadSPI_SOCCR_DLYTAPSELB_MASK, QuadSPI_SOCCR_DLYTAPSELB(value)))
#define QuadSPI_BWR_SOCCR_DLYTAPSELB(base, value) (BME_BFI32(&QuadSPI_SOCCR_REG(base), ((uint32_t)(value) << QuadSPI_SOCCR_DLYTAPSELB_SHIFT), QuadSPI_SOCCR_DLYTAPSELB_SHIFT, QuadSPI_SOCCR_DLYTAPSELB_WIDTH))
/*@}*/

