RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*******************************************************************************
 * QuadSPI_BUF0IND - Buffer0 Top Index Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_BUF0IND - Buffer0 Top Index Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register specifies the top index of buffer0, which defines its size.
 * Note that that the 3 LSBs of this register are set to zero - this ensures that
 * the buffer is 64bit aligned, as each buffer entry is 64bits long. The register
 * value should be set to the desired number of bytes less 8. For example, setting
 * BUF0IND to 0 gives 8 bytes, 1 gives 16 bytes etc. The size of buffer0 is the
 * difference between BUF0IND+8 and 0. It is the responsibility of the software
 * to ensure that BUF0IND value is not greater than the overall size of the
 * buffer. The hardware does not provide any protection against illegal programming.
 * Write: QSPI_SR[AHB_ACC] = 0
 */
/*!
 * @name Constants and macros for entire QuadSPI_BUF0IND register
 */
/*@{*/
#define QuadSPI_RD_BUF0IND(base) (QuadSPI_BUF0IND_REG(base))
#define QuadSPI_WR_BUF0IND(base, value) (QuadSPI_BUF0IND_REG(base) = (value))
#define QuadSPI_RMW_BUF0IND(base, mask, value) (QuadSPI_WR_BUF0IND(base, (QuadSPI_RD_BUF0IND(base) & ~(mask)) | (value)))
#define QuadSPI_SET_BUF0IND(base, value) (BME_OR32(&QuadSPI_BUF0IND_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_BUF0IND(base, value) (BME_AND32(&QuadSPI_BUF0IND_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_BUF0IND(base, value) (BME_XOR32(&QuadSPI_BUF0IND_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_BUF0IND bitfields
 */

/*!
 * @name Register QuadSPI_BUF0IND, field TPINDX0[31:3] (RW)
 *
 * Top index of buffer 0.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_BUF0IND_TPINDX0 field. */
#define QuadSPI_RD_BUF0IND_TPINDX0(base) ((QuadSPI_BUF0IND_REG(base) & QuadSPI_BUF0IND_TPINDX0_MASK) >> QuadSPI_BUF0IND_TPINDX0_SHIFT)
#define QuadSPI_BRD_BUF0IND_TPINDX0(base) (QuadSPI_RD_BUF0IND_TPINDX0(base))

/*! @brief Set the TPINDX0 field to a new value. */
#define QuadSPI_WR_BUF0IND_TPINDX0(base, value) (QuadSPI_RMW_BUF0IND(base, QuadSPI_BUF0IND_TPINDX0_MASK, QuadSPI_BUF0IND_TPINDX0(value)))
#define QuadSPI_BWR_BUF0IND_TPINDX0(base, value) (QuadSPI_WR_BUF0IND_TPINDX0(base, value))
/*@}*/

/*******************************************************************************
 * QuadSPI_BUF1IND - Buffer1 Top Index Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_BUF1IND - Buffer1 Top Index Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register specifies the top index of buffer1, which defines its size.
 * Note that the 3 LSBs of this register are set to zero - this ensures that the
 * buffer is 64bit aligned as each buffer entry is 64bits long. The size of buffer1
 * is the difference between the BUF1IND and BUF0IND. The register value should
 * be entered in bytes. For example, If BUF0IND = 0x100 then setting BUF1IND =
 * 0x130 will set buffer1 size to 0x30bytes. It is the responsibility of the
 * software to ensure that BUF1IND value is not greater than the overall size of the
 * buffer. The hardware does not provide any protection against illegal programming.
 * Write: QSPI_SR[AHB_ACC] = 0
 */
/*!
 * @name Constants and macros for entire QuadSPI_BUF1IND register
 */
/*@{*/
#define QuadSPI_RD_BUF1IND(base) (QuadSPI_BUF1IND_REG(base))
#define QuadSPI_WR_BUF1IND(base, value) (QuadSPI_BUF1IND_REG(base) = (value))
#define QuadSPI_RMW_BUF1IND(base, mask, value) (QuadSPI_WR_BUF1IND(base, (QuadSPI_RD_BUF1IND(base) & ~(mask)) | (value)))
#define QuadSPI_SET_BUF1IND(base, value) (BME_OR32(&QuadSPI_BUF1IND_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_BUF1IND(base, value) (BME_AND32(&QuadSPI_BUF1IND_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_BUF1IND(base, value) (BME_XOR32(&QuadSPI_BUF1IND_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_BUF1IND bitfields
 */

/*!
 * @name Register QuadSPI_BUF1IND, field TPINDX1[31:3] (RW)
 *
 * Top index of buffer 1.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_BUF1IND_TPINDX1 field. */
#define QuadSPI_RD_BUF1IND_TPINDX1(base) ((QuadSPI_BUF1IND_REG(base) & QuadSPI_BUF1IND_TPINDX1_MASK) >> QuadSPI_BUF1IND_TPINDX1_SHIFT)
#define QuadSPI_BRD_BUF1IND_TPINDX1(base) (QuadSPI_RD_BUF1IND_TPINDX1(base))

/*! @brief Set the TPINDX1 field to a new value. */
#define QuadSPI_WR_BUF1IND_TPINDX1(base, value) (QuadSPI_RMW_BUF1IND(base, QuadSPI_BUF1IND_TPINDX1_MASK, QuadSPI_BUF1IND_TPINDX1(value)))
#define QuadSPI_BWR_BUF1IND_TPINDX1(base, value) (QuadSPI_WR_BUF1IND_TPINDX1(base, value))
/*@}*/

/*******************************************************************************
 * QuadSPI_BUF2IND - Buffer2 Top Index Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_BUF2IND - Buffer2 Top Index Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register specifies the top index of buffer2, which defines its size.
 * Note that that the 3 LSBs of this register are set to zero - this ensures that
 * the buffer is 64bit aligned as each buffer entry is 64bits long. The size of
 * buffer2 is the difference between the BUF2IND and BUF1IND. The register value
 * should be entered in bytes. For example, if BUF1IND = 0x130 then setting BUF2IND
 * = 0x180 will set buffer2 size to 0x50 bytes. It is the responsibility of the
 * software to ensure that BUF2IND value is not greater than the overall size of
 * the buffer. The hardware does not provide any protection against illegal
 * programming. Write: QSPI_SR[AHB_ACC] = 0
 */
/*!
 * @name Constants and macros for entire QuadSPI_BUF2IND register
 */
/*@{*/
#define QuadSPI_RD_BUF2IND(base) (QuadSPI_BUF2IND_REG(base))
#define QuadSPI_WR_BUF2IND(base, value) (QuadSPI_BUF2IND_REG(base) = (value))
#define QuadSPI_RMW_BUF2IND(base, mask, value) (QuadSPI_WR_BUF2IND(base, (QuadSPI_RD_BUF2IND(base) & ~(mask)) | (value)))
#define QuadSPI_SET_BUF2IND(base, value) (BME_OR32(&QuadSPI_BUF2IND_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_BUF2IND(base, value) (BME_AND32(&QuadSPI_BUF2IND_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_BUF2IND(base, value) (BME_XOR32(&QuadSPI_BUF2IND_REG(base), (uint32_t)(value)))
/*@}*/

