RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*
 * Constants & macros for individual QuadSPI_TBSR bitfields
 */

/*!
 * @name Register QuadSPI_TBSR, field TRBFL[12:8] (RO)
 *
 * TX Buffer Fill Level. The TRBFL field contains the number of entries of 4
 * bytes each available in the TX Buffer for the QuadSPI module to transmit to the
 * serial flash device.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_TBSR_TRBFL field. */
#define QuadSPI_RD_TBSR_TRBFL(base) ((QuadSPI_TBSR_REG(base) & QuadSPI_TBSR_TRBFL_MASK) >> QuadSPI_TBSR_TRBFL_SHIFT)
#define QuadSPI_BRD_TBSR_TRBFL(base) (BME_UBFX32(&QuadSPI_TBSR_REG(base), QuadSPI_TBSR_TRBFL_SHIFT, QuadSPI_TBSR_TRBFL_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_TBSR, field TRCTR[31:16] (RO)
 *
 * Transmit Counter. This field indicates how many entries of 4 bytes have been
 * written into the TX Buffer by host accesses. It is reset to 0 when a 1 is
 * written into the QSPI_MCR[CLR_TXF] bit. It is incremented on each write access to
 * the QSPI_TBDR register when another word has been pushed onto the TX Buffer.
 * When it is not cleared the TRCTR field wraps around to 0. Refer to TBDRTX
 * Buffer Data Register for details.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_TBSR_TRCTR field. */
#define QuadSPI_RD_TBSR_TRCTR(base) ((QuadSPI_TBSR_REG(base) & QuadSPI_TBSR_TRCTR_MASK) >> QuadSPI_TBSR_TRCTR_SHIFT)
#define QuadSPI_BRD_TBSR_TRCTR(base) (QuadSPI_RD_TBSR_TRCTR(base))
/*@}*/

/*******************************************************************************
 * QuadSPI_TBDR - TX Buffer Data Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_TBDR - TX Buffer Data Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The QSPI_TBDR register provides access to the circular TX Buffer of depth 64
 * bytes. This buffer provides the data written into it as write data for the
 * page programming commands to the serial flash device. Refer to for the byte
 * ordering scheme. A write transaction on the flash with data size of less than 32
 * bits will lead to the removal of four data entry from the TX buffer. The valid
 * bits will be used and the rest of the bits will be discarded. Write:
 * QSPI_SR[TXFULL] = 0 32-bit write access required
 */
/*!
 * @name Constants and macros for entire QuadSPI_TBDR register
 */
/*@{*/
#define QuadSPI_RD_TBDR(base)    (QuadSPI_TBDR_REG(base))
#define QuadSPI_WR_TBDR(base, value) (QuadSPI_TBDR_REG(base) = (value))
#define QuadSPI_RMW_TBDR(base, mask, value) (QuadSPI_WR_TBDR(base, (QuadSPI_RD_TBDR(base) & ~(mask)) | (value)))
#define QuadSPI_SET_TBDR(base, value) (BME_OR32(&QuadSPI_TBDR_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_TBDR(base, value) (BME_AND32(&QuadSPI_TBDR_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_TBDR(base, value) (BME_XOR32(&QuadSPI_TBDR_REG(base), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * QuadSPI_TBCT - Tx Buffer Control Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_TBCT - Tx Buffer Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register contains control information for transmit data buffer-
 */
/*!
 * @name Constants and macros for entire QuadSPI_TBCT register
 */
/*@{*/
#define QuadSPI_RD_TBCT(base)    (QuadSPI_TBCT_REG(base))
#define QuadSPI_WR_TBCT(base, value) (QuadSPI_TBCT_REG(base) = (value))
#define QuadSPI_RMW_TBCT(base, mask, value) (QuadSPI_WR_TBCT(base, (QuadSPI_RD_TBCT(base) & ~(mask)) | (value)))
#define QuadSPI_SET_TBCT(base, value) (BME_OR32(&QuadSPI_TBCT_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_TBCT(base, value) (BME_AND32(&QuadSPI_TBCT_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_TBCT(base, value) (BME_XOR32(&QuadSPI_TBCT_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_TBCT bitfields
 */

/*!
 * @name Register QuadSPI_TBCT, field WMRK[3:0] (RW)
 *
 * Determines the watermark for the TX Buffer. When the number of available
 * space in TX Buffer is greater than the number given by (WMRK+1), QSPI_SR[TXWA] is
 * asserted. The values should be entered as the number of 4Bytes entries minus
 * 1. For example, a value of 0x0 would set the watermark to 4 bytes, 1 to 8
 * bytes, 2 to 12 Bytes, and so on.For details, refer to DMA Usage.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_TBCT_WMRK field. */
#define QuadSPI_RD_TBCT_WMRK(base) ((QuadSPI_TBCT_REG(base) & QuadSPI_TBCT_WMRK_MASK) >> QuadSPI_TBCT_WMRK_SHIFT)
#define QuadSPI_BRD_TBCT_WMRK(base) (BME_UBFX32(&QuadSPI_TBCT_REG(base), QuadSPI_TBCT_WMRK_SHIFT, QuadSPI_TBCT_WMRK_WIDTH))

/*! @brief Set the WMRK field to a new value. */
#define QuadSPI_WR_TBCT_WMRK(base, value) (QuadSPI_RMW_TBCT(base, QuadSPI_TBCT_WMRK_MASK, QuadSPI_TBCT_WMRK(value)))
#define QuadSPI_BWR_TBCT_WMRK(base, value) (BME_BFI32(&QuadSPI_TBCT_REG(base), ((uint32_t)(value) << QuadSPI_TBCT_WMRK_SHIFT), QuadSPI_TBCT_WMRK_SHIFT, QuadSPI_TBCT_WMRK_WIDTH))
/*@}*/

/*******************************************************************************
 * QuadSPI_SR - Status Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_SR - Status Register (RO)
 *
 * Reset value: 0x02003800U
 *
 * The QSPI_SR register provides all available status information about SFM
 * command execution and arbitration, the RX Buffer and TX Buffer and the AHB Buffer.
 */
/*!
 * @name Constants and macros for entire QuadSPI_SR register
 */
/*@{*/
#define QuadSPI_RD_SR(base)      (QuadSPI_SR_REG(base))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_SR bitfields
 */

/*!
 * @name Register QuadSPI_SR, field BUSY[0] (RO)
 *
 * Module Busy: Asserted when module is currently busy handling a transaction to
 * an external flash device.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_BUSY field. */
#define QuadSPI_RD_SR_BUSY(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_BUSY_MASK) >> QuadSPI_SR_BUSY_SHIFT)
#define QuadSPI_BRD_SR_BUSY(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_BUSY_SHIFT, QuadSPI_SR_BUSY_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field IP_ACC[1] (RO)
 *
 * IP Access: Asserted when transaction currently executed was initiated by IP
 * bus.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_IP_ACC field. */
#define QuadSPI_RD_SR_IP_ACC(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_IP_ACC_MASK) >> QuadSPI_SR_IP_ACC_SHIFT)
#define QuadSPI_BRD_SR_IP_ACC(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_IP_ACC_SHIFT, QuadSPI_SR_IP_ACC_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field AHB_ACC[2] (RO)
 *
 * AHB Access: Asserted when the transaction currently executed was initiated by
 * AHB bus.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_AHB_ACC field. */
#define QuadSPI_RD_SR_AHB_ACC(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_AHB_ACC_MASK) >> QuadSPI_SR_AHB_ACC_SHIFT)
#define QuadSPI_BRD_SR_AHB_ACC(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_AHB_ACC_SHIFT, QuadSPI_SR_AHB_ACC_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field AHBGNT[5] (RO)
 *
 * AHB Command priority Granted: Asserted when another module has been granted
 * priority of AHB Commands against IP Commands. For details refer to Command
 * Arbitration.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_AHBGNT field. */
#define QuadSPI_RD_SR_AHBGNT(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_AHBGNT_MASK) >> QuadSPI_SR_AHBGNT_SHIFT)
#define QuadSPI_BRD_SR_AHBGNT(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_AHBGNT_SHIFT, QuadSPI_SR_AHBGNT_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field AHBTRN[6] (RO)
 *
 * AHB Access Transaction pending: Asserted when there is a pending request on
 * the AHB interface. Refer to the AMBA specification for details.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_AHBTRN field. */
#define QuadSPI_RD_SR_AHBTRN(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_AHBTRN_MASK) >> QuadSPI_SR_AHBTRN_SHIFT)
#define QuadSPI_BRD_SR_AHBTRN(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_AHBTRN_SHIFT, QuadSPI_SR_AHBTRN_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field AHB0NE[7] (RO)
 *
 * AHB 0 Buffer Not Empty: Asserted when AHB 0 buffer contains data.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_AHB0NE field. */
#define QuadSPI_RD_SR_AHB0NE(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_AHB0NE_MASK) >> QuadSPI_SR_AHB0NE_SHIFT)
#define QuadSPI_BRD_SR_AHB0NE(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_AHB0NE_SHIFT, QuadSPI_SR_AHB0NE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field AHB1NE[8] (RO)
 *
 * AHB 1 Buffer Not Empty: Asserted when AHB 1 buffer contains data.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_AHB1NE field. */
#define QuadSPI_RD_SR_AHB1NE(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_AHB1NE_MASK) >> QuadSPI_SR_AHB1NE_SHIFT)
#define QuadSPI_BRD_SR_AHB1NE(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_AHB1NE_SHIFT, QuadSPI_SR_AHB1NE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field AHB2NE[9] (RO)
 *
 * AHB 2 Buffer Not Empty: Asserted when AHB 2 buffer contains data.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_AHB2NE field. */
#define QuadSPI_RD_SR_AHB2NE(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_AHB2NE_MASK) >> QuadSPI_SR_AHB2NE_SHIFT)
#define QuadSPI_BRD_SR_AHB2NE(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_AHB2NE_SHIFT, QuadSPI_SR_AHB2NE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field AHB3NE[10] (RO)
 *
 * AHB 3 Buffer Not Empty: Asserted when AHB 3 buffer contains data.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_AHB3NE field. */
#define QuadSPI_RD_SR_AHB3NE(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_AHB3NE_MASK) >> QuadSPI_SR_AHB3NE_SHIFT)
#define QuadSPI_BRD_SR_AHB3NE(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_AHB3NE_SHIFT, QuadSPI_SR_AHB3NE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field AHB0FUL[11] (RO)
 *
 * AHB 0 Buffer Full: Asserted when AHB 0 buffer is full.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_AHB0FUL field. */
#define QuadSPI_RD_SR_AHB0FUL(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_AHB0FUL_MASK) >> QuadSPI_SR_AHB0FUL_SHIFT)
#define QuadSPI_BRD_SR_AHB0FUL(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_AHB0FUL_SHIFT, QuadSPI_SR_AHB0FUL_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field AHB1FUL[12] (RO)
 *
 * AHB 1 Buffer Full: Asserted when AHB 1 buffer is full.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_AHB1FUL field. */
#define QuadSPI_RD_SR_AHB1FUL(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_AHB1FUL_MASK) >> QuadSPI_SR_AHB1FUL_SHIFT)
#define QuadSPI_BRD_SR_AHB1FUL(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_AHB1FUL_SHIFT, QuadSPI_SR_AHB1FUL_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field AHB2FUL[13] (RO)
 *
 * AHB 2 Buffer Full: Asserted when AHB 2 buffer is full.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_AHB2FUL field. */
#define QuadSPI_RD_SR_AHB2FUL(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_AHB2FUL_MASK) >> QuadSPI_SR_AHB2FUL_SHIFT)
#define QuadSPI_BRD_SR_AHB2FUL(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_AHB2FUL_SHIFT, QuadSPI_SR_AHB2FUL_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field AHB3FUL[14] (RO)
 *
 * AHB 3 Buffer Full: Asserted when AHB 3 buffer is full.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_AHB3FUL field. */
#define QuadSPI_RD_SR_AHB3FUL(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_AHB3FUL_MASK) >> QuadSPI_SR_AHB3FUL_SHIFT)
#define QuadSPI_BRD_SR_AHB3FUL(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_AHB3FUL_SHIFT, QuadSPI_SR_AHB3FUL_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field RXWE[16] (RO)
 *
 * RX Buffer Watermark Exceeded: Asserted when the number of valid entries in
 * the RX Buffer exceeds the number given in the QSPI_RBCT[WMRK] field.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_RXWE field. */
#define QuadSPI_RD_SR_RXWE(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_RXWE_MASK) >> QuadSPI_SR_RXWE_SHIFT)
#define QuadSPI_BRD_SR_RXWE(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_RXWE_SHIFT, QuadSPI_SR_RXWE_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field RXFULL[19] (RO)
 *
 * RX Buffer Full: Asserted when the RX Buffer is full, i.e. that
 * QSPI_RBSR[RDBFL] field is equal to 32.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_RXFULL field. */
#define QuadSPI_RD_SR_RXFULL(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_RXFULL_MASK) >> QuadSPI_SR_RXFULL_SHIFT)
#define QuadSPI_BRD_SR_RXFULL(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_RXFULL_SHIFT, QuadSPI_SR_RXFULL_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field RXDMA[23] (RO)
 *
 * RX Buffer DMA: Asserted when RX Buffer read out via DMA is active i.e DMA is
 * requested or running.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_RXDMA field. */
#define QuadSPI_RD_SR_RXDMA(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_RXDMA_MASK) >> QuadSPI_SR_RXDMA_SHIFT)
#define QuadSPI_BRD_SR_RXDMA(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_RXDMA_SHIFT, QuadSPI_SR_RXDMA_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field TXEDA[24] (RO)
 *
 * Asserted when TX Buffer contains enough data for any pop operation to take
 * place. There must be atleast 128bit data available in TX FIFO for any pop
 * operation otherwise QSPI_FR[TBUF] will be set.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_TXEDA field. */
#define QuadSPI_RD_SR_TXEDA(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_TXEDA_MASK) >> QuadSPI_SR_TXEDA_SHIFT)
#define QuadSPI_BRD_SR_TXEDA(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_TXEDA_SHIFT, QuadSPI_SR_TXEDA_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field TXWA[25] (RO)
 *
 * Asserted when the number of available spaces in TX buffer is greater than or
 * equal to the value give by QSPI_TBCT[WMRK].
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_TXWA field. */
#define QuadSPI_RD_SR_TXWA(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_TXWA_MASK) >> QuadSPI_SR_TXWA_SHIFT)
#define QuadSPI_BRD_SR_TXWA(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_TXWA_SHIFT, QuadSPI_SR_TXWA_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field TXDMA[26] (RO)
 *
 * Asserted when TXFIFO fill via DMA is active i.e. DMA is requested or running
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_TXDMA field. */
#define QuadSPI_RD_SR_TXDMA(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_TXDMA_MASK) >> QuadSPI_SR_TXDMA_SHIFT)
#define QuadSPI_BRD_SR_TXDMA(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_TXDMA_SHIFT, QuadSPI_SR_TXDMA_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field TXFULL[27] (RO)
 *
 * TX Buffer Full: Asserted when no more data can be stored.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_TXFULL field. */
#define QuadSPI_RD_SR_TXFULL(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_TXFULL_MASK) >> QuadSPI_SR_TXFULL_SHIFT)
#define QuadSPI_BRD_SR_TXFULL(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_TXFULL_SHIFT, QuadSPI_SR_TXFULL_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_SR, field DLPSMP[31:29] (RO)
 *
 * Data learning pattern sampling point: The sampling point found by the
 * controller with the data learning pattern. This is used for DDR only. If the learning
 * fails, this field will return garbage and DLPFF bit will be set. In case of
 * Data learning with DQS this field will return the reset value as sampling point
 * match is not found in case of DQS.For details, refer to Data Learning.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SR_DLPSMP field. */
#define QuadSPI_RD_SR_DLPSMP(base) ((QuadSPI_SR_REG(base) & QuadSPI_SR_DLPSMP_MASK) >> QuadSPI_SR_DLPSMP_SHIFT)
#define QuadSPI_BRD_SR_DLPSMP(base) (BME_UBFX32(&QuadSPI_SR_REG(base), QuadSPI_SR_DLPSMP_SHIFT, QuadSPI_SR_DLPSMP_WIDTH))
/*@}*/

