RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*******************************************************************************
 * QuadSPI_FR - Flag Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_FR - Flag Register (RW)
 *
 * Reset value: 0x08000000U
 *
 * The QSPI_FR register provides all available flags about SFM command execution
 * and arbitration which may serve as source for the generation of interrupt
 * service requests. Note that the error flags in this register do not relate
 * directly to the execution of the transaction in the serial flash device itself but
 * only to the behavior and conditions visible in the QuadSPI module. Write:
 * Enabled Mode
 */
/*!
 * @name Constants and macros for entire QuadSPI_FR register
 */
/*@{*/
#define QuadSPI_RD_FR(base)      (QuadSPI_FR_REG(base))
#define QuadSPI_WR_FR(base, value) (QuadSPI_FR_REG(base) = (value))
#define QuadSPI_RMW_FR(base, mask, value) (QuadSPI_WR_FR(base, (QuadSPI_RD_FR(base) & ~(mask)) | (value)))
#define QuadSPI_SET_FR(base, value) (BME_OR32(&QuadSPI_FR_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_FR(base, value) (BME_AND32(&QuadSPI_FR_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_FR(base, value) (BME_XOR32(&QuadSPI_FR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_FR bitfields
 */

/*!
 * @name Register QuadSPI_FR, field TFF[0] (W1C)
 *
 * IP Command Transaction Finished Flag: Set when the QuadSPI module has
 * finished a running IP Command. If an error occurred the related error flags are
 * valid, at the latest, in the same clock cycle when the TFF flag is asserted.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_FR_TFF field. */
#define QuadSPI_RD_FR_TFF(base) ((QuadSPI_FR_REG(base) & QuadSPI_FR_TFF_MASK) >> QuadSPI_FR_TFF_SHIFT)
#define QuadSPI_BRD_FR_TFF(base) (BME_UBFX32(&QuadSPI_FR_REG(base), QuadSPI_FR_TFF_SHIFT, QuadSPI_FR_TFF_WIDTH))

/*! @brief Set the TFF field to a new value. */
#define QuadSPI_WR_FR_TFF(base, value) (QuadSPI_RMW_FR(base, (QuadSPI_FR_TFF_MASK | QuadSPI_FR_IPGEF_MASK | QuadSPI_FR_IPIEF_MASK | QuadSPI_FR_IPAEF_MASK | QuadSPI_FR_IUEF_MASK | QuadSPI_FR_ABOF_MASK | QuadSPI_FR_AIBSEF_MASK | QuadSPI_FR_AITEF_MASK | QuadSPI_FR_ABSEF_MASK | QuadSPI_FR_RBDF_MASK | QuadSPI_FR_RBOF_MASK | QuadSPI_FR_ILLINE_MASK | QuadSPI_FR_TBUF_MASK | QuadSPI_FR_TBFF_MASK | QuadSPI_FR_DLPFF_MASK), QuadSPI_FR_TFF(value)))
#define QuadSPI_BWR_FR_TFF(base, value) (BME_BFI32(&QuadSPI_FR_REG(base), ((uint32_t)(value) << QuadSPI_FR_TFF_SHIFT), QuadSPI_FR_TFF_SHIFT, QuadSPI_FR_TFF_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_FR, field IPGEF[4] (W1C)
 *
 * IP Command Trigger during AHB Grant Error Flag: Set when the following
 * condition occurs: A write access occurs to the QSPI_IPCR[SEQID] field and the
 * QSPI_SR[AHBGNT] bit is set. Any command leading to the assertion of the IPGEF flag
 * is ignored.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_FR_IPGEF field. */
#define QuadSPI_RD_FR_IPGEF(base) ((QuadSPI_FR_REG(base) & QuadSPI_FR_IPGEF_MASK) >> QuadSPI_FR_IPGEF_SHIFT)
#define QuadSPI_BRD_FR_IPGEF(base) (BME_UBFX32(&QuadSPI_FR_REG(base), QuadSPI_FR_IPGEF_SHIFT, QuadSPI_FR_IPGEF_WIDTH))

/*! @brief Set the IPGEF field to a new value. */
#define QuadSPI_WR_FR_IPGEF(base, value) (QuadSPI_RMW_FR(base, (QuadSPI_FR_IPGEF_MASK | QuadSPI_FR_TFF_MASK | QuadSPI_FR_IPIEF_MASK | QuadSPI_FR_IPAEF_MASK | QuadSPI_FR_IUEF_MASK | QuadSPI_FR_ABOF_MASK | QuadSPI_FR_AIBSEF_MASK | QuadSPI_FR_AITEF_MASK | QuadSPI_FR_ABSEF_MASK | QuadSPI_FR_RBDF_MASK | QuadSPI_FR_RBOF_MASK | QuadSPI_FR_ILLINE_MASK | QuadSPI_FR_TBUF_MASK | QuadSPI_FR_TBFF_MASK | QuadSPI_FR_DLPFF_MASK), QuadSPI_FR_IPGEF(value)))
#define QuadSPI_BWR_FR_IPGEF(base, value) (BME_BFI32(&QuadSPI_FR_REG(base), ((uint32_t)(value) << QuadSPI_FR_IPGEF_SHIFT), QuadSPI_FR_IPGEF_SHIFT, QuadSPI_FR_IPGEF_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_FR, field IPIEF[6] (W1C)
 *
 * IP Command Trigger could not be executed Error Flag. Set when the
 * QSPI_SR[IP_ACC] bit is set (i.e. an IP triggered command is currently executing) and any
 * of the following conditions occurs: Write access to the QSPI_IPCR register.
 * Any command leading to the assertion of the IPIEF flag is ignored Write access
 * to the QSPI_SFAR register. Write access to the QSPI_RBCT register.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_FR_IPIEF field. */
#define QuadSPI_RD_FR_IPIEF(base) ((QuadSPI_FR_REG(base) & QuadSPI_FR_IPIEF_MASK) >> QuadSPI_FR_IPIEF_SHIFT)
#define QuadSPI_BRD_FR_IPIEF(base) (BME_UBFX32(&QuadSPI_FR_REG(base), QuadSPI_FR_IPIEF_SHIFT, QuadSPI_FR_IPIEF_WIDTH))

/*! @brief Set the IPIEF field to a new value. */
#define QuadSPI_WR_FR_IPIEF(base, value) (QuadSPI_RMW_FR(base, (QuadSPI_FR_IPIEF_MASK | QuadSPI_FR_TFF_MASK | QuadSPI_FR_IPGEF_MASK | QuadSPI_FR_IPAEF_MASK | QuadSPI_FR_IUEF_MASK | QuadSPI_FR_ABOF_MASK | QuadSPI_FR_AIBSEF_MASK | QuadSPI_FR_AITEF_MASK | QuadSPI_FR_ABSEF_MASK | QuadSPI_FR_RBDF_MASK | QuadSPI_FR_RBOF_MASK | QuadSPI_FR_ILLINE_MASK | QuadSPI_FR_TBUF_MASK | QuadSPI_FR_TBFF_MASK | QuadSPI_FR_DLPFF_MASK), QuadSPI_FR_IPIEF(value)))
#define QuadSPI_BWR_FR_IPIEF(base, value) (BME_BFI32(&QuadSPI_FR_REG(base), ((uint32_t)(value) << QuadSPI_FR_IPIEF_SHIFT), QuadSPI_FR_IPIEF_SHIFT, QuadSPI_FR_IPIEF_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_FR, field IPAEF[7] (W1C)
 *
 * IP Command Trigger during AHB Access Error Flag. Set when the following
 * condition occurs: A write access occurs to the QSPI_IPCR[SEQID] field and the
 * QSPI_SR[AHB_ACC] bit is set. Any command leading to the assertion of the IPAEF flag
 * is ignored.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_FR_IPAEF field. */
#define QuadSPI_RD_FR_IPAEF(base) ((QuadSPI_FR_REG(base) & QuadSPI_FR_IPAEF_MASK) >> QuadSPI_FR_IPAEF_SHIFT)
#define QuadSPI_BRD_FR_IPAEF(base) (BME_UBFX32(&QuadSPI_FR_REG(base), QuadSPI_FR_IPAEF_SHIFT, QuadSPI_FR_IPAEF_WIDTH))

/*! @brief Set the IPAEF field to a new value. */
#define QuadSPI_WR_FR_IPAEF(base, value) (QuadSPI_RMW_FR(base, (QuadSPI_FR_IPAEF_MASK | QuadSPI_FR_TFF_MASK | QuadSPI_FR_IPGEF_MASK | QuadSPI_FR_IPIEF_MASK | QuadSPI_FR_IUEF_MASK | QuadSPI_FR_ABOF_MASK | QuadSPI_FR_AIBSEF_MASK | QuadSPI_FR_AITEF_MASK | QuadSPI_FR_ABSEF_MASK | QuadSPI_FR_RBDF_MASK | QuadSPI_FR_RBOF_MASK | QuadSPI_FR_ILLINE_MASK | QuadSPI_FR_TBUF_MASK | QuadSPI_FR_TBFF_MASK | QuadSPI_FR_DLPFF_MASK), QuadSPI_FR_IPAEF(value)))
#define QuadSPI_BWR_FR_IPAEF(base, value) (BME_BFI32(&QuadSPI_FR_REG(base), ((uint32_t)(value) << QuadSPI_FR_IPAEF_SHIFT), QuadSPI_FR_IPAEF_SHIFT, QuadSPI_FR_IPAEF_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_FR, field IUEF[11] (W1C)
 *
 * IP Command Usage Error Flag: Set when in parallel flash mode the execution of
 * an IP Command is started with more than one pad enabled and the sequence
 * pointed to by the sequence ID contains a WRITE or a WRITE_DDR command. Refer to
 * table for the related commands. Communication with the serial flash device is
 * terminated before the execution of WRITE/WRITE_DDR command by the QuadSPI module.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_FR_IUEF field. */
#define QuadSPI_RD_FR_IUEF(base) ((QuadSPI_FR_REG(base) & QuadSPI_FR_IUEF_MASK) >> QuadSPI_FR_IUEF_SHIFT)
#define QuadSPI_BRD_FR_IUEF(base) (BME_UBFX32(&QuadSPI_FR_REG(base), QuadSPI_FR_IUEF_SHIFT, QuadSPI_FR_IUEF_WIDTH))

/*! @brief Set the IUEF field to a new value. */
#define QuadSPI_WR_FR_IUEF(base, value) (QuadSPI_RMW_FR(base, (QuadSPI_FR_IUEF_MASK | QuadSPI_FR_TFF_MASK | QuadSPI_FR_IPGEF_MASK | QuadSPI_FR_IPIEF_MASK | QuadSPI_FR_IPAEF_MASK | QuadSPI_FR_ABOF_MASK | QuadSPI_FR_AIBSEF_MASK | QuadSPI_FR_AITEF_MASK | QuadSPI_FR_ABSEF_MASK | QuadSPI_FR_RBDF_MASK | QuadSPI_FR_RBOF_MASK | QuadSPI_FR_ILLINE_MASK | QuadSPI_FR_TBUF_MASK | QuadSPI_FR_TBFF_MASK | QuadSPI_FR_DLPFF_MASK), QuadSPI_FR_IUEF(value)))
#define QuadSPI_BWR_FR_IUEF(base, value) (BME_BFI32(&QuadSPI_FR_REG(base), ((uint32_t)(value) << QuadSPI_FR_IUEF_SHIFT), QuadSPI_FR_IUEF_SHIFT, QuadSPI_FR_IUEF_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_FR, field ABOF[12] (W1C)
 *
 * AHB Buffer Overflow Flag: Set when the size of the AHB access exceeds the
 * size of the AHB buffer. This condition can occur only if the QSPI_BUFxCR[ADATSZ]
 * field is programmed incorrectly. The AHB Command leading to this condition is
 * continued until the number of entries according to the QSPI_BUFxCR[ADATSZ]
 * field has been read from the serial flash device. The content of the AHB Buffer
 * is not changed.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_FR_ABOF field. */
#define QuadSPI_RD_FR_ABOF(base) ((QuadSPI_FR_REG(base) & QuadSPI_FR_ABOF_MASK) >> QuadSPI_FR_ABOF_SHIFT)
#define QuadSPI_BRD_FR_ABOF(base) (BME_UBFX32(&QuadSPI_FR_REG(base), QuadSPI_FR_ABOF_SHIFT, QuadSPI_FR_ABOF_WIDTH))

