RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*! @brief Set the ABOF field to a new value. */
#define QuadSPI_WR_FR_ABOF(base, value) (QuadSPI_RMW_FR(base, (QuadSPI_FR_ABOF_MASK | QuadSPI_FR_TFF_MASK | QuadSPI_FR_IPGEF_MASK | QuadSPI_FR_IPIEF_MASK | QuadSPI_FR_IPAEF_MASK | QuadSPI_FR_IUEF_MASK | QuadSPI_FR_AIBSEF_MASK | QuadSPI_FR_AITEF_MASK | QuadSPI_FR_ABSEF_MASK | QuadSPI_FR_RBDF_MASK | QuadSPI_FR_RBOF_MASK | QuadSPI_FR_ILLINE_MASK | QuadSPI_FR_TBUF_MASK | QuadSPI_FR_TBFF_MASK | QuadSPI_FR_DLPFF_MASK), QuadSPI_FR_ABOF(value)))
#define QuadSPI_BWR_FR_ABOF(base, value) (BME_BFI32(&QuadSPI_FR_REG(base), ((uint32_t)(value) << QuadSPI_FR_ABOF_SHIFT), QuadSPI_FR_ABOF_SHIFT, QuadSPI_FR_ABOF_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_FR, field AIBSEF[13] (W1C)
 *
 * AHB Illegal Burst Size Error Flag: Set whenever the total burst size(size x
 * beat) of an AHB transaction is greater than the prefetch data size. The
 * prefecth data size is defined by QSPI_BUFxCR[ADATSZ] or data size mentioned in the
 * sequence pointed to by the SEQID field in case ADATSZ =0. Refer to HBURST
 * Support for more details on hburst feature.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_FR_AIBSEF field. */
#define QuadSPI_RD_FR_AIBSEF(base) ((QuadSPI_FR_REG(base) & QuadSPI_FR_AIBSEF_MASK) >> QuadSPI_FR_AIBSEF_SHIFT)
#define QuadSPI_BRD_FR_AIBSEF(base) (BME_UBFX32(&QuadSPI_FR_REG(base), QuadSPI_FR_AIBSEF_SHIFT, QuadSPI_FR_AIBSEF_WIDTH))

/*! @brief Set the AIBSEF field to a new value. */
#define QuadSPI_WR_FR_AIBSEF(base, value) (QuadSPI_RMW_FR(base, (QuadSPI_FR_AIBSEF_MASK | QuadSPI_FR_TFF_MASK | QuadSPI_FR_IPGEF_MASK | QuadSPI_FR_IPIEF_MASK | QuadSPI_FR_IPAEF_MASK | QuadSPI_FR_IUEF_MASK | QuadSPI_FR_ABOF_MASK | QuadSPI_FR_AITEF_MASK | QuadSPI_FR_ABSEF_MASK | QuadSPI_FR_RBDF_MASK | QuadSPI_FR_RBOF_MASK | QuadSPI_FR_ILLINE_MASK | QuadSPI_FR_TBUF_MASK | QuadSPI_FR_TBFF_MASK | QuadSPI_FR_DLPFF_MASK), QuadSPI_FR_AIBSEF(value)))
#define QuadSPI_BWR_FR_AIBSEF(base, value) (BME_BFI32(&QuadSPI_FR_REG(base), ((uint32_t)(value) << QuadSPI_FR_AIBSEF_SHIFT), QuadSPI_FR_AIBSEF_SHIFT, QuadSPI_FR_AIBSEF_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_FR, field AITEF[14] (W1C)
 *
 * AHB Illegal transaction error flag.Set whenever there is no response
 * generated from QSPI to AHB bus in case of illegal transaction and the watchdog timer
 * expires.The timer value is taken as parameter.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_FR_AITEF field. */
#define QuadSPI_RD_FR_AITEF(base) ((QuadSPI_FR_REG(base) & QuadSPI_FR_AITEF_MASK) >> QuadSPI_FR_AITEF_SHIFT)
#define QuadSPI_BRD_FR_AITEF(base) (BME_UBFX32(&QuadSPI_FR_REG(base), QuadSPI_FR_AITEF_SHIFT, QuadSPI_FR_AITEF_WIDTH))

/*! @brief Set the AITEF field to a new value. */
#define QuadSPI_WR_FR_AITEF(base, value) (QuadSPI_RMW_FR(base, (QuadSPI_FR_AITEF_MASK | QuadSPI_FR_TFF_MASK | QuadSPI_FR_IPGEF_MASK | QuadSPI_FR_IPIEF_MASK | QuadSPI_FR_IPAEF_MASK | QuadSPI_FR_IUEF_MASK | QuadSPI_FR_ABOF_MASK | QuadSPI_FR_AIBSEF_MASK | QuadSPI_FR_ABSEF_MASK | QuadSPI_FR_RBDF_MASK | QuadSPI_FR_RBOF_MASK | QuadSPI_FR_ILLINE_MASK | QuadSPI_FR_TBUF_MASK | QuadSPI_FR_TBFF_MASK | QuadSPI_FR_DLPFF_MASK), QuadSPI_FR_AITEF(value)))
#define QuadSPI_BWR_FR_AITEF(base, value) (BME_BFI32(&QuadSPI_FR_REG(base), ((uint32_t)(value) << QuadSPI_FR_AITEF_SHIFT), QuadSPI_FR_AITEF_SHIFT, QuadSPI_FR_AITEF_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_FR, field ABSEF[15] (W1C)
 *
 * AHB Sequence Error Flag: Set when the execution of an AHB Command is started
 * with a WRITE or WRITE_DDR Command in the sequence pointed to by the
 * QSPI_BUFxCR register. (QSPI_BUFxCR implies anyone of
 * QSPI_BUF0CR/QSPI_BUF1CR/QSPI_BUF2CR/QSPI_BUF3CR.) Communication with the serial flash device is terminated before
 * the execution of WRITE/WRITE_DDR command by the QuadSPI module. The AHB bus
 * request which triggered this command is answered with an ERROR response.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_FR_ABSEF field. */
#define QuadSPI_RD_FR_ABSEF(base) ((QuadSPI_FR_REG(base) & QuadSPI_FR_ABSEF_MASK) >> QuadSPI_FR_ABSEF_SHIFT)
#define QuadSPI_BRD_FR_ABSEF(base) (BME_UBFX32(&QuadSPI_FR_REG(base), QuadSPI_FR_ABSEF_SHIFT, QuadSPI_FR_ABSEF_WIDTH))

/*! @brief Set the ABSEF field to a new value. */
#define QuadSPI_WR_FR_ABSEF(base, value) (QuadSPI_RMW_FR(base, (QuadSPI_FR_ABSEF_MASK | QuadSPI_FR_TFF_MASK | QuadSPI_FR_IPGEF_MASK | QuadSPI_FR_IPIEF_MASK | QuadSPI_FR_IPAEF_MASK | QuadSPI_FR_IUEF_MASK | QuadSPI_FR_ABOF_MASK | QuadSPI_FR_AIBSEF_MASK | QuadSPI_FR_AITEF_MASK | QuadSPI_FR_RBDF_MASK | QuadSPI_FR_RBOF_MASK | QuadSPI_FR_ILLINE_MASK | QuadSPI_FR_TBUF_MASK | QuadSPI_FR_TBFF_MASK | QuadSPI_FR_DLPFF_MASK), QuadSPI_FR_ABSEF(value)))
#define QuadSPI_BWR_FR_ABSEF(base, value) (BME_BFI32(&QuadSPI_FR_REG(base), ((uint32_t)(value) << QuadSPI_FR_ABSEF_SHIFT), QuadSPI_FR_ABSEF_SHIFT, QuadSPI_FR_ABSEF_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_FR, field RBDF[16] (W1C)
 *
 * RX Buffer Drain Flag: Will be set if the QuadSPI_SR[RXWE] status bit is
 * asserted. Writing 1 into this bit triggers one of the following actions: If the RX
 * Buffer has up to QuadSPI_RBCT[WMRK] valid entries then the flag is cleared. If
 * the RX Buffer has more than QuadSPI_RBCT[WMRK] valid entries and the
 * QuadSPI_RSER[RBDDE] bit is not set (flag driven mode) a RX Buffer POP event is
 * triggered. The flag remains set if the RX Buffer contains more than
 * QuadSPI_RBCT[WMRK] valid entries after the RX Buffer POP event is finished. The flag is cleared
 * if the RX Buffer contains less than or equal to QuadSPI_RBCT[WMRK] valid
 * entries after the RX Buffer POP event is finished. Refer to "Receive Buffer Drain
 * Interrupt or DMA Request" section in Normal Mode Interrupt and DMA Requests,
 * for details.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_FR_RBDF field. */
#define QuadSPI_RD_FR_RBDF(base) ((QuadSPI_FR_REG(base) & QuadSPI_FR_RBDF_MASK) >> QuadSPI_FR_RBDF_SHIFT)
#define QuadSPI_BRD_FR_RBDF(base) (BME_UBFX32(&QuadSPI_FR_REG(base), QuadSPI_FR_RBDF_SHIFT, QuadSPI_FR_RBDF_WIDTH))

