RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*
 * Constants & macros for individual QuadSPI_SFA1AD bitfields
 */

/*!
 * @name Register QuadSPI_SFA1AD, field TPADA1[31:10] (RW)
 *
 * Top address for Serial Flash A1. In effect, TPADxx is the first location of
 * the next memory.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SFA1AD_TPADA1 field. */
#define QuadSPI_RD_SFA1AD_TPADA1(base) ((QuadSPI_SFA1AD_REG(base) & QuadSPI_SFA1AD_TPADA1_MASK) >> QuadSPI_SFA1AD_TPADA1_SHIFT)
#define QuadSPI_BRD_SFA1AD_TPADA1(base) (QuadSPI_RD_SFA1AD_TPADA1(base))

/*! @brief Set the TPADA1 field to a new value. */
#define QuadSPI_WR_SFA1AD_TPADA1(base, value) (QuadSPI_RMW_SFA1AD(base, QuadSPI_SFA1AD_TPADA1_MASK, QuadSPI_SFA1AD_TPADA1(value)))
#define QuadSPI_BWR_SFA1AD_TPADA1(base, value) (QuadSPI_WR_SFA1AD_TPADA1(base, value))
/*@}*/

/*******************************************************************************
 * QuadSPI_SFA2AD - Serial Flash A2 Top Address
 ******************************************************************************/

/*!
 * @brief QuadSPI_SFA2AD - Serial Flash A2 Top Address (RW)
 *
 * Reset value: 0x6FFFFC00U
 *
 * The QSPI_SFA2AD register provides the address mapping for the serial flash
 * A2.The difference between QSPI_SFA2AD[TPADA2] and QSPI_SFA1AD[TPADA1] defines
 * the size of the memory map for serial flash A2. Write: QSPI_SR[IP_ACC] = 0
 * QSPI_SR[AHB_ACC] = 0
 */
/*!
 * @name Constants and macros for entire QuadSPI_SFA2AD register
 */
/*@{*/
#define QuadSPI_RD_SFA2AD(base)  (QuadSPI_SFA2AD_REG(base))
#define QuadSPI_WR_SFA2AD(base, value) (QuadSPI_SFA2AD_REG(base) = (value))
#define QuadSPI_RMW_SFA2AD(base, mask, value) (QuadSPI_WR_SFA2AD(base, (QuadSPI_RD_SFA2AD(base) & ~(mask)) | (value)))
#define QuadSPI_SET_SFA2AD(base, value) (BME_OR32(&QuadSPI_SFA2AD_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_SFA2AD(base, value) (BME_AND32(&QuadSPI_SFA2AD_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_SFA2AD(base, value) (BME_XOR32(&QuadSPI_SFA2AD_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_SFA2AD bitfields
 */

/*!
 * @name Register QuadSPI_SFA2AD, field TPADA2[31:10] (RW)
 *
 * Top address for Serial Flash A2. In effect, TPxxAD is the first location of
 * the next memory.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SFA2AD_TPADA2 field. */
#define QuadSPI_RD_SFA2AD_TPADA2(base) ((QuadSPI_SFA2AD_REG(base) & QuadSPI_SFA2AD_TPADA2_MASK) >> QuadSPI_SFA2AD_TPADA2_SHIFT)
#define QuadSPI_BRD_SFA2AD_TPADA2(base) (QuadSPI_RD_SFA2AD_TPADA2(base))

/*! @brief Set the TPADA2 field to a new value. */
#define QuadSPI_WR_SFA2AD_TPADA2(base, value) (QuadSPI_RMW_SFA2AD(base, QuadSPI_SFA2AD_TPADA2_MASK, QuadSPI_SFA2AD_TPADA2(value)))
#define QuadSPI_BWR_SFA2AD_TPADA2(base, value) (QuadSPI_WR_SFA2AD_TPADA2(base, value))
/*@}*/

/*******************************************************************************
 * QuadSPI_SFB1AD - Serial Flash B1Top Address
 ******************************************************************************/

/*!
 * @brief QuadSPI_SFB1AD - Serial Flash B1Top Address (RW)
 *
 * Reset value: 0x6FFFFC00U
 *
 * The QSPI_SFB1AD register provides the address mapping for the serial flash
 * B1.The difference between QSPI_SFB1AD[TPADB1] and QSPI_SFA2AD[TPADA2] defines
 * the size of the memory map for serial flash B1. Write: QSPI_SR[IP_ACC] = 0
 * QSPI_SR[AHB_ACC] = 0
 */
/*!
 * @name Constants and macros for entire QuadSPI_SFB1AD register
 */
/*@{*/
#define QuadSPI_RD_SFB1AD(base)  (QuadSPI_SFB1AD_REG(base))
#define QuadSPI_WR_SFB1AD(base, value) (QuadSPI_SFB1AD_REG(base) = (value))
#define QuadSPI_RMW_SFB1AD(base, mask, value) (QuadSPI_WR_SFB1AD(base, (QuadSPI_RD_SFB1AD(base) & ~(mask)) | (value)))
#define QuadSPI_SET_SFB1AD(base, value) (BME_OR32(&QuadSPI_SFB1AD_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_SFB1AD(base, value) (BME_AND32(&QuadSPI_SFB1AD_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_SFB1AD(base, value) (BME_XOR32(&QuadSPI_SFB1AD_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_SFB1AD bitfields
 */

/*!
 * @name Register QuadSPI_SFB1AD, field TPADB1[31:10] (RW)
 *
 * Top address for Serial Flash B1.In effect, TPxxAD is the first location of
 * the next memory.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SFB1AD_TPADB1 field. */
#define QuadSPI_RD_SFB1AD_TPADB1(base) ((QuadSPI_SFB1AD_REG(base) & QuadSPI_SFB1AD_TPADB1_MASK) >> QuadSPI_SFB1AD_TPADB1_SHIFT)
#define QuadSPI_BRD_SFB1AD_TPADB1(base) (QuadSPI_RD_SFB1AD_TPADB1(base))

/*! @brief Set the TPADB1 field to a new value. */
#define QuadSPI_WR_SFB1AD_TPADB1(base, value) (QuadSPI_RMW_SFB1AD(base, QuadSPI_SFB1AD_TPADB1_MASK, QuadSPI_SFB1AD_TPADB1(value)))
#define QuadSPI_BWR_SFB1AD_TPADB1(base, value) (QuadSPI_WR_SFB1AD_TPADB1(base, value))
/*@}*/

/*******************************************************************************
 * QuadSPI_SFB2AD - Serial Flash B2Top Address
 ******************************************************************************/

/*!
 * @brief QuadSPI_SFB2AD - Serial Flash B2Top Address (RW)
 *
 * Reset value: 0x6FFFFC00U
 *
 * The QSPI_SFB2AD register provides the address mapping for the serial flash
 * B2.The difference between QSPI_SFB2AD[TPADB2] and QSPI_SFB1AD[TPADB1] defines
 * the size of the memory map for serial flash B2. Write: QSPI_SR[IP_ACC] = 0
 * QSPI_SR[AHB_ACC] = 0
 */
/*!
 * @name Constants and macros for entire QuadSPI_SFB2AD register
 */
/*@{*/
#define QuadSPI_RD_SFB2AD(base)  (QuadSPI_SFB2AD_REG(base))
#define QuadSPI_WR_SFB2AD(base, value) (QuadSPI_SFB2AD_REG(base) = (value))
#define QuadSPI_RMW_SFB2AD(base, mask, value) (QuadSPI_WR_SFB2AD(base, (QuadSPI_RD_SFB2AD(base) & ~(mask)) | (value)))
#define QuadSPI_SET_SFB2AD(base, value) (BME_OR32(&QuadSPI_SFB2AD_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_SFB2AD(base, value) (BME_AND32(&QuadSPI_SFB2AD_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_SFB2AD(base, value) (BME_XOR32(&QuadSPI_SFB2AD_REG(base), (uint32_t)(value)))
/*@}*/

