RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*
 * Constants & macros for individual QuadSPI_SFB2AD bitfields
 */

/*!
 * @name Register QuadSPI_SFB2AD, field TPADB2[31:10] (RW)
 *
 * Top address for Serial Flash B2. In effect, TPxxAD is the first location of
 * the next memory.
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_SFB2AD_TPADB2 field. */
#define QuadSPI_RD_SFB2AD_TPADB2(base) ((QuadSPI_SFB2AD_REG(base) & QuadSPI_SFB2AD_TPADB2_MASK) >> QuadSPI_SFB2AD_TPADB2_SHIFT)
#define QuadSPI_BRD_SFB2AD_TPADB2(base) (QuadSPI_RD_SFB2AD_TPADB2(base))

/*! @brief Set the TPADB2 field to a new value. */
#define QuadSPI_WR_SFB2AD_TPADB2(base, value) (QuadSPI_RMW_SFB2AD(base, QuadSPI_SFB2AD_TPADB2_MASK, QuadSPI_SFB2AD_TPADB2(value)))
#define QuadSPI_BWR_SFB2AD_TPADB2(base, value) (QuadSPI_WR_SFB2AD_TPADB2(base, value))
/*@}*/

/*******************************************************************************
 * QuadSPI_DLPR - Data Learn Pattern Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_DLPR - Data Learn Pattern Register (RW)
 *
 * Reset value: 0xAA553443U
 *
 * The QSPI_DLPR register contains the information of the data to be used for
 * Data Learning. Write: QSPI_SR[IP_ACC] = 0 QSPI_SR[AHB_ACC] = 0
 */
/*!
 * @name Constants and macros for entire QuadSPI_DLPR register
 */
/*@{*/
#define QuadSPI_RD_DLPR(base)    (QuadSPI_DLPR_REG(base))
#define QuadSPI_WR_DLPR(base, value) (QuadSPI_DLPR_REG(base) = (value))
#define QuadSPI_RMW_DLPR(base, mask, value) (QuadSPI_WR_DLPR(base, (QuadSPI_RD_DLPR(base) & ~(mask)) | (value)))
#define QuadSPI_SET_DLPR(base, value) (BME_OR32(&QuadSPI_DLPR_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_DLPR(base, value) (BME_AND32(&QuadSPI_DLPR_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_DLPR(base, value) (BME_XOR32(&QuadSPI_DLPR_REG(base), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * QuadSPI_RBDR - RX Buffer Data Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_RBDR - RX Buffer Data Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The QuadSPI_RBDR registers provide access to the individual entries in the RX
 * Buffer. Refer to for the byte ordering scheme. QuadSPI_RBDR0 corresponds to
 * the actual position of the read pointer within the RX Buffer. The number of
 * valid entries available depends from the number of RX Buffer entries implemented
 * and from the number of valid buffer entries available in the RX Buffer.
 * Example 1, RX Buffer filled completely with 16 words: In this case the address range
 * for valid read access extends from QuadSPI_RBDR0 to QuadSPI_RBDR15. Example
 * 2, RX Buffer filled with 5 valid words: RX Buffer fill level
 * QuadSPI_RBSR[RDBFL] is 5. In this case an access to QuadSPI_RBDR4 provides the last valid entry.
 * Any access beyond the range of valid RX Buffer entries provides undefined
 * results.
 */
/*!
 * @name Constants and macros for entire QuadSPI_RBDR register
 */
/*@{*/
#define QuadSPI_RD_RBDR(base, index) (QuadSPI_RBDR_REG(base, index))
/*@}*/

/*******************************************************************************
 * QuadSPI_LUTKEY - LUT Key Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_LUTKEY - LUT Key Register (RW)
 *
 * Reset value: 0x5AF05AF0U
 *
 * The LUT Key register contains the key to lock and unlock the Look-up-table.
 * Refer to Look-up Table for details. Write: Anytime
 */
/*!
 * @name Constants and macros for entire QuadSPI_LUTKEY register
 */
/*@{*/
#define QuadSPI_RD_LUTKEY(base)  (QuadSPI_LUTKEY_REG(base))
#define QuadSPI_WR_LUTKEY(base, value) (QuadSPI_LUTKEY_REG(base) = (value))
#define QuadSPI_RMW_LUTKEY(base, mask, value) (QuadSPI_WR_LUTKEY(base, (QuadSPI_RD_LUTKEY(base) & ~(mask)) | (value)))
#define QuadSPI_SET_LUTKEY(base, value) (BME_OR32(&QuadSPI_LUTKEY_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_LUTKEY(base, value) (BME_AND32(&QuadSPI_LUTKEY_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_LUTKEY(base, value) (BME_XOR32(&QuadSPI_LUTKEY_REG(base), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * QuadSPI_LCKCR - LUT Lock Configuration Register
 ******************************************************************************/

/*!
 * @brief QuadSPI_LCKCR - LUT Lock Configuration Register (RW)
 *
 * Reset value: 0x00000002U
 *
 * The LUT lock configuration register is used along with QSPI_LUTKEY register
 * to lock or unlock the LUT. This register has to be written immediately after
 * QSPI_LUTKEY register for the lock or unlock operation to be successful. Refer to
 * Look-up Table for details. Setting both the LOCK and UNLOCK bits as "00" or
 * "11" is not allowed. Write: Just after writing the LUT Key Register
 * (QSPI_LUTKEY)
 */
/*!
 * @name Constants and macros for entire QuadSPI_LCKCR register
 */
/*@{*/
#define QuadSPI_RD_LCKCR(base)   (QuadSPI_LCKCR_REG(base))
#define QuadSPI_WR_LCKCR(base, value) (QuadSPI_LCKCR_REG(base) = (value))
#define QuadSPI_RMW_LCKCR(base, mask, value) (QuadSPI_WR_LCKCR(base, (QuadSPI_RD_LCKCR(base) & ~(mask)) | (value)))
#define QuadSPI_SET_LCKCR(base, value) (BME_OR32(&QuadSPI_LCKCR_REG(base), (uint32_t)(value)))
#define QuadSPI_CLR_LCKCR(base, value) (BME_AND32(&QuadSPI_LCKCR_REG(base), (uint32_t)(~(value))))
#define QuadSPI_TOG_LCKCR(base, value) (BME_XOR32(&QuadSPI_LCKCR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_LCKCR bitfields
 */

/*!
 * @name Register QuadSPI_LCKCR, field LOCK[0] (RW)
 *
 * Locks the LUT when the following condition is met: This register is written
 * just after the LUTKEYLUT Key Register The LUT key register was written with
 * 0x5AF05AF0 key
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_LCKCR_LOCK field. */
#define QuadSPI_RD_LCKCR_LOCK(base) ((QuadSPI_LCKCR_REG(base) & QuadSPI_LCKCR_LOCK_MASK) >> QuadSPI_LCKCR_LOCK_SHIFT)
#define QuadSPI_BRD_LCKCR_LOCK(base) (BME_UBFX32(&QuadSPI_LCKCR_REG(base), QuadSPI_LCKCR_LOCK_SHIFT, QuadSPI_LCKCR_LOCK_WIDTH))

