RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*! @brief Set the LOCK field to a new value. */
#define QuadSPI_WR_LCKCR_LOCK(base, value) (QuadSPI_RMW_LCKCR(base, QuadSPI_LCKCR_LOCK_MASK, QuadSPI_LCKCR_LOCK(value)))
#define QuadSPI_BWR_LCKCR_LOCK(base, value) (BME_BFI32(&QuadSPI_LCKCR_REG(base), ((uint32_t)(value) << QuadSPI_LCKCR_LOCK_SHIFT), QuadSPI_LCKCR_LOCK_SHIFT, QuadSPI_LCKCR_LOCK_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_LCKCR, field UNLOCK[1] (RW)
 *
 * Unlocks the LUT when the following two conditions are met: 1. This register
 * is written just after the LUTKEYLUT Key Register 2. The LUT key register was
 * written with 0x5AF05AF0 key
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_LCKCR_UNLOCK field. */
#define QuadSPI_RD_LCKCR_UNLOCK(base) ((QuadSPI_LCKCR_REG(base) & QuadSPI_LCKCR_UNLOCK_MASK) >> QuadSPI_LCKCR_UNLOCK_SHIFT)
#define QuadSPI_BRD_LCKCR_UNLOCK(base) (BME_UBFX32(&QuadSPI_LCKCR_REG(base), QuadSPI_LCKCR_UNLOCK_SHIFT, QuadSPI_LCKCR_UNLOCK_WIDTH))

/*! @brief Set the UNLOCK field to a new value. */
#define QuadSPI_WR_LCKCR_UNLOCK(base, value) (QuadSPI_RMW_LCKCR(base, QuadSPI_LCKCR_UNLOCK_MASK, QuadSPI_LCKCR_UNLOCK(value)))
#define QuadSPI_BWR_LCKCR_UNLOCK(base, value) (BME_BFI32(&QuadSPI_LCKCR_REG(base), ((uint32_t)(value) << QuadSPI_LCKCR_UNLOCK_SHIFT), QuadSPI_LCKCR_UNLOCK_SHIFT, QuadSPI_LCKCR_UNLOCK_WIDTH))
/*@}*/

/*******************************************************************************
 * QuadSPI_LUT - Look-up Table register
 ******************************************************************************/

/*!
 * @brief QuadSPI_LUT - Look-up Table register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The LUT registers are a look-up-table for sequences of instructions. The
 * programmable sequence engine executes the instructions in these sequences to
 * generate a valid serial flash transaction. There are a total of 64 LUT registers.
 * These 64 registers are divided into groups of 4 registers that make a valid
 * sequence. Therefore, QSPI_LUT[0], QSPI_LUT[4], QSPI_LUT[8] ..... QSPI_LUT[60] are
 * the starting registers of a valid sequence. Each of these sets of 4 registers
 * can have a maximum of 8 instructions. Reset value of the register shown below
 * is only applicable to LUT2 to LUT63. A maximum of 16 sequences can be defined
 * at one time. Look-up Table describes the LUT registers in detail.The reset
 * values for LUT0 and LUT1 are 0818_0403h and 2400_1C08h, respectively. Write:
 * Once the LUT is unlocked
 */
/*!
 * @name Constants and macros for entire QuadSPI_LUT register
 */
/*@{*/
#define QuadSPI_RD_LUT(base, index) (QuadSPI_LUT_REG(base, index))
#define QuadSPI_WR_LUT(base, index, value) (QuadSPI_LUT_REG(base, index) = (value))
#define QuadSPI_RMW_LUT(base, index, mask, value) (QuadSPI_WR_LUT(base, index, (QuadSPI_RD_LUT(base, index) & ~(mask)) | (value)))
#define QuadSPI_SET_LUT(base, index, value) (BME_OR32(&QuadSPI_LUT_REG(base, index), (uint32_t)(value)))
#define QuadSPI_CLR_LUT(base, index, value) (BME_AND32(&QuadSPI_LUT_REG(base, index), (uint32_t)(~(value))))
#define QuadSPI_TOG_LUT(base, index, value) (BME_XOR32(&QuadSPI_LUT_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual QuadSPI_LUT bitfields
 */

/*!
 * @name Register QuadSPI_LUT, field OPRND0[7:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_LUT_OPRND0 field. */
#define QuadSPI_RD_LUT_OPRND0(base, index) ((QuadSPI_LUT_REG(base, index) & QuadSPI_LUT_OPRND0_MASK) >> QuadSPI_LUT_OPRND0_SHIFT)
#define QuadSPI_BRD_LUT_OPRND0(base, index) (BME_UBFX32(&QuadSPI_LUT_REG(base, index), QuadSPI_LUT_OPRND0_SHIFT, QuadSPI_LUT_OPRND0_WIDTH))

/*! @brief Set the OPRND0 field to a new value. */
#define QuadSPI_WR_LUT_OPRND0(base, index, value) (QuadSPI_RMW_LUT(base, index, QuadSPI_LUT_OPRND0_MASK, QuadSPI_LUT_OPRND0(value)))
#define QuadSPI_BWR_LUT_OPRND0(base, index, value) (BME_BFI32(&QuadSPI_LUT_REG(base, index), ((uint32_t)(value) << QuadSPI_LUT_OPRND0_SHIFT), QuadSPI_LUT_OPRND0_SHIFT, QuadSPI_LUT_OPRND0_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_LUT, field PAD0[9:8] (RW)
 *
 * Values:
 * - 0b00 - 1 Pad
 * - 0b01 - 2 Pads
 * - 0b10 - 4 Pads
 * - 0b11 - 8 Pads
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_LUT_PAD0 field. */
#define QuadSPI_RD_LUT_PAD0(base, index) ((QuadSPI_LUT_REG(base, index) & QuadSPI_LUT_PAD0_MASK) >> QuadSPI_LUT_PAD0_SHIFT)
#define QuadSPI_BRD_LUT_PAD0(base, index) (BME_UBFX32(&QuadSPI_LUT_REG(base, index), QuadSPI_LUT_PAD0_SHIFT, QuadSPI_LUT_PAD0_WIDTH))

/*! @brief Set the PAD0 field to a new value. */
#define QuadSPI_WR_LUT_PAD0(base, index, value) (QuadSPI_RMW_LUT(base, index, QuadSPI_LUT_PAD0_MASK, QuadSPI_LUT_PAD0(value)))
#define QuadSPI_BWR_LUT_PAD0(base, index, value) (BME_BFI32(&QuadSPI_LUT_REG(base, index), ((uint32_t)(value) << QuadSPI_LUT_PAD0_SHIFT), QuadSPI_LUT_PAD0_SHIFT, QuadSPI_LUT_PAD0_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_LUT, field INSTR0[15:10] (RW)
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_LUT_INSTR0 field. */
#define QuadSPI_RD_LUT_INSTR0(base, index) ((QuadSPI_LUT_REG(base, index) & QuadSPI_LUT_INSTR0_MASK) >> QuadSPI_LUT_INSTR0_SHIFT)
#define QuadSPI_BRD_LUT_INSTR0(base, index) (BME_UBFX32(&QuadSPI_LUT_REG(base, index), QuadSPI_LUT_INSTR0_SHIFT, QuadSPI_LUT_INSTR0_WIDTH))

/*! @brief Set the INSTR0 field to a new value. */
#define QuadSPI_WR_LUT_INSTR0(base, index, value) (QuadSPI_RMW_LUT(base, index, QuadSPI_LUT_INSTR0_MASK, QuadSPI_LUT_INSTR0(value)))
#define QuadSPI_BWR_LUT_INSTR0(base, index, value) (BME_BFI32(&QuadSPI_LUT_REG(base, index), ((uint32_t)(value) << QuadSPI_LUT_INSTR0_SHIFT), QuadSPI_LUT_INSTR0_SHIFT, QuadSPI_LUT_INSTR0_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_LUT, field OPRND1[23:16] (RW)
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_LUT_OPRND1 field. */
#define QuadSPI_RD_LUT_OPRND1(base, index) ((QuadSPI_LUT_REG(base, index) & QuadSPI_LUT_OPRND1_MASK) >> QuadSPI_LUT_OPRND1_SHIFT)
#define QuadSPI_BRD_LUT_OPRND1(base, index) (BME_UBFX32(&QuadSPI_LUT_REG(base, index), QuadSPI_LUT_OPRND1_SHIFT, QuadSPI_LUT_OPRND1_WIDTH))

/*! @brief Set the OPRND1 field to a new value. */
#define QuadSPI_WR_LUT_OPRND1(base, index, value) (QuadSPI_RMW_LUT(base, index, QuadSPI_LUT_OPRND1_MASK, QuadSPI_LUT_OPRND1(value)))
#define QuadSPI_BWR_LUT_OPRND1(base, index, value) (BME_BFI32(&QuadSPI_LUT_REG(base, index), ((uint32_t)(value) << QuadSPI_LUT_OPRND1_SHIFT), QuadSPI_LUT_OPRND1_SHIFT, QuadSPI_LUT_OPRND1_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_LUT, field PAD1[25:24] (RW)
 *
 * Values:
 * - 0b00 - 1 Pad
 * - 0b01 - 2 Pads
 * - 0b10 - 4 Pads
 * - 0b11 - 8 Pads
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_LUT_PAD1 field. */
#define QuadSPI_RD_LUT_PAD1(base, index) ((QuadSPI_LUT_REG(base, index) & QuadSPI_LUT_PAD1_MASK) >> QuadSPI_LUT_PAD1_SHIFT)
#define QuadSPI_BRD_LUT_PAD1(base, index) (BME_UBFX32(&QuadSPI_LUT_REG(base, index), QuadSPI_LUT_PAD1_SHIFT, QuadSPI_LUT_PAD1_WIDTH))

/*! @brief Set the PAD1 field to a new value. */
#define QuadSPI_WR_LUT_PAD1(base, index, value) (QuadSPI_RMW_LUT(base, index, QuadSPI_LUT_PAD1_MASK, QuadSPI_LUT_PAD1(value)))
#define QuadSPI_BWR_LUT_PAD1(base, index, value) (BME_BFI32(&QuadSPI_LUT_REG(base, index), ((uint32_t)(value) << QuadSPI_LUT_PAD1_SHIFT), QuadSPI_LUT_PAD1_SHIFT, QuadSPI_LUT_PAD1_WIDTH))
/*@}*/

/*!
 * @name Register QuadSPI_LUT, field INSTR1[31:26] (RW)
 */
/*@{*/
/*! @brief Read current value of the QuadSPI_LUT_INSTR1 field. */
#define QuadSPI_RD_LUT_INSTR1(base, index) ((QuadSPI_LUT_REG(base, index) & QuadSPI_LUT_INSTR1_MASK) >> QuadSPI_LUT_INSTR1_SHIFT)
#define QuadSPI_BRD_LUT_INSTR1(base, index) (BME_UBFX32(&QuadSPI_LUT_REG(base, index), QuadSPI_LUT_INSTR1_SHIFT, QuadSPI_LUT_INSTR1_WIDTH))

/*! @brief Set the INSTR1 field to a new value. */
#define QuadSPI_WR_LUT_INSTR1(base, index, value) (QuadSPI_RMW_LUT(base, index, QuadSPI_LUT_INSTR1_MASK, QuadSPI_LUT_INSTR1(value)))
#define QuadSPI_BWR_LUT_INSTR1(base, index, value) (BME_BFI32(&QuadSPI_LUT_REG(base, index), ((uint32_t)(value) << QuadSPI_LUT_INSTR1_SHIFT), QuadSPI_LUT_INSTR1_SHIFT, QuadSPI_LUT_INSTR1_WIDTH))
/*@}*/

