RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*! @brief Set the LRW field to a new value. */
#define RTC_WR_WAR_LRW(base, value) (RTC_RMW_WAR(base, RTC_WAR_LRW_MASK, RTC_WAR_LRW(value)))
#define RTC_BWR_WAR_LRW(base, value) (BME_BFI32(&RTC_WAR_REG(base), ((uint32_t)(value) << RTC_WAR_LRW_SHIFT), RTC_WAR_LRW_SHIFT, RTC_WAR_LRW_WIDTH))
/*@}*/

/*!
 * @name Register RTC_WAR, field IERW[7] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Writes to the Interupt Enable Register are ignored.
 * - 0b1 - Writes to the Interrupt Enable Register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_WAR_IERW field. */
#define RTC_RD_WAR_IERW(base) ((RTC_WAR_REG(base) & RTC_WAR_IERW_MASK) >> RTC_WAR_IERW_SHIFT)
#define RTC_BRD_WAR_IERW(base) (BME_UBFX32(&RTC_WAR_REG(base), RTC_WAR_IERW_SHIFT, RTC_WAR_IERW_WIDTH))

/*! @brief Set the IERW field to a new value. */
#define RTC_WR_WAR_IERW(base, value) (RTC_RMW_WAR(base, RTC_WAR_IERW_MASK, RTC_WAR_IERW(value)))
#define RTC_BWR_WAR_IERW(base, value) (BME_BFI32(&RTC_WAR_REG(base), ((uint32_t)(value) << RTC_WAR_IERW_SHIFT), RTC_WAR_IERW_SHIFT, RTC_WAR_IERW_WIDTH))
/*@}*/

/*******************************************************************************
 * RTC_RAR - RTC Read Access Register
 ******************************************************************************/

/*!
 * @brief RTC_RAR - RTC Read Access Register (RW)
 *
 * Reset value: 0x000000FFU
 */
/*!
 * @name Constants and macros for entire RTC_RAR register
 */
/*@{*/
#define RTC_RD_RAR(base)         (RTC_RAR_REG(base))
#define RTC_WR_RAR(base, value)  (RTC_RAR_REG(base) = (value))
#define RTC_RMW_RAR(base, mask, value) (RTC_WR_RAR(base, (RTC_RD_RAR(base) & ~(mask)) | (value)))
#define RTC_SET_RAR(base, value) (BME_OR32(&RTC_RAR_REG(base), (uint32_t)(value)))
#define RTC_CLR_RAR(base, value) (BME_AND32(&RTC_RAR_REG(base), (uint32_t)(~(value))))
#define RTC_TOG_RAR(base, value) (BME_XOR32(&RTC_RAR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RTC_RAR bitfields
 */

/*!
 * @name Register RTC_RAR, field TSRR[0] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Reads to the Time Seconds Register are ignored.
 * - 0b1 - Reads to the Time Seconds Register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_TSRR field. */
#define RTC_RD_RAR_TSRR(base) ((RTC_RAR_REG(base) & RTC_RAR_TSRR_MASK) >> RTC_RAR_TSRR_SHIFT)
#define RTC_BRD_RAR_TSRR(base) (BME_UBFX32(&RTC_RAR_REG(base), RTC_RAR_TSRR_SHIFT, RTC_RAR_TSRR_WIDTH))

/*! @brief Set the TSRR field to a new value. */
#define RTC_WR_RAR_TSRR(base, value) (RTC_RMW_RAR(base, RTC_RAR_TSRR_MASK, RTC_RAR_TSRR(value)))
#define RTC_BWR_RAR_TSRR(base, value) (BME_BFI32(&RTC_RAR_REG(base), ((uint32_t)(value) << RTC_RAR_TSRR_SHIFT), RTC_RAR_TSRR_SHIFT, RTC_RAR_TSRR_WIDTH))
/*@}*/

/*!
 * @name Register RTC_RAR, field TPRR[1] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Reads to the Time Pprescaler Register are ignored.
 * - 0b1 - Reads to the Time Prescaler Register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_TPRR field. */
#define RTC_RD_RAR_TPRR(base) ((RTC_RAR_REG(base) & RTC_RAR_TPRR_MASK) >> RTC_RAR_TPRR_SHIFT)
#define RTC_BRD_RAR_TPRR(base) (BME_UBFX32(&RTC_RAR_REG(base), RTC_RAR_TPRR_SHIFT, RTC_RAR_TPRR_WIDTH))

/*! @brief Set the TPRR field to a new value. */
#define RTC_WR_RAR_TPRR(base, value) (RTC_RMW_RAR(base, RTC_RAR_TPRR_MASK, RTC_RAR_TPRR(value)))
#define RTC_BWR_RAR_TPRR(base, value) (BME_BFI32(&RTC_RAR_REG(base), ((uint32_t)(value) << RTC_RAR_TPRR_SHIFT), RTC_RAR_TPRR_SHIFT, RTC_RAR_TPRR_WIDTH))
/*@}*/

/*!
 * @name Register RTC_RAR, field TARR[2] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Reads to the Time Alarm Register are ignored.
 * - 0b1 - Reads to the Time Alarm Register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_TARR field. */
#define RTC_RD_RAR_TARR(base) ((RTC_RAR_REG(base) & RTC_RAR_TARR_MASK) >> RTC_RAR_TARR_SHIFT)
#define RTC_BRD_RAR_TARR(base) (BME_UBFX32(&RTC_RAR_REG(base), RTC_RAR_TARR_SHIFT, RTC_RAR_TARR_WIDTH))

/*! @brief Set the TARR field to a new value. */
#define RTC_WR_RAR_TARR(base, value) (RTC_RMW_RAR(base, RTC_RAR_TARR_MASK, RTC_RAR_TARR(value)))
#define RTC_BWR_RAR_TARR(base, value) (BME_BFI32(&RTC_RAR_REG(base), ((uint32_t)(value) << RTC_RAR_TARR_SHIFT), RTC_RAR_TARR_SHIFT, RTC_RAR_TARR_WIDTH))
/*@}*/

/*!
 * @name Register RTC_RAR, field TCRR[3] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Reads to the Time Compensation Register are ignored.
 * - 0b1 - Reads to the Time Compensation Register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_TCRR field. */
#define RTC_RD_RAR_TCRR(base) ((RTC_RAR_REG(base) & RTC_RAR_TCRR_MASK) >> RTC_RAR_TCRR_SHIFT)
#define RTC_BRD_RAR_TCRR(base) (BME_UBFX32(&RTC_RAR_REG(base), RTC_RAR_TCRR_SHIFT, RTC_RAR_TCRR_WIDTH))

/*! @brief Set the TCRR field to a new value. */
#define RTC_WR_RAR_TCRR(base, value) (RTC_RMW_RAR(base, RTC_RAR_TCRR_MASK, RTC_RAR_TCRR(value)))
#define RTC_BWR_RAR_TCRR(base, value) (BME_BFI32(&RTC_RAR_REG(base), ((uint32_t)(value) << RTC_RAR_TCRR_SHIFT), RTC_RAR_TCRR_SHIFT, RTC_RAR_TCRR_WIDTH))
/*@}*/

/*!
 * @name Register RTC_RAR, field CRR[4] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Reads to the Control Register are ignored.
 * - 0b1 - Reads to the Control Register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_CRR field. */
#define RTC_RD_RAR_CRR(base) ((RTC_RAR_REG(base) & RTC_RAR_CRR_MASK) >> RTC_RAR_CRR_SHIFT)
#define RTC_BRD_RAR_CRR(base) (BME_UBFX32(&RTC_RAR_REG(base), RTC_RAR_CRR_SHIFT, RTC_RAR_CRR_WIDTH))

/*! @brief Set the CRR field to a new value. */
#define RTC_WR_RAR_CRR(base, value) (RTC_RMW_RAR(base, RTC_RAR_CRR_MASK, RTC_RAR_CRR(value)))
#define RTC_BWR_RAR_CRR(base, value) (BME_BFI32(&RTC_RAR_REG(base), ((uint32_t)(value) << RTC_RAR_CRR_SHIFT), RTC_RAR_CRR_SHIFT, RTC_RAR_CRR_WIDTH))
/*@}*/

/*!
 * @name Register RTC_RAR, field SRR[5] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Reads to the Status Register are ignored.
 * - 0b1 - Reads to the Status Register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_SRR field. */
#define RTC_RD_RAR_SRR(base) ((RTC_RAR_REG(base) & RTC_RAR_SRR_MASK) >> RTC_RAR_SRR_SHIFT)
#define RTC_BRD_RAR_SRR(base) (BME_UBFX32(&RTC_RAR_REG(base), RTC_RAR_SRR_SHIFT, RTC_RAR_SRR_WIDTH))

/*! @brief Set the SRR field to a new value. */
#define RTC_WR_RAR_SRR(base, value) (RTC_RMW_RAR(base, RTC_RAR_SRR_MASK, RTC_RAR_SRR(value)))
#define RTC_BWR_RAR_SRR(base, value) (BME_BFI32(&RTC_RAR_REG(base), ((uint32_t)(value) << RTC_RAR_SRR_SHIFT), RTC_RAR_SRR_SHIFT, RTC_RAR_SRR_WIDTH))
/*@}*/

/*!
 * @name Register RTC_RAR, field LRR[6] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Reads to the Lock Register are ignored.
 * - 0b1 - Reads to the Lock Register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_LRR field. */
#define RTC_RD_RAR_LRR(base) ((RTC_RAR_REG(base) & RTC_RAR_LRR_MASK) >> RTC_RAR_LRR_SHIFT)
#define RTC_BRD_RAR_LRR(base) (BME_UBFX32(&RTC_RAR_REG(base), RTC_RAR_LRR_SHIFT, RTC_RAR_LRR_WIDTH))

/*! @brief Set the LRR field to a new value. */
#define RTC_WR_RAR_LRR(base, value) (RTC_RMW_RAR(base, RTC_RAR_LRR_MASK, RTC_RAR_LRR(value)))
#define RTC_BWR_RAR_LRR(base, value) (BME_BFI32(&RTC_RAR_REG(base), ((uint32_t)(value) << RTC_RAR_LRR_SHIFT), RTC_RAR_LRR_SHIFT, RTC_RAR_LRR_WIDTH))
/*@}*/

/*!
 * @name Register RTC_RAR, field IERR[7] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Reads to the Interrupt Enable Register are ignored.
 * - 0b1 - Reads to the Interrupt Enable Register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_IERR field. */
#define RTC_RD_RAR_IERR(base) ((RTC_RAR_REG(base) & RTC_RAR_IERR_MASK) >> RTC_RAR_IERR_SHIFT)
#define RTC_BRD_RAR_IERR(base) (BME_UBFX32(&RTC_RAR_REG(base), RTC_RAR_IERR_SHIFT, RTC_RAR_IERR_WIDTH))

