RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*! @brief Set the BGE field to a new value. */
#define SDHC_WR_IRQSTAT_BGE(base, value) (SDHC_RMW_IRQSTAT(base, (SDHC_IRQSTAT_BGE_MASK | SDHC_IRQSTAT_CC_MASK | SDHC_IRQSTAT_TC_MASK | SDHC_IRQSTAT_DINT_MASK | SDHC_IRQSTAT_BWR_MASK | SDHC_IRQSTAT_BRR_MASK | SDHC_IRQSTAT_CINS_MASK | SDHC_IRQSTAT_CRM_MASK | SDHC_IRQSTAT_CINT_MASK | SDHC_IRQSTAT_CTOE_MASK | SDHC_IRQSTAT_CCE_MASK | SDHC_IRQSTAT_CEBE_MASK | SDHC_IRQSTAT_CIE_MASK | SDHC_IRQSTAT_DTOE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_AC12E_MASK | SDHC_IRQSTAT_DMAE_MASK), SDHC_IRQSTAT_BGE(value)))
#define SDHC_BWR_IRQSTAT_BGE(base, value) (BME_BFI32(&SDHC_IRQSTAT_REG(base), ((uint32_t)(value) << SDHC_IRQSTAT_BGE_SHIFT), SDHC_IRQSTAT_BGE_SHIFT, SDHC_IRQSTAT_BGE_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSTAT, field DINT[3] (W1C)
 *
 * Occurs only when the internal DMA finishes the data transfer successfully.
 * Whenever errors occur during data transfer, this bit will not be set. Instead,
 * the DMAE bit will be set. Either Simple DMA or ADMA finishes data transferring,
 * this bit will be set.
 *
 * Values:
 * - 0b0 - No DMA Interrupt.
 * - 0b1 - DMA Interrupt is generated.
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSTAT_DINT field. */
#define SDHC_RD_IRQSTAT_DINT(base) ((SDHC_IRQSTAT_REG(base) & SDHC_IRQSTAT_DINT_MASK) >> SDHC_IRQSTAT_DINT_SHIFT)
#define SDHC_BRD_IRQSTAT_DINT(base) (BME_UBFX32(&SDHC_IRQSTAT_REG(base), SDHC_IRQSTAT_DINT_SHIFT, SDHC_IRQSTAT_DINT_WIDTH))

/*! @brief Set the DINT field to a new value. */
#define SDHC_WR_IRQSTAT_DINT(base, value) (SDHC_RMW_IRQSTAT(base, (SDHC_IRQSTAT_DINT_MASK | SDHC_IRQSTAT_CC_MASK | SDHC_IRQSTAT_TC_MASK | SDHC_IRQSTAT_BGE_MASK | SDHC_IRQSTAT_BWR_MASK | SDHC_IRQSTAT_BRR_MASK | SDHC_IRQSTAT_CINS_MASK | SDHC_IRQSTAT_CRM_MASK | SDHC_IRQSTAT_CINT_MASK | SDHC_IRQSTAT_CTOE_MASK | SDHC_IRQSTAT_CCE_MASK | SDHC_IRQSTAT_CEBE_MASK | SDHC_IRQSTAT_CIE_MASK | SDHC_IRQSTAT_DTOE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_AC12E_MASK | SDHC_IRQSTAT_DMAE_MASK), SDHC_IRQSTAT_DINT(value)))
#define SDHC_BWR_IRQSTAT_DINT(base, value) (BME_BFI32(&SDHC_IRQSTAT_REG(base), ((uint32_t)(value) << SDHC_IRQSTAT_DINT_SHIFT), SDHC_IRQSTAT_DINT_SHIFT, SDHC_IRQSTAT_DINT_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSTAT, field BWR[4] (W1C)
 *
 * This status bit is set if the Buffer Write Enable bit, in the Present State
 * register, changes from 0 to 1. See the Buffer Write Enable bit in the Present
 * State register for additional information.
 *
 * Values:
 * - 0b0 - Not ready to write buffer.
 * - 0b1 - Ready to write buffer.
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSTAT_BWR field. */
#define SDHC_RD_IRQSTAT_BWR(base) ((SDHC_IRQSTAT_REG(base) & SDHC_IRQSTAT_BWR_MASK) >> SDHC_IRQSTAT_BWR_SHIFT)
#define SDHC_BRD_IRQSTAT_BWR(base) (BME_UBFX32(&SDHC_IRQSTAT_REG(base), SDHC_IRQSTAT_BWR_SHIFT, SDHC_IRQSTAT_BWR_WIDTH))

/*! @brief Set the BWR field to a new value. */
#define SDHC_WR_IRQSTAT_BWR(base, value) (SDHC_RMW_IRQSTAT(base, (SDHC_IRQSTAT_BWR_MASK | SDHC_IRQSTAT_CC_MASK | SDHC_IRQSTAT_TC_MASK | SDHC_IRQSTAT_BGE_MASK | SDHC_IRQSTAT_DINT_MASK | SDHC_IRQSTAT_BRR_MASK | SDHC_IRQSTAT_CINS_MASK | SDHC_IRQSTAT_CRM_MASK | SDHC_IRQSTAT_CINT_MASK | SDHC_IRQSTAT_CTOE_MASK | SDHC_IRQSTAT_CCE_MASK | SDHC_IRQSTAT_CEBE_MASK | SDHC_IRQSTAT_CIE_MASK | SDHC_IRQSTAT_DTOE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_AC12E_MASK | SDHC_IRQSTAT_DMAE_MASK), SDHC_IRQSTAT_BWR(value)))
#define SDHC_BWR_IRQSTAT_BWR(base, value) (BME_BFI32(&SDHC_IRQSTAT_REG(base), ((uint32_t)(value) << SDHC_IRQSTAT_BWR_SHIFT), SDHC_IRQSTAT_BWR_SHIFT, SDHC_IRQSTAT_BWR_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSTAT, field BRR[5] (W1C)
 *
 * This status bit is set if the Buffer Read Enable bit, in the Present State
 * register, changes from 0 to 1. See the Buffer Read Enable bit in the Present
 * State register for additional information.
 *
 * Values:
 * - 0b0 - Not ready to read buffer.
 * - 0b1 - Ready to read buffer.
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSTAT_BRR field. */
#define SDHC_RD_IRQSTAT_BRR(base) ((SDHC_IRQSTAT_REG(base) & SDHC_IRQSTAT_BRR_MASK) >> SDHC_IRQSTAT_BRR_SHIFT)
#define SDHC_BRD_IRQSTAT_BRR(base) (BME_UBFX32(&SDHC_IRQSTAT_REG(base), SDHC_IRQSTAT_BRR_SHIFT, SDHC_IRQSTAT_BRR_WIDTH))

/*! @brief Set the BRR field to a new value. */
#define SDHC_WR_IRQSTAT_BRR(base, value) (SDHC_RMW_IRQSTAT(base, (SDHC_IRQSTAT_BRR_MASK | SDHC_IRQSTAT_CC_MASK | SDHC_IRQSTAT_TC_MASK | SDHC_IRQSTAT_BGE_MASK | SDHC_IRQSTAT_DINT_MASK | SDHC_IRQSTAT_BWR_MASK | SDHC_IRQSTAT_CINS_MASK | SDHC_IRQSTAT_CRM_MASK | SDHC_IRQSTAT_CINT_MASK | SDHC_IRQSTAT_CTOE_MASK | SDHC_IRQSTAT_CCE_MASK | SDHC_IRQSTAT_CEBE_MASK | SDHC_IRQSTAT_CIE_MASK | SDHC_IRQSTAT_DTOE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_AC12E_MASK | SDHC_IRQSTAT_DMAE_MASK), SDHC_IRQSTAT_BRR(value)))
#define SDHC_BWR_IRQSTAT_BRR(base, value) (BME_BFI32(&SDHC_IRQSTAT_REG(base), ((uint32_t)(value) << SDHC_IRQSTAT_BRR_SHIFT), SDHC_IRQSTAT_BRR_SHIFT, SDHC_IRQSTAT_BRR_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSTAT, field CINS[6] (W1C)
 *
 * This status bit is set if the Card Inserted bit in the Present State register
 * changes from 0 to 1. When the host driver writes this bit to 1 to clear this
 * status, the status of the Card Inserted in the Present State register must be
 * confirmed. Because the card state may possibly be changed when the host driver
 * clears this bit and the interrupt event may not be generated. When this bit
 * is cleared, it will be set again if a card is inserted. To leave it cleared,
 * clear the Card Inserted Status Enable bit in Interrupt Status Enable register.
 *
 * Values:
 * - 0b0 - Card state unstable or removed.
 * - 0b1 - Card inserted.
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSTAT_CINS field. */
#define SDHC_RD_IRQSTAT_CINS(base) ((SDHC_IRQSTAT_REG(base) & SDHC_IRQSTAT_CINS_MASK) >> SDHC_IRQSTAT_CINS_SHIFT)
#define SDHC_BRD_IRQSTAT_CINS(base) (BME_UBFX32(&SDHC_IRQSTAT_REG(base), SDHC_IRQSTAT_CINS_SHIFT, SDHC_IRQSTAT_CINS_WIDTH))

/*! @brief Set the CINS field to a new value. */
#define SDHC_WR_IRQSTAT_CINS(base, value) (SDHC_RMW_IRQSTAT(base, (SDHC_IRQSTAT_CINS_MASK | SDHC_IRQSTAT_CC_MASK | SDHC_IRQSTAT_TC_MASK | SDHC_IRQSTAT_BGE_MASK | SDHC_IRQSTAT_DINT_MASK | SDHC_IRQSTAT_BWR_MASK | SDHC_IRQSTAT_BRR_MASK | SDHC_IRQSTAT_CRM_MASK | SDHC_IRQSTAT_CINT_MASK | SDHC_IRQSTAT_CTOE_MASK | SDHC_IRQSTAT_CCE_MASK | SDHC_IRQSTAT_CEBE_MASK | SDHC_IRQSTAT_CIE_MASK | SDHC_IRQSTAT_DTOE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_AC12E_MASK | SDHC_IRQSTAT_DMAE_MASK), SDHC_IRQSTAT_CINS(value)))
#define SDHC_BWR_IRQSTAT_CINS(base, value) (BME_BFI32(&SDHC_IRQSTAT_REG(base), ((uint32_t)(value) << SDHC_IRQSTAT_CINS_SHIFT), SDHC_IRQSTAT_CINS_SHIFT, SDHC_IRQSTAT_CINS_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSTAT, field CRM[7] (W1C)
 *
 * This status bit is set if the Card Inserted bit in the Present State register
 * changes from 1 to 0. When the host driver writes this bit to 1 to clear this
 * status, the status of the Card Inserted in the Present State register must be
 * confirmed. Because the card state may possibly be changed when the host driver
 * clears this bit and the interrupt event may not be generated. When this bit
 * is cleared, it will be set again if no card is inserted. To leave it cleared,
 * clear the Card Removal Status Enable bit in Interrupt Status Enable register.
 *
 * Values:
 * - 0b0 - Card state unstable or inserted.
 * - 0b1 - Card removed.
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSTAT_CRM field. */
#define SDHC_RD_IRQSTAT_CRM(base) ((SDHC_IRQSTAT_REG(base) & SDHC_IRQSTAT_CRM_MASK) >> SDHC_IRQSTAT_CRM_SHIFT)
#define SDHC_BRD_IRQSTAT_CRM(base) (BME_UBFX32(&SDHC_IRQSTAT_REG(base), SDHC_IRQSTAT_CRM_SHIFT, SDHC_IRQSTAT_CRM_WIDTH))

