RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*******************************************************************************
 * SDHC_IRQSTATEN - Interrupt Status Enable register
 ******************************************************************************/

/*!
 * @brief SDHC_IRQSTATEN - Interrupt Status Enable register (RW)
 *
 * Reset value: 0x117F013FU
 *
 * Setting the bits in this register to 1 enables the corresponding interrupt
 * status to be set by the specified event. If any bit is cleared, the
 * corresponding interrupt status bit is also cleared, that is, when the bit in this register
 * is cleared, the corresponding bit in interrupt status register is always 0.
 * Depending on PROCTL[IABG] bit setting, SDHC may be programmed to sample the
 * card interrupt signal during the interrupt period and hold its value in the
 * flip-flop. There will be some delays on the card interrupt, asserted from the card,
 * to the time the host system is informed. To detect a CMD line conflict, the
 * host driver must set both IRQSTATEN[CTOESEN] and IRQSTATEN[CCESEN] to 1.
 */
/*!
 * @name Constants and macros for entire SDHC_IRQSTATEN register
 */
/*@{*/
#define SDHC_RD_IRQSTATEN(base)  (SDHC_IRQSTATEN_REG(base))
#define SDHC_WR_IRQSTATEN(base, value) (SDHC_IRQSTATEN_REG(base) = (value))
#define SDHC_RMW_IRQSTATEN(base, mask, value) (SDHC_WR_IRQSTATEN(base, (SDHC_RD_IRQSTATEN(base) & ~(mask)) | (value)))
#define SDHC_SET_IRQSTATEN(base, value) (BME_OR32(&SDHC_IRQSTATEN_REG(base), (uint32_t)(value)))
#define SDHC_CLR_IRQSTATEN(base, value) (BME_AND32(&SDHC_IRQSTATEN_REG(base), (uint32_t)(~(value))))
#define SDHC_TOG_IRQSTATEN(base, value) (BME_XOR32(&SDHC_IRQSTATEN_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SDHC_IRQSTATEN bitfields
 */

/*!
 * @name Register SDHC_IRQSTATEN, field CCSEN[0] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSTATEN_CCSEN field. */
#define SDHC_RD_IRQSTATEN_CCSEN(base) ((SDHC_IRQSTATEN_REG(base) & SDHC_IRQSTATEN_CCSEN_MASK) >> SDHC_IRQSTATEN_CCSEN_SHIFT)
#define SDHC_BRD_IRQSTATEN_CCSEN(base) (BME_UBFX32(&SDHC_IRQSTATEN_REG(base), SDHC_IRQSTATEN_CCSEN_SHIFT, SDHC_IRQSTATEN_CCSEN_WIDTH))

/*! @brief Set the CCSEN field to a new value. */
#define SDHC_WR_IRQSTATEN_CCSEN(base, value) (SDHC_RMW_IRQSTATEN(base, SDHC_IRQSTATEN_CCSEN_MASK, SDHC_IRQSTATEN_CCSEN(value)))
#define SDHC_BWR_IRQSTATEN_CCSEN(base, value) (BME_BFI32(&SDHC_IRQSTATEN_REG(base), ((uint32_t)(value) << SDHC_IRQSTATEN_CCSEN_SHIFT), SDHC_IRQSTATEN_CCSEN_SHIFT, SDHC_IRQSTATEN_CCSEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSTATEN, field TCSEN[1] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSTATEN_TCSEN field. */
#define SDHC_RD_IRQSTATEN_TCSEN(base) ((SDHC_IRQSTATEN_REG(base) & SDHC_IRQSTATEN_TCSEN_MASK) >> SDHC_IRQSTATEN_TCSEN_SHIFT)
#define SDHC_BRD_IRQSTATEN_TCSEN(base) (BME_UBFX32(&SDHC_IRQSTATEN_REG(base), SDHC_IRQSTATEN_TCSEN_SHIFT, SDHC_IRQSTATEN_TCSEN_WIDTH))

/*! @brief Set the TCSEN field to a new value. */
#define SDHC_WR_IRQSTATEN_TCSEN(base, value) (SDHC_RMW_IRQSTATEN(base, SDHC_IRQSTATEN_TCSEN_MASK, SDHC_IRQSTATEN_TCSEN(value)))
#define SDHC_BWR_IRQSTATEN_TCSEN(base, value) (BME_BFI32(&SDHC_IRQSTATEN_REG(base), ((uint32_t)(value) << SDHC_IRQSTATEN_TCSEN_SHIFT), SDHC_IRQSTATEN_TCSEN_SHIFT, SDHC_IRQSTATEN_TCSEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSTATEN, field BGESEN[2] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSTATEN_BGESEN field. */
#define SDHC_RD_IRQSTATEN_BGESEN(base) ((SDHC_IRQSTATEN_REG(base) & SDHC_IRQSTATEN_BGESEN_MASK) >> SDHC_IRQSTATEN_BGESEN_SHIFT)
#define SDHC_BRD_IRQSTATEN_BGESEN(base) (BME_UBFX32(&SDHC_IRQSTATEN_REG(base), SDHC_IRQSTATEN_BGESEN_SHIFT, SDHC_IRQSTATEN_BGESEN_WIDTH))

/*! @brief Set the BGESEN field to a new value. */
#define SDHC_WR_IRQSTATEN_BGESEN(base, value) (SDHC_RMW_IRQSTATEN(base, SDHC_IRQSTATEN_BGESEN_MASK, SDHC_IRQSTATEN_BGESEN(value)))
#define SDHC_BWR_IRQSTATEN_BGESEN(base, value) (BME_BFI32(&SDHC_IRQSTATEN_REG(base), ((uint32_t)(value) << SDHC_IRQSTATEN_BGESEN_SHIFT), SDHC_IRQSTATEN_BGESEN_SHIFT, SDHC_IRQSTATEN_BGESEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSTATEN, field DINTSEN[3] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSTATEN_DINTSEN field. */
#define SDHC_RD_IRQSTATEN_DINTSEN(base) ((SDHC_IRQSTATEN_REG(base) & SDHC_IRQSTATEN_DINTSEN_MASK) >> SDHC_IRQSTATEN_DINTSEN_SHIFT)
#define SDHC_BRD_IRQSTATEN_DINTSEN(base) (BME_UBFX32(&SDHC_IRQSTATEN_REG(base), SDHC_IRQSTATEN_DINTSEN_SHIFT, SDHC_IRQSTATEN_DINTSEN_WIDTH))

/*! @brief Set the DINTSEN field to a new value. */
#define SDHC_WR_IRQSTATEN_DINTSEN(base, value) (SDHC_RMW_IRQSTATEN(base, SDHC_IRQSTATEN_DINTSEN_MASK, SDHC_IRQSTATEN_DINTSEN(value)))
#define SDHC_BWR_IRQSTATEN_DINTSEN(base, value) (BME_BFI32(&SDHC_IRQSTATEN_REG(base), ((uint32_t)(value) << SDHC_IRQSTATEN_DINTSEN_SHIFT), SDHC_IRQSTATEN_DINTSEN_SHIFT, SDHC_IRQSTATEN_DINTSEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSTATEN, field BWRSEN[4] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSTATEN_BWRSEN field. */
#define SDHC_RD_IRQSTATEN_BWRSEN(base) ((SDHC_IRQSTATEN_REG(base) & SDHC_IRQSTATEN_BWRSEN_MASK) >> SDHC_IRQSTATEN_BWRSEN_SHIFT)
#define SDHC_BRD_IRQSTATEN_BWRSEN(base) (BME_UBFX32(&SDHC_IRQSTATEN_REG(base), SDHC_IRQSTATEN_BWRSEN_SHIFT, SDHC_IRQSTATEN_BWRSEN_WIDTH))

/*! @brief Set the BWRSEN field to a new value. */
#define SDHC_WR_IRQSTATEN_BWRSEN(base, value) (SDHC_RMW_IRQSTATEN(base, SDHC_IRQSTATEN_BWRSEN_MASK, SDHC_IRQSTATEN_BWRSEN(value)))
#define SDHC_BWR_IRQSTATEN_BWRSEN(base, value) (BME_BFI32(&SDHC_IRQSTATEN_REG(base), ((uint32_t)(value) << SDHC_IRQSTATEN_BWRSEN_SHIFT), SDHC_IRQSTATEN_BWRSEN_SHIFT, SDHC_IRQSTATEN_BWRSEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSTATEN, field BRRSEN[5] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSTATEN_BRRSEN field. */
#define SDHC_RD_IRQSTATEN_BRRSEN(base) ((SDHC_IRQSTATEN_REG(base) & SDHC_IRQSTATEN_BRRSEN_MASK) >> SDHC_IRQSTATEN_BRRSEN_SHIFT)
#define SDHC_BRD_IRQSTATEN_BRRSEN(base) (BME_UBFX32(&SDHC_IRQSTATEN_REG(base), SDHC_IRQSTATEN_BRRSEN_SHIFT, SDHC_IRQSTATEN_BRRSEN_WIDTH))

/*! @brief Set the BRRSEN field to a new value. */
#define SDHC_WR_IRQSTATEN_BRRSEN(base, value) (SDHC_RMW_IRQSTATEN(base, SDHC_IRQSTATEN_BRRSEN_MASK, SDHC_IRQSTATEN_BRRSEN(value)))
#define SDHC_BWR_IRQSTATEN_BRRSEN(base, value) (BME_BFI32(&SDHC_IRQSTATEN_REG(base), ((uint32_t)(value) << SDHC_IRQSTATEN_BRRSEN_SHIFT), SDHC_IRQSTATEN_BRRSEN_SHIFT, SDHC_IRQSTATEN_BRRSEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSTATEN, field CINSEN[6] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSTATEN_CINSEN field. */
#define SDHC_RD_IRQSTATEN_CINSEN(base) ((SDHC_IRQSTATEN_REG(base) & SDHC_IRQSTATEN_CINSEN_MASK) >> SDHC_IRQSTATEN_CINSEN_SHIFT)
#define SDHC_BRD_IRQSTATEN_CINSEN(base) (BME_UBFX32(&SDHC_IRQSTATEN_REG(base), SDHC_IRQSTATEN_CINSEN_SHIFT, SDHC_IRQSTATEN_CINSEN_WIDTH))

/*! @brief Set the CINSEN field to a new value. */
#define SDHC_WR_IRQSTATEN_CINSEN(base, value) (SDHC_RMW_IRQSTATEN(base, SDHC_IRQSTATEN_CINSEN_MASK, SDHC_IRQSTATEN_CINSEN(value)))
#define SDHC_BWR_IRQSTATEN_CINSEN(base, value) (BME_BFI32(&SDHC_IRQSTATEN_REG(base), ((uint32_t)(value) << SDHC_IRQSTATEN_CINSEN_SHIFT), SDHC_IRQSTATEN_CINSEN_SHIFT, SDHC_IRQSTATEN_CINSEN_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_IRQSTATEN, field CRMSEN[7] (RW)
 *
 * Values:
 * - 0b0 - Masked
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the SDHC_IRQSTATEN_CRMSEN field. */
#define SDHC_RD_IRQSTATEN_CRMSEN(base) ((SDHC_IRQSTATEN_REG(base) & SDHC_IRQSTATEN_CRMSEN_MASK) >> SDHC_IRQSTATEN_CRMSEN_SHIFT)
#define SDHC_BRD_IRQSTATEN_CRMSEN(base) (BME_UBFX32(&SDHC_IRQSTATEN_REG(base), SDHC_IRQSTATEN_CRMSEN_SHIFT, SDHC_IRQSTATEN_CRMSEN_WIDTH))

