RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*******************************************************************************
 * SDHC_HTCAPBLT - Host Controller Capabilities
 ******************************************************************************/

/*!
 * @brief SDHC_HTCAPBLT - Host Controller Capabilities (RO)
 *
 * Reset value: 0x07F30000U
 *
 * This register provides the host driver with information specific to the SDHC
 * implementation. The value in this register is the power-on-reset value, and
 * does not change with a software reset. Any write to this register is ignored.
 */
/*!
 * @name Constants and macros for entire SDHC_HTCAPBLT register
 */
/*@{*/
#define SDHC_RD_HTCAPBLT(base)   (SDHC_HTCAPBLT_REG(base))
/*@}*/

/*
 * Constants & macros for individual SDHC_HTCAPBLT bitfields
 */

/*!
 * @name Register SDHC_HTCAPBLT, field MBL[18:16] (RO)
 *
 * This value indicates the maximum block size that the host driver can read and
 * write to the buffer in the SDHC. The buffer shall transfer block size without
 * wait cycles.
 *
 * Values:
 * - 0b000 - 512 bytes
 * - 0b001 - 1024 bytes
 * - 0b010 - 2048 bytes
 * - 0b011 - 4096 bytes
 */
/*@{*/
/*! @brief Read current value of the SDHC_HTCAPBLT_MBL field. */
#define SDHC_RD_HTCAPBLT_MBL(base) ((SDHC_HTCAPBLT_REG(base) & SDHC_HTCAPBLT_MBL_MASK) >> SDHC_HTCAPBLT_MBL_SHIFT)
#define SDHC_BRD_HTCAPBLT_MBL(base) (BME_UBFX32(&SDHC_HTCAPBLT_REG(base), SDHC_HTCAPBLT_MBL_SHIFT, SDHC_HTCAPBLT_MBL_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_HTCAPBLT, field ADMAS[20] (RO)
 *
 * This bit indicates whether the SDHC supports the ADMA feature.
 *
 * Values:
 * - 0b0 - Advanced DMA not supported.
 * - 0b1 - Advanced DMA supported.
 */
/*@{*/
/*! @brief Read current value of the SDHC_HTCAPBLT_ADMAS field. */
#define SDHC_RD_HTCAPBLT_ADMAS(base) ((SDHC_HTCAPBLT_REG(base) & SDHC_HTCAPBLT_ADMAS_MASK) >> SDHC_HTCAPBLT_ADMAS_SHIFT)
#define SDHC_BRD_HTCAPBLT_ADMAS(base) (BME_UBFX32(&SDHC_HTCAPBLT_REG(base), SDHC_HTCAPBLT_ADMAS_SHIFT, SDHC_HTCAPBLT_ADMAS_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_HTCAPBLT, field HSS[21] (RO)
 *
 * This bit indicates whether the SDHC supports high speed mode and the host
 * system can supply a SD Clock frequency from 25 MHz to 50 MHz.
 *
 * Values:
 * - 0b0 - High speed not supported.
 * - 0b1 - High speed supported.
 */
/*@{*/
/*! @brief Read current value of the SDHC_HTCAPBLT_HSS field. */
#define SDHC_RD_HTCAPBLT_HSS(base) ((SDHC_HTCAPBLT_REG(base) & SDHC_HTCAPBLT_HSS_MASK) >> SDHC_HTCAPBLT_HSS_SHIFT)
#define SDHC_BRD_HTCAPBLT_HSS(base) (BME_UBFX32(&SDHC_HTCAPBLT_REG(base), SDHC_HTCAPBLT_HSS_SHIFT, SDHC_HTCAPBLT_HSS_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_HTCAPBLT, field DMAS[22] (RO)
 *
 * This bit indicates whether the SDHC is capable of using the internal DMA to
 * transfer data between system memory and the data buffer directly.
 *
 * Values:
 * - 0b0 - DMA not supported.
 * - 0b1 - DMA supported.
 */
/*@{*/
/*! @brief Read current value of the SDHC_HTCAPBLT_DMAS field. */
#define SDHC_RD_HTCAPBLT_DMAS(base) ((SDHC_HTCAPBLT_REG(base) & SDHC_HTCAPBLT_DMAS_MASK) >> SDHC_HTCAPBLT_DMAS_SHIFT)
#define SDHC_BRD_HTCAPBLT_DMAS(base) (BME_UBFX32(&SDHC_HTCAPBLT_REG(base), SDHC_HTCAPBLT_DMAS_SHIFT, SDHC_HTCAPBLT_DMAS_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_HTCAPBLT, field SRS[23] (RO)
 *
 * This bit indicates whether the SDHC supports suspend / resume functionality.
 * If this bit is 0, the suspend and resume mechanism, as well as the read Wwait,
 * are not supported, and the host driver shall not issue either suspend or
 * resume commands.
 *
 * Values:
 * - 0b0 - Not supported.
 * - 0b1 - Supported.
 */
/*@{*/
/*! @brief Read current value of the SDHC_HTCAPBLT_SRS field. */
#define SDHC_RD_HTCAPBLT_SRS(base) ((SDHC_HTCAPBLT_REG(base) & SDHC_HTCAPBLT_SRS_MASK) >> SDHC_HTCAPBLT_SRS_SHIFT)
#define SDHC_BRD_HTCAPBLT_SRS(base) (BME_UBFX32(&SDHC_HTCAPBLT_REG(base), SDHC_HTCAPBLT_SRS_SHIFT, SDHC_HTCAPBLT_SRS_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_HTCAPBLT, field VS33[24] (RO)
 *
 * This bit shall depend on the host system ability.
 *
 * Values:
 * - 0b0 - 3.3 V not supported.
 * - 0b1 - 3.3 V supported.
 */
/*@{*/
/*! @brief Read current value of the SDHC_HTCAPBLT_VS33 field. */
#define SDHC_RD_HTCAPBLT_VS33(base) ((SDHC_HTCAPBLT_REG(base) & SDHC_HTCAPBLT_VS33_MASK) >> SDHC_HTCAPBLT_VS33_SHIFT)
#define SDHC_BRD_HTCAPBLT_VS33(base) (BME_UBFX32(&SDHC_HTCAPBLT_REG(base), SDHC_HTCAPBLT_VS33_SHIFT, SDHC_HTCAPBLT_VS33_WIDTH))
/*@}*/

/*******************************************************************************
 * SDHC_WML - Watermark Level Register
 ******************************************************************************/

/*!
 * @brief SDHC_WML - Watermark Level Register (RW)
 *
 * Reset value: 0x00100010U
 *
 * Both write and read watermark levels (FIFO threshold) are configurable. There
 * value can range from 1 to 128 words. Both write and read burst lengths are
 * also configurable. There value can range from 1 to 31 words.
 */
/*!
 * @name Constants and macros for entire SDHC_WML register
 */
/*@{*/
#define SDHC_RD_WML(base)        (SDHC_WML_REG(base))
#define SDHC_WR_WML(base, value) (SDHC_WML_REG(base) = (value))
#define SDHC_RMW_WML(base, mask, value) (SDHC_WR_WML(base, (SDHC_RD_WML(base) & ~(mask)) | (value)))
#define SDHC_SET_WML(base, value) (BME_OR32(&SDHC_WML_REG(base), (uint32_t)(value)))
#define SDHC_CLR_WML(base, value) (BME_AND32(&SDHC_WML_REG(base), (uint32_t)(~(value))))
#define SDHC_TOG_WML(base, value) (BME_XOR32(&SDHC_WML_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SDHC_WML bitfields
 */

/*!
 * @name Register SDHC_WML, field RDWML[7:0] (RW)
 *
 * The number of words used as the watermark level (FIFO threshold) in a DMA
 * read operation. Also the number of words as a sequence of read bursts in
 * back-to-back mode. The maximum legal value for the read water mark level is 128.
 */
/*@{*/
/*! @brief Read current value of the SDHC_WML_RDWML field. */
#define SDHC_RD_WML_RDWML(base) ((SDHC_WML_REG(base) & SDHC_WML_RDWML_MASK) >> SDHC_WML_RDWML_SHIFT)
#define SDHC_BRD_WML_RDWML(base) (BME_UBFX32(&SDHC_WML_REG(base), SDHC_WML_RDWML_SHIFT, SDHC_WML_RDWML_WIDTH))

/*! @brief Set the RDWML field to a new value. */
#define SDHC_WR_WML_RDWML(base, value) (SDHC_RMW_WML(base, SDHC_WML_RDWML_MASK, SDHC_WML_RDWML(value)))
#define SDHC_BWR_WML_RDWML(base, value) (BME_BFI32(&SDHC_WML_REG(base), ((uint32_t)(value) << SDHC_WML_RDWML_SHIFT), SDHC_WML_RDWML_SHIFT, SDHC_WML_RDWML_WIDTH))
/*@}*/

/*!
 * @name Register SDHC_WML, field WRWML[23:16] (RW)
 *
 * The number of words used as the watermark level (FIFO threshold) in a DMA
 * write operation. Also the number of words as a sequence of write bursts in
 * back-to-back mode. The maximum legal value for the write watermark level is 128.
 */
/*@{*/
/*! @brief Read current value of the SDHC_WML_WRWML field. */
#define SDHC_RD_WML_WRWML(base) ((SDHC_WML_REG(base) & SDHC_WML_WRWML_MASK) >> SDHC_WML_WRWML_SHIFT)
#define SDHC_BRD_WML_WRWML(base) (BME_UBFX32(&SDHC_WML_REG(base), SDHC_WML_WRWML_SHIFT, SDHC_WML_WRWML_WIDTH))

/*! @brief Set the WRWML field to a new value. */
#define SDHC_WR_WML_WRWML(base, value) (SDHC_RMW_WML(base, SDHC_WML_WRWML_MASK, SDHC_WML_WRWML(value)))
#define SDHC_BWR_WML_WRWML(base, value) (BME_BFI32(&SDHC_WML_REG(base), ((uint32_t)(value) << SDHC_WML_WRWML_SHIFT), SDHC_WML_WRWML_SHIFT, SDHC_WML_WRWML_WIDTH))
/*@}*/

