RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*******************************************************************************
 * SDRAM_CM - Control Mask
 ******************************************************************************/

/*!
 * @brief SDRAM_CM - Control Mask (RW)
 *
 * Reset value: 0x00000000U
 *
 * The SDRAM_CMn, includes mask bits for the base address and for address
 * attributes
 */
/*!
 * @name Constants and macros for entire SDRAM_CM register
 */
/*@{*/
#define SDRAM_RD_CM(base, index) (SDRAM_CM_REG(base, index))
#define SDRAM_WR_CM(base, index, value) (SDRAM_CM_REG(base, index) = (value))
#define SDRAM_RMW_CM(base, index, mask, value) (SDRAM_WR_CM(base, index, (SDRAM_RD_CM(base, index) & ~(mask)) | (value)))
#define SDRAM_SET_CM(base, index, value) (BME_OR32(&SDRAM_CM_REG(base, index), (uint32_t)(value)))
#define SDRAM_CLR_CM(base, index, value) (BME_AND32(&SDRAM_CM_REG(base, index), (uint32_t)(~(value))))
#define SDRAM_TOG_CM(base, index, value) (BME_XOR32(&SDRAM_CM_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SDRAM_CM bitfields
 */

/*!
 * @name Register SDRAM_CM, field V[0] (RW)
 *
 * Cleared at reset to ensure that the DRAM block is not erroneously decoded
 *
 * Values:
 * - 0b0 - Do not decode DRAM accesses.
 * - 0b1 - Registers controlling the DRAM block are initialized; DRAM accesses
 *     can be decoded
 */
/*@{*/
/*! @brief Read current value of the SDRAM_CM_V field. */
#define SDRAM_RD_CM_V(base, index) ((SDRAM_CM_REG(base, index) & SDRAM_CM_V_MASK) >> SDRAM_CM_V_SHIFT)
#define SDRAM_BRD_CM_V(base, index) (BME_UBFX32(&SDRAM_CM_REG(base, index), SDRAM_CM_V_SHIFT, SDRAM_CM_V_WIDTH))

/*! @brief Set the V field to a new value. */
#define SDRAM_WR_CM_V(base, index, value) (SDRAM_RMW_CM(base, index, SDRAM_CM_V_MASK, SDRAM_CM_V(value)))
#define SDRAM_BWR_CM_V(base, index, value) (BME_BFI32(&SDRAM_CM_REG(base, index), ((uint32_t)(value) << SDRAM_CM_V_SHIFT), SDRAM_CM_V_SHIFT, SDRAM_CM_V_WIDTH))
/*@}*/

/*!
 * @name Register SDRAM_CM, field WP[8] (RW)
 *
 * Determines whether the associated block of DRAM is write protected.
 *
 * Values:
 * - 0b0 - Allow write accesses
 * - 0b1 - Ignore write accesses. The DRAM controller ignores write accesses to
 *     the memory block and an address exception occurs. Write accesses to a
 *     write-protected DRAM region are compared in the chip select module for a hit.
 *     If no hit occurs, an external bus cycle is generated. If this external bus
 *     cycle is not acknowledged, an access exception occurs.
 */
/*@{*/
/*! @brief Read current value of the SDRAM_CM_WP field. */
#define SDRAM_RD_CM_WP(base, index) ((SDRAM_CM_REG(base, index) & SDRAM_CM_WP_MASK) >> SDRAM_CM_WP_SHIFT)
#define SDRAM_BRD_CM_WP(base, index) (BME_UBFX32(&SDRAM_CM_REG(base, index), SDRAM_CM_WP_SHIFT, SDRAM_CM_WP_WIDTH))

/*! @brief Set the WP field to a new value. */
#define SDRAM_WR_CM_WP(base, index, value) (SDRAM_RMW_CM(base, index, SDRAM_CM_WP_MASK, SDRAM_CM_WP(value)))
#define SDRAM_BWR_CM_WP(base, index, value) (BME_BFI32(&SDRAM_CM_REG(base, index), ((uint32_t)(value) << SDRAM_CM_WP_SHIFT), SDRAM_CM_WP_SHIFT, SDRAM_CM_WP_WIDTH))
/*@}*/

/*!
 * @name Register SDRAM_CM, field BAM[31:18] (RW)
 *
 * Masks the associated SDRAM_ACn[BA]. Lets the DRAM controller connect to
 * various DRAM sizes. Mask bits need not be contiguous
 *
 * Values:
 * - 0b00000000000000 - The associated address bit is used in decoding the DRAM
 *     hit to a memory block
 * - 0b00000000000001 - The associated address bit is not used in the DRAM hit
 *     decode
 */
/*@{*/
/*! @brief Read current value of the SDRAM_CM_BAM field. */
#define SDRAM_RD_CM_BAM(base, index) ((SDRAM_CM_REG(base, index) & SDRAM_CM_BAM_MASK) >> SDRAM_CM_BAM_SHIFT)
#define SDRAM_BRD_CM_BAM(base, index) (SDRAM_RD_CM_BAM(base, index))

/*! @brief Set the BAM field to a new value. */
#define SDRAM_WR_CM_BAM(base, index, value) (SDRAM_RMW_CM(base, index, SDRAM_CM_BAM_MASK, SDRAM_CM_BAM(value)))
#define SDRAM_BWR_CM_BAM(base, index, value) (SDRAM_WR_CM_BAM(base, index, value))
/*@}*/

/*
 * MK80F25615 SIM
 *
 * System Integration Module
 *
 * Registers defined in this header file:
 * - SIM_SOPT1 - System Options Register 1
 * - SIM_SOPT1CFG - SOPT1 Configuration Register
 * - SIM_SOPT2 - System Options Register 2
 * - SIM_SOPT4 - System Options Register 4
 * - SIM_SOPT5 - System Options Register 5
 * - SIM_SOPT7 - System Options Register 7
 * - SIM_SOPT8 - System Options Register 8
 * - SIM_SOPT9 - System Options Register 9
 * - SIM_SDID - System Device Identification Register
 * - SIM_SCGC1 - System Clock Gating Control Register 1
 * - SIM_SCGC2 - System Clock Gating Control Register 2
 * - SIM_SCGC3 - System Clock Gating Control Register 3
 * - SIM_SCGC4 - System Clock Gating Control Register 4
 * - SIM_SCGC5 - System Clock Gating Control Register 5
 * - SIM_SCGC6 - System Clock Gating Control Register 6
 * - SIM_SCGC7 - System Clock Gating Control Register 7
 * - SIM_CLKDIV1 - System Clock Divider Register 1
 * - SIM_CLKDIV2 - System Clock Divider Register 2
 * - SIM_FCFG1 - Flash Configuration Register 1
 * - SIM_FCFG2 - Flash Configuration Register 2
 * - SIM_UIDH - Unique Identification Register High
 * - SIM_UIDMH - Unique Identification Register Mid-High
 * - SIM_UIDML - Unique Identification Register Mid Low
 * - SIM_UIDL - Unique Identification Register Low
 * - SIM_CLKDIV3 - System Clock Divider Register 3
 * - SIM_CLKDIV4 - System Clock Divider Register 4
 */

#define SIM_INSTANCE_COUNT (1U) /*!< Number of instances of the SIM module. */
#define SIM_IDX (0U) /*!< Instance number for SIM. */

/*******************************************************************************
 * SIM_SOPT1 - System Options Register 1
 ******************************************************************************/

/*!
 * @brief SIM_SOPT1 - System Options Register 1 (RW)
 *
 * Reset value: 0x80000000U
 *
 * The SOPT1 register is only reset on POR or LVD.
 */
/*!
 * @name Constants and macros for entire SIM_SOPT1 register
 */
/*@{*/
#define SIM_RD_SOPT1(base)       (SIM_SOPT1_REG(base))
#define SIM_WR_SOPT1(base, value) (SIM_SOPT1_REG(base) = (value))
#define SIM_RMW_SOPT1(base, mask, value) (SIM_WR_SOPT1(base, (SIM_RD_SOPT1(base) & ~(mask)) | (value)))
#define SIM_SET_SOPT1(base, value) (BME_OR32(&SIM_SOPT1_REG(base), (uint32_t)(value)))
#define SIM_CLR_SOPT1(base, value) (BME_AND32(&SIM_SOPT1_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SOPT1(base, value) (BME_XOR32(&SIM_SOPT1_REG(base), (uint32_t)(value)))
/*@}*/

