RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615_extension.h
/*! @brief Set the TRACECLKSEL field to a new value. */
#define SIM_WR_SOPT2_TRACECLKSEL(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_TRACECLKSEL_MASK, SIM_SOPT2_TRACECLKSEL(value)))
#define SIM_BWR_SOPT2_TRACECLKSEL(base, value) (BME_BFI32(&SIM_SOPT2_REG(base), ((uint32_t)(value) << SIM_SOPT2_TRACECLKSEL_SHIFT), SIM_SOPT2_TRACECLKSEL_SHIFT, SIM_SOPT2_TRACECLKSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field PLLFLLSEL[17:16] (RW)
 *
 * Selects the high frequency clock for various peripheral clocking options.
 *
 * Values:
 * - 0b00 - MCGFLLCLK clock
 * - 0b01 - MCGPLLCLK clock
 * - 0b10 - Reserved
 * - 0b11 - IRC48 MHz clock
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_PLLFLLSEL field. */
#define SIM_RD_SOPT2_PLLFLLSEL(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_PLLFLLSEL_MASK) >> SIM_SOPT2_PLLFLLSEL_SHIFT)
#define SIM_BRD_SOPT2_PLLFLLSEL(base) (BME_UBFX32(&SIM_SOPT2_REG(base), SIM_SOPT2_PLLFLLSEL_SHIFT, SIM_SOPT2_PLLFLLSEL_WIDTH))

/*! @brief Set the PLLFLLSEL field to a new value. */
#define SIM_WR_SOPT2_PLLFLLSEL(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_PLLFLLSEL_MASK, SIM_SOPT2_PLLFLLSEL(value)))
#define SIM_BWR_SOPT2_PLLFLLSEL(base, value) (BME_BFI32(&SIM_SOPT2_REG(base), ((uint32_t)(value) << SIM_SOPT2_PLLFLLSEL_SHIFT), SIM_SOPT2_PLLFLLSEL_SHIFT, SIM_SOPT2_PLLFLLSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field USBSRC[18] (RW)
 *
 * Selects the clock source for the USB 48 MHz clock.
 *
 * Values:
 * - 0b0 - External bypass clock (USB_CLKIN).
 * - 0b1 - MCGFLLCLK, or MCGPLLCLK , or IRC48M clock as selected by
 *     SOPT2[PLLFLLSEL], and then divided by the USB fractional divider as configured by
 *     SIM_CLKDIV2[USBFRAC, USBDIV].
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_USBSRC field. */
#define SIM_RD_SOPT2_USBSRC(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_USBSRC_MASK) >> SIM_SOPT2_USBSRC_SHIFT)
#define SIM_BRD_SOPT2_USBSRC(base) (BME_UBFX32(&SIM_SOPT2_REG(base), SIM_SOPT2_USBSRC_SHIFT, SIM_SOPT2_USBSRC_WIDTH))

/*! @brief Set the USBSRC field to a new value. */
#define SIM_WR_SOPT2_USBSRC(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_USBSRC_MASK, SIM_SOPT2_USBSRC(value)))
#define SIM_BWR_SOPT2_USBSRC(base, value) (BME_BFI32(&SIM_SOPT2_REG(base), ((uint32_t)(value) << SIM_SOPT2_USBSRC_SHIFT), SIM_SOPT2_USBSRC_SHIFT, SIM_SOPT2_USBSRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field FLEXIOSRC[23:22] (RW)
 *
 * Selects the clock source for the FlexIO transmit and receive clock.
 *
 * Values:
 * - 0b00 - System clock
 * - 0b01 - MCGFLLCLK , or MCGPLLCLK , or IRC48M clock as selected by
 *     SOPT2[PLLFLLSEL], and then divided by the PLLFLLCLK fractional divider as configured
 *     by SIM_CLKDIV3[PLLFLLFRAC, PLLFLLDIV].
 * - 0b10 - OSCERCLK clock
 * - 0b11 - MCGIRCLK clock
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_FLEXIOSRC field. */
#define SIM_RD_SOPT2_FLEXIOSRC(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_FLEXIOSRC_MASK) >> SIM_SOPT2_FLEXIOSRC_SHIFT)
#define SIM_BRD_SOPT2_FLEXIOSRC(base) (BME_UBFX32(&SIM_SOPT2_REG(base), SIM_SOPT2_FLEXIOSRC_SHIFT, SIM_SOPT2_FLEXIOSRC_WIDTH))

/*! @brief Set the FLEXIOSRC field to a new value. */
#define SIM_WR_SOPT2_FLEXIOSRC(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_FLEXIOSRC_MASK, SIM_SOPT2_FLEXIOSRC(value)))
#define SIM_BWR_SOPT2_FLEXIOSRC(base, value) (BME_BFI32(&SIM_SOPT2_REG(base), ((uint32_t)(value) << SIM_SOPT2_FLEXIOSRC_SHIFT), SIM_SOPT2_FLEXIOSRC_SHIFT, SIM_SOPT2_FLEXIOSRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field TPMSRC[25:24] (RW)
 *
 * Selects the clock source for the TPM counter clock
 *
 * Values:
 * - 0b00 - Clock disabled
 * - 0b01 - MCGFLLCLK , or MCGPLLCLK , or IRC48M clock as selected by
 *     SOPT2[PLLFLLSEL], and then divided by the PLLFLLCLK fractional divider as configured
 *     by SIM_CLKDIV3[PLLFLLFRAC, PLLFLLDIV].
 * - 0b10 - OSCERCLK clock
 * - 0b11 - MCGIRCLK clock
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_TPMSRC field. */
#define SIM_RD_SOPT2_TPMSRC(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_TPMSRC_MASK) >> SIM_SOPT2_TPMSRC_SHIFT)
#define SIM_BRD_SOPT2_TPMSRC(base) (BME_UBFX32(&SIM_SOPT2_REG(base), SIM_SOPT2_TPMSRC_SHIFT, SIM_SOPT2_TPMSRC_WIDTH))

/*! @brief Set the TPMSRC field to a new value. */
#define SIM_WR_SOPT2_TPMSRC(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_TPMSRC_MASK, SIM_SOPT2_TPMSRC(value)))
#define SIM_BWR_SOPT2_TPMSRC(base, value) (BME_BFI32(&SIM_SOPT2_REG(base), ((uint32_t)(value) << SIM_SOPT2_TPMSRC_SHIFT), SIM_SOPT2_TPMSRC_SHIFT, SIM_SOPT2_TPMSRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field LPUARTSRC[27:26] (RW)
 *
 * Selects the clock source for the LPUART transmit and receive clock.
 *
 * Values:
 * - 0b00 - Clock disabled
 * - 0b01 - MCGFLLCLK , or MCGPLLCLK , or IRC48M clock as selected by
 *     SOPT2[PLLFLLSEL], and then divided by the PLLFLLCLK fractional divider as configured
 *     by SIM_CLKDIV3[PLLFLLFRAC, PLLFLLDIV].
 * - 0b10 - OSCERCLK clock
 * - 0b11 - MCGIRCLK clock
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_LPUARTSRC field. */
#define SIM_RD_SOPT2_LPUARTSRC(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_LPUARTSRC_MASK) >> SIM_SOPT2_LPUARTSRC_SHIFT)
#define SIM_BRD_SOPT2_LPUARTSRC(base) (BME_UBFX32(&SIM_SOPT2_REG(base), SIM_SOPT2_LPUARTSRC_SHIFT, SIM_SOPT2_LPUARTSRC_WIDTH))

/*! @brief Set the LPUARTSRC field to a new value. */
#define SIM_WR_SOPT2_LPUARTSRC(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_LPUARTSRC_MASK, SIM_SOPT2_LPUARTSRC(value)))
#define SIM_BWR_SOPT2_LPUARTSRC(base, value) (BME_BFI32(&SIM_SOPT2_REG(base), ((uint32_t)(value) << SIM_SOPT2_LPUARTSRC_SHIFT), SIM_SOPT2_LPUARTSRC_SHIFT, SIM_SOPT2_LPUARTSRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field SDHCSRC[29:28] (RW)
 *
 * Selects the clock source for the SDHC clock .
 *
 * Values:
 * - 0b00 - Core/system clock.
 * - 0b01 - MCGFLLCLK, or MCGPLLCLK , or IRC48M clock as selected by
 *     SOPT2[PLLFLLSEL].
 * - 0b10 - OSCERCLK clock
 * - 0b11 - External bypass clock (SDHC0_CLKIN)
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_SDHCSRC field. */
#define SIM_RD_SOPT2_SDHCSRC(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_SDHCSRC_MASK) >> SIM_SOPT2_SDHCSRC_SHIFT)
#define SIM_BRD_SOPT2_SDHCSRC(base) (BME_UBFX32(&SIM_SOPT2_REG(base), SIM_SOPT2_SDHCSRC_SHIFT, SIM_SOPT2_SDHCSRC_WIDTH))

/*! @brief Set the SDHCSRC field to a new value. */
#define SIM_WR_SOPT2_SDHCSRC(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_SDHCSRC_MASK, SIM_SOPT2_SDHCSRC(value)))
#define SIM_BWR_SOPT2_SDHCSRC(base, value) (BME_BFI32(&SIM_SOPT2_REG(base), ((uint32_t)(value) << SIM_SOPT2_SDHCSRC_SHIFT), SIM_SOPT2_SDHCSRC_SHIFT, SIM_SOPT2_SDHCSRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field EMVSIMSRC[31:30] (RW)
 *
 * Selects the clock source for the EMVSIM transmit and receive clock.
 *
 * Values:
 * - 0b00 - Clock disabled
 * - 0b01 - MCGFLLCLK , or MCGPLLCLK , or IRC48M clock as selected by
 *     SOPT2[PLLFLLSEL], and then divided by the PLLFLLCLK fractional divider as configured
 *     by SIM_CLKDIV3[PLLFLLFRAC, PLLFLLDIV].
 * - 0b10 - OSCERCLK clock
 * - 0b11 - MCGIRCLK clock
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_EMVSIMSRC field. */
#define SIM_RD_SOPT2_EMVSIMSRC(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_EMVSIMSRC_MASK) >> SIM_SOPT2_EMVSIMSRC_SHIFT)
#define SIM_BRD_SOPT2_EMVSIMSRC(base) (BME_UBFX32(&SIM_SOPT2_REG(base), SIM_SOPT2_EMVSIMSRC_SHIFT, SIM_SOPT2_EMVSIMSRC_WIDTH))

/*! @brief Set the EMVSIMSRC field to a new value. */
#define SIM_WR_SOPT2_EMVSIMSRC(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_EMVSIMSRC_MASK, SIM_SOPT2_EMVSIMSRC(value)))
#define SIM_BWR_SOPT2_EMVSIMSRC(base, value) (BME_BFI32(&SIM_SOPT2_REG(base), ((uint32_t)(value) << SIM_SOPT2_EMVSIMSRC_SHIFT), SIM_SOPT2_EMVSIMSRC_SHIFT, SIM_SOPT2_EMVSIMSRC_WIDTH))
/*@}*/

